brew "python@3.10"
brew "ccache"
brew "cmake"
brew "ninja"
brew "leonid-s-usov/ceph/abseil@20220623.1"
brew "leonid-s-usov/ceph/re2@20230301"
cask "macfuse"
brew "gperftools"
brew "jemalloc"
brew "oath-toolkit"
brew "thrift"
brew "lua"
brew "icu4c"
brew "rabbitmq-c"
brew "librdkafka"
brew "pyyaml"
brew "gnu-getopt"
brew "lmdb"
brew "jq"
brew "pkg-config"
brew "snappy"
brew "gettext"
brew "python-setuptools"
