Repository: ceph/ceph
Catalog: src/pybind/mgr/dashboard/frontend/src/locale/messages.*.xlf
Languages: ja_jp, pl_pl, pt_br, zh_cn

source: Pauses reads and writes
ja_jp: 読み取りと書き込みを一時停止します
zh_cn: 暂停读写

source: No Scrub
ja_jp: スクラブなし
zh_cn: 不洗刷

source: Scrubbing is disabled
ja_jp: スクラブ処理は無効化されています
zh_cn: 禁止洗刷

source: No Deep Scrub
ja_jp: ディープスクラブなし
zh_cn: 不深层洗刷

source: Deep Scrubbing is disabled
ja_jp: ディープスクラブ処理は無効化されています
zh_cn: 禁止深层洗刷

source: No Backfill
ja_jp: バックフィルなし
zh_cn: 不回填

source: Backfilling of PGs is suspended
ja_jp: 配置グループのバックフィルは中断されています
zh_cn: 暂停 PG 回填

source: No Rebalance
ja_jp: リバランスなし
zh_cn: 不重新平衡

source: OSD will choose not to backfill unless PG is also degraded
ja_jp: 配置グループも降格されない限り、OSDはバックフィルを選択しません
zh_cn: OSD 将不选择回填，除非 PG 也已降级

source: No Recover
ja_jp: 回復なし
zh_cn: 不恢复

source: Recovery of PGs is suspended
ja_jp: 配置グループの回復は中断されています
zh_cn: 暂停 PG 恢复

source: Bitwise Sort
ja_jp: ビット単位のソート
zh_cn: 逐位排序

source: Use bitwise sort
ja_jp: ビット単位のソートを使用する
zh_cn: 使用逐位排序

source: Purged Snapdirs
ja_jp: 消去されたスナップディレクトリ
zh_cn: 已清除 Snapdir

source: OSDs have converted snapsets
ja_jp: OSDによってスナップセットが変換されました
zh_cn: OSD 已转换 snapset

source: Recovery Deletes
ja_jp: 回復の削除
zh_cn: 在恢复时执行删除

source: Deletes performed during recovery instead of peering
ja_jp: ピアリングの代わりに回復時に削除が実行されました
zh_cn: 在恢复时而非对等互联期间执行删除

source: PG Log Hard Limit
ja_jp: 配置グループログのハード制限
zh_cn: PG 日志硬限制

source: Puts a hard limit on pg log length
ja_jp: 配置グループログ長のハード制限を適用します
zh_cn: 为 pg 日志长度设置硬限制

source: Shared devices
ja_jp: 共有デバイス
zh_cn: 共享设备

source: WAL slots
ja_jp: WALスロット
zh_cn: WAL 槽

source: How many OSDs per WAL device.
ja_jp: WALデバイスごとのOSDの数。
zh_cn: 一个 WAL 设备对应的 OSD 数量。

source: Specify 0 to let Orchestrator backend decide it.
ja_jp: Orchestratorバックエンドに決定させるには、0を指定してください。
zh_cn: 指定 0 可让 Orchestrator 后端决定数量。

source: Value should be greater than or equal to 0
ja_jp: 値は0以上である必要があります
zh_cn: 值应大于或等于 0

source: DB slots
ja_jp: DBスロット
zh_cn: DB 槽

source: How many OSDs per DB device.
ja_jp: DBデバイスごとのOSDの数。
zh_cn: 一个 DB 设备对应的 OSD 数量。

source: Encryption
ja_jp: 暗号化
zh_cn: 加密

source: OSDs List
ja_jp: OSDリスト
pl_pl: Lista OSD-ków
pt_br: Lista de OSDs
zh_cn: OSD 列表

source: OSD(s) {{ osdIds | join }} will be marked {{ markActionDescription }} if you proceed.
ja_jp: 続行した場合、 OSD {{ osdIds | join }} は {{ markActionDescription }} とマークされます。
zh_cn: 如果继续， OSD {{ osdIds | join }} 将被标记为 {{ markActionDescription }} 。

source: {VAR_SELECT, select, true {OSD is} other {OSDs are}}
zh_cn: {VAR_SELECT, select, true {OSD} other {OSD}}

source: OSD {{ osdIds | join }} will be {{ actionDescription }} if you proceed.
ja_jp: 続行した場合は、 OSD {{ osdIds | join }} は {{ actionDescription }} されます。
zh_cn: 如果继续， OSD {{ osdIds | join }} 将会 {{ actionDescription }} 。

source: Preserve OSD ID(s) for replacement.
ja_jp: 交換用にOSD IDを保持します。
zh_cn: 保留 OSD ID 以便替换。

source: out
ja_jp: アウト
zh_cn: 除名

source: in
ja_jp: イン
zh_cn: 加入

source: down
ja_jp: ダウン
zh_cn: 停用

source: Mark
ja_jp: マーク
zh_cn: 标记

source: OSD lost
ja_jp: 喪失したOSD
zh_cn: OSD 丢失

source: marked lost
ja_jp: 喪失としてマーク済み
zh_cn: 已标记为丢失

source: Purge
ja_jp: 消去
zh_cn: 清除

source: purged
ja_jp: 消去済み
zh_cn: 已清除

source: destroy
ja_jp: 破棄
zh_cn: 销毁

source: destroyed
ja_jp: 破棄済み
zh_cn: 已销毁

source: Flags
ja_jp: フラグ
zh_cn: 标志

source: Recovery Priority
ja_jp: 回復優先度
zh_cn: 恢复优先级

source: PG scrub
ja_jp: 配置グループスクラブ
zh_cn: PG 洗刷

source: Device class
ja_jp: デバイスクラス
zh_cn: 设备类型

source: PGs
ja_jp: 配置グループ数
zh_cn: PG

source: Read bytes
ja_jp: 読み取りバイト数
zh_cn: 读字节数

source: Write bytes
ja_jp: 書き込みバイト数
zh_cn: 写字节数

source: Read ops
ja_jp: 読み取り操作数
zh_cn: 读操作数

source: Write ops
ja_jp: 書き込み操作数
zh_cn: 写操作数

source: Edit OSD: selectedOsd.id
ja_jp: OSDの編集: selectedOsd.id
zh_cn: 编辑 OSD： selectedOsd.id

source: Edit OSD
ja_jp: OSDの編集
zh_cn: 编辑 OSD

source: Updated OSD ' selectedOsd.id'
ja_jp: OSD「 selectedOsd.id」を更新しました
zh_cn: 已更新 OSD " selectedOsd.id"

source: Mark OSD markAction
ja_jp: OSD markActionをマーク
zh_cn: 将 OSD 标记为 markAction

source: Mark markAction
ja_jp: markActionをマーク
zh_cn: 标记为 markAction

source: delete
ja_jp: 削除
zh_cn: 删除

source: deleted
ja_jp: 削除済み
zh_cn: 已删除

source: Advanced configuration options
ja_jp: 高度な設定オプション
zh_cn: 高级配置选项

source: PG scrub options
ja_jp: 配置グループスクラブオプション
zh_cn: PG 洗刷选项

source: Updated PG scrub options
ja_jp: 配置グループスクラブオプションを更新しました
zh_cn: 已更新 PG 洗刷选项

source: OSD Recovery Priority
ja_jp: OSD回復優先度
pl_pl: Priorytet odzyskiwania OSD
pt_br: Prioridade de Recuperação de OSD
zh_cn: OSD 恢复优先级

source: Priority
ja_jp: 優先度
pl_pl: Priorytet
pt_br: Prioridade
zh_cn: 优先级

source: Customize priority values
ja_jp: 優先度値のカスタマイズ
pl_pl: Dostosuj wartości priorytetowe
pt_br: Personalizar valores de prioridade
zh_cn: 自定义优先级值

source: This field is required!
ja_jp: このフィールドは必須です。
pl_pl: To pole jest wymagane.
pt_br: Este campo é obrigatório!
zh_cn: 这是必填字段！

source: The entered value is too high! It must not be greater than {{ attr.value.maxValue }}.
ja_jp: 入力された値は大きすぎます。 {{ attr.value.maxValue }}より大きい値を入力することはできません。
pl_pl: Podana wartość jest za wysoka. Nie może być większa niż {{ attr.value.maxValue }}.
zh_cn: 输入的值太大！值不得大于 {{ attr.value.maxValue }}。

source: The entered value is too low! It must not be lower than {{ attr.value.minValue }}.
ja_jp: 入力された値は小さすぎます。 {{ attr.value.minValue }}より小さい値を入力することはできません。
pl_pl: Podana wartość jest za mała! Nie może być mniejsza od {{ attr.value.minValue }}.
zh_cn: 输入的值太小！值不得小于 {{ attr.value.minValue }}。

source: Max Backfills
ja_jp: 最大バックフィル数
zh_cn: 最大回填量

source: Recovery Max Active
ja_jp: 回復最大アクティブ
zh_cn: 最大活跃恢复请求数

source: Recovery Max Single Start
ja_jp: 回復最大単一始動
zh_cn: 最大单次恢复操作数

source: Recovery Sleep
ja_jp: 回復スリープ
zh_cn: 恢复/回填操作间隔睡眠时间

source: Custom
ja_jp: カスタム
zh_cn: 自定义

source: Updated OSD recovery speed priority ' this.osdRecvSpeedForm.getValue( 'priority' )'
ja_jp: OSDの回復速度優先度「 this.osdRecvSpeedForm.getValue( 'priority' )」を更新しました
zh_cn: 已更新 OSD 恢复速度优先级 " this.osdRecvSpeedForm.getValue( 'priority' )"

source: Reweight OSD: {{ osdId }}
ja_jp: 再重みづけOSD: {{ osdId }}
zh_cn: 重设 OSD 的权重： {{ osdId }}

source: The value needs to be between 0 and 1.
ja_jp: 値は0と1の間である必要があります。
pl_pl: Wartość powinna być pomiędzy 0 a 1.
pt_br: O valor precisa ser entre 0 e 1.
zh_cn: 值应介于 0 到 1 之间。

source: OSDs {deep, select, true {Deep } other {}}Scrub
ja_jp: OSD {deep, select, true {Deep } other {}}スクラブ
zh_cn: OSD {deep, select, true {Deep } other {}}洗刷

source: {VAR_SELECT, select, true {Deep } other {}}
zh_cn: {VAR_SELECT, select, true {深层} other {}}

source: You are about to apply a {deep, select, true {deep } other {}}scrub to the OSD(s): {{ selected | join }} .
ja_jp: {deep, select, true {deep } other {}}スクラブをOSD {{ selected | join }} に適用しようとしています。
zh_cn: 您即将对以下 OSD 应用 {deep, select, true {deep } other {}}洗刷： {{ selected | join }} 。

source: {VAR_SELECT, select, true {deep } other {}}
zh_cn: {VAR_SELECT, select, true {深层} other {}}

source: operation was initialized in the following OSD(s): this.joinPipe.transform( this.selected )
ja_jp: operationは次のOSDで初期化されました: this.joinPipe.transform( this.selected )
zh_cn: 已在下列 OSD 中初始化 operation： this.joinPipe.transform( this.selected )

source: To see all active Prometheus alerts, please provide the URL to the API of Prometheus' Alertmanager as described in the .
ja_jp: すべてのアクティブなPrometheusアラートを表示するには、 の説明に従って、PrometheusのAlertmanagerのAPIにURLを提供してください。
zh_cn: 要查看所有活动的 Prometheus 告警，请按 中所述向 Prometheus 告警管理器 API 提供 URL。

source: Create Silence
ja_jp: サイレンスの作成
zh_cn: 创建静默

source: Severity
ja_jp: 重大度
zh_cn: 严重程度

source: Started
ja_jp: 始動済み
zh_cn: 已启动

source: Alerts
ja_jp: アラート
pl_pl: Powiadomienia
pt_br: Alertas
zh_cn: 警告

source: Silences
ja_jp: サイレンス
zh_cn: 静默

source: To see all configured Prometheus alerts, please provide the URL to the API of Prometheus as described in the .
ja_jp: すべての設定済みのPrometheusアラートを表示するには、 の説明に従って、PrometheusのAPIにURLを提供してください。
zh_cn: 要查看所有已配置的 Prometheus 告警，请按 中所述向 Prometheus 的 API 提供 URL。

source: Group
ja_jp: グループ
zh_cn: 组

source: Duration
ja_jp: 期間
zh_cn: 时长

source: Query
ja_jp: クエリ
zh_cn: 查询

source: Edit
ja_jp: 編集
pl_pl: Edytuj
pt_br: Editar
zh_cn: 编辑

source: Delete
ja_jp: 削除
pl_pl: Usuń
pt_br: Excluir
zh_cn: 删除

source: Editing a silence will expire the old silence and recreate it as a new silence
ja_jp: サイレンスを編集すると、古いサイレンスが期限切れになり、新しいサイレンスとして再作成されます
zh_cn: 编辑静默将会使旧静默过期并将其重新创建为新静默

source: Creator
ja_jp: 作成者
zh_cn: 创建者

source: Comment
ja_jp: コメント
zh_cn: 注释

source: Start time
ja_jp: 開始時刻
zh_cn: 开始时间

source: If the start time lies in the past the creation time will be used
ja_jp: 開始時刻が過去の場合は作成時刻が使用されます
zh_cn: 如果开始时间为过去时间，将使用创建时间

source: Duration
ja_jp: 期間
zh_cn: 时长

source: End time
ja_jp: 終了時刻
zh_cn: 结束时间

source: Matchers
ja_jp: マッチャー
zh_cn: 匹配器

source: A silence requires at least one matcher
ja_jp: サイレンスには少なくとも1つのマッチャーが必要です
zh_cn: 一个静默至少需要一个匹配器

source: Add matcher
ja_jp: マッチャーの追加
zh_cn: 添加匹配器

source: silence
ja_jp: サイレンス
zh_cn: 静默

source: Attribute name
ja_jp: 属性名
zh_cn: 属性名称

source: Regular expression
ja_jp: 正規表現
zh_cn: 正则表达式

source: Please add your Prometheus host to the dashboard configuration and refresh the page
ja_jp: ダッシュボード設定にPrometheusホストを追加して、ページを更新してください
zh_cn: 请将您的 Prometheus 主机添加到仪表盘配置中，然后刷新页面

source: To enable Silences, please provide the URL to the API of the Prometheus' Alertmanager as described in the .
ja_jp: サイレンスを有効にするには、 の説明に従ってPrometheusのAlertmanagerのAPIにURLを提供してください。
zh_cn: 要启用 "静默"，请按 中所述向 Prometheus 告警管理器 API 提供 URL。

source: Created by
ja_jp: 作成者
zh_cn: 创建者

source: Ends
ja_jp: 終了
zh_cn: 结束

source: Silence
ja_jp: サイレンス
zh_cn: 静默

source: {VAR_SELECT, select, true {Edit} other {Add}}
zh_cn: {VAR_SELECT, select, true {编辑} other {添加}}

source: {editMode, select, true {Edit} other {Add}} Matcher
ja_jp: {editMode, select, true {Edit} other {Add}}マッチャー
zh_cn: {editMode, select, true {Edit} other {Add}}匹配器

source: -- Select an attribute to match against --
ja_jp: -- 一致する属性を選択してください --
zh_cn: --请选择要匹配的属性--

source: Value
ja_jp: 値
pl_pl: Wartość
pt_br: Valor
zh_cn: 值

source: Use regular expression
ja_jp: 正規表現を使う
zh_cn: 使用正则表达式

source: no spec
ja_jp: 仕様なし
zh_cn: 无规范

source: unmanaged
ja_jp: 管理対象外
zh_cn: 非受管

source: count: count
ja_jp: カウント: count
zh_cn: 计数： count

source: label: label
ja_jp: ラベル: label
zh_cn: 标签： label

source: Service Events
ja_jp: サービスイベント
zh_cn: 服务事件

source: Last Refreshed
ja_jp: 最終更新日時
zh_cn: 上次刷新

source: Daemon Events
ja_jp: デーモンイベント
zh_cn: 守护进程事件

source: Service Name
ja_jp: サービス名
zh_cn: 服务名称

source: Service Type
ja_jp: サービスタイプ
zh_cn: 服务类型

source: Service Events
ja_jp: サービスイベント
zh_cn: 服务事件

source: -- Select a service type --
ja_jp: -- サービスタイプを選択してください --
zh_cn: -- 请选择服务类型 --

source: Backend Service
ja_jp: バックエンドサービス
zh_cn: 后端服务

source: -- No service available --
ja_jp: -- 使用可能なサービスがありません --
zh_cn: -- 没有可用的服务 --

source: The value does not match the pattern <service_id>[.<realm_name>.<zone_name>] .
ja_jp: 値がパターン &lt;service_id&gt;[.&lt;realm_name&gt;.&lt;zone_name&gt;] と一致しません。
zh_cn: 该值与模式 &lt;service_id&gt;[.&lt;realm_name&gt;.&lt;zone_name&gt;] 不匹配。

source: Unmanaged
ja_jp: 管理対象外
zh_cn: 非受管

source: Placement
ja_jp: 配置
zh_cn: 归置

source: Label
ja_jp: ラベル
zh_cn: 标签

source: Count
ja_jp: カウント
zh_cn: 计数

source: Only that number of daemons will be created.
ja_jp: その数のデーモンのみが作成されます。
zh_cn: 系统将只创建该数量的守护进程。

source: The value must be at least 1.
ja_jp: 値は1以上にする必要があります。
zh_cn: 值必须至少为 1。

source: Port
ja_jp: ポート
zh_cn: 端口

source: The value cannot exceed 65535.
ja_jp: 値は65535を超えることはできません。
zh_cn: 值不得超过 65535。

source: -- No pools available --
ja_jp: -- 使用可能なポートがありません --
zh_cn: -- 没有可用的存储池 --

source: Trusted IPs
ja_jp: 信頼されたIP
zh_cn: 可信 IP

source: Comma separated list of IP addresses.
ja_jp: IPアドレスのカンマ区切りリスト。
zh_cn: IP 地址逗号分隔列表。

source: Please add the Ceph Manager IP addresses here, otherwise the iSCSI gateways can't be reached.
ja_jp: Ceph Manager IPアドレスをここに追加してください。追加しないと、iSCSIゲートウェイに到達できません。
zh_cn: 请在此处添加 Ceph Manager IP 地址，否则将无法连接到 iSCSI 网关。

source: Virtual IP
ja_jp: 仮想IP
zh_cn: 虚拟 IP

source: The virtual IP address and subnet (in CIDR notation) where the ingress service will be available.
ja_jp: 入力サービスが使用可能になる仮想IPアドレスとサブネット(CIDR表記)。
zh_cn: 可以使用入站服务的虚拟 IP 地址和子网（采用 CIDR 表示法）。

source: Frontend Port
ja_jp: フロントエンドポート
zh_cn: 前端端口

source: The port used to access the ingress service.
ja_jp: 入力サービスへのアクセスに使用されるポート。
zh_cn: 用于访问入站服务的端口。

source: Monitor Port
ja_jp: モニターポート
zh_cn: Monitor 端口

source: The port used by haproxy for load balancer status.
ja_jp: ロードバランサの状態のためにhaproxyが使用するポート。
zh_cn: HAProxy 用于获取负载平衡器状态的端口。

source: CIDR Networks
ja_jp: CIDRネットワーク
zh_cn: CIDR 网络

source: A list of networks to identify which network interface to use for the virtual IP address.
ja_jp: 仮想IPアドレスに使用するネットワークインターフェイスを識別するためのネットワークのリスト。
zh_cn: 用于标识虚拟 IP 地址所用网络接口的网络列表。

source: Version
ja_jp: バージョン
pl_pl: Wersja
pt_br: Versão
zh_cn: 版本

source: -- Select SNMP version --
ja_jp: -- SNMPバージョンを選択してください --
zh_cn: -- 请选择 SNMP 版本 --

source: Destination
ja_jp: 宛先
zh_cn: 目标

source: Must be of the format hostname:port.
ja_jp: hostname:portの形式にする必要があります
zh_cn: 必须采用 "主机名:端口" 格式。

source: The value does not match the pattern: hostname:port
ja_jp: 値がパターン hostname:port と一致しません
zh_cn: 该值与模式 主机名:端口 不匹配

source: Engine Id
ja_jp: エンジンID
zh_cn: 引擎 ID

source: Unique identifier for the device (in hex).
ja_jp: デバイスの固有の識別子(16進数)。
zh_cn: 设备的唯一标识符（采用十六进制）。

source: The value does not match the pattern: Must be in hexadecimal and length must be multiple of 2 with min value = 10 amd max value = 64.
ja_jp: 値がパターン と一致しません。16進数で指定し、長さは2の倍数で、最小値は10および最大値は64にする必要があります。
zh_cn: 该值与以下模式不匹配： 必须为十六进制且长度必须为 2 的倍数，最小值为 10，最大值为 64 。

source: Auth Protocol
ja_jp: 認証プロトコル
zh_cn: 身份验证协议

source: -- Select auth protocol --
ja_jp: -- 認証プロトコルを選択してください --
zh_cn: -- 请选择身份验证协议 --

source: Privacy Protocol
ja_jp: プライバシープロトコル
zh_cn: 隐私协议

source: -- Select privacy protocol --
ja_jp: -- プライバシープロトコルを選択してください --
zh_cn: -- 请选择隐私协议 --

source: Credentials
ja_jp: 資格情報
zh_cn: 身份凭证

source: SNMP Community
ja_jp: SNMPコミュニティ
zh_cn: SNMP 社区

source: Username
ja_jp: ユーザ名
pl_pl: Nazwa użytkownika
pt_br: Nome de usuário
zh_cn: 用户名

source: Encryption
ja_jp: 暗号化
zh_cn: 加密

source: Certificate
ja_jp: 証明書
zh_cn: 证书

source: The SSL certificate in PEM format.
ja_jp: PEM形式のSSL証明書。
zh_cn: PEM 格式的 SSL 证书。

source: Invalid SSL certificate.
ja_jp: SSL証明書が無効です。
zh_cn: SSL 证书无效。

source: Private key
ja_jp: 秘密鍵
zh_cn: 私用密钥

source: The SSL private key in PEM format.
ja_jp: PEM形式のSSL秘密鍵。
zh_cn: PEM 格式的 SSL 私用密钥。

source: Invalid SSL private key.
ja_jp: SSL秘密鍵が無効です。
zh_cn: SSL 私用密钥无效。

source: service
ja_jp: サービス
zh_cn: 服务

source: There are no hosts.
ja_jp: ホストはありません。
zh_cn: 没有主机。

source: Filter hosts
ja_jp: ホストのフィルタリング
zh_cn: 过滤主机

source: Placement
ja_jp: 配置
zh_cn: 归置

source: Running
ja_jp: 実行中
zh_cn: 正在运行

source: Step {{ step }} of 2: Telemetry report configuration
ja_jp: ステップ {{ step }}/2: テレメトリレポートの設定
zh_cn: 第 {{ step }} 步（共 2 步）：遥测报告配置

source: The telemetry module sends anonymous data about this Ceph cluster back to the Ceph developers to help understand how Ceph is used and what problems users may be experiencing. This data is visualized on public dashboards that allow the community to quickly see summary statistics on how many clusters are reporting, their total capacity and OSD count, and version distribution trends. The data being reported does not contain any sensitive data like pool names, object names, object contents, hostnames, or device serial numbers. It contains counters and statistics on how the cluster has been deployed, the version of Ceph, the distribution of the hosts and other parameters which help the project to gain a better understanding of the way Ceph is used. The data is sent secured to {{ sendToUrl }} and {{ sendToDeviceUrl }} (device report).
ja_jp: テレメトリモジュールは、このCephクラスタに関する匿名データをCeph開発者に送信します。これは、Cephの使用方法とユーザが直面している可能性のある問題を理解するのに役立ちます。 このデータは、 パブリックダッシュボード に視覚化され、これにより、コミュニティは、報告しているクラスタの数、合計容量、OSD数、バージョン配布トレンドに関するサマリ統計をすばやく確認できます。 報告されるデータにはプール名、オブジェクト名、オブジェクトの内容、ホスト名、デバイスのシリアル番号などの機密データは含まれて いません 。これには、クラスタの展開方法、Cephのバージョン、ホストの分布、およびプロジェクトがCephの使用方法をよりよく理解するのに役立つその他のパラメータに関するカウンタと統計が含まれています。データは {{ sendToUrl }}と {{ sendToDeviceUrl }}(デバイスレポート)にセキュリティ保護されて送信されます。
zh_cn: 遥测模块会将有关此 Ceph 集群的匿名数据发回给 Ceph 开发人员，以帮助其了解 Ceph 的使用情况，以及用户可能遇到了什么问题。 这些数据直观呈现在 公共仪表盘 上，社区可通过该仪表盘迅速了解以下汇总统计信息：所报告的集群数量，集群的总容量和 OSD 计数，以及版本分发趋势。 报告的数据 不 包含存储池名称、对象名称、对象内容、主机名或设备序列号等任何敏感数据。它包含有关以下信息的计数器和统计数据： 集群的部署方式、Ceph 版本、主机分布，以及有助于项目更好地了解 Ceph 使用情况的其他参数。这些数据会以安全方式发送至 {{ sendToUrl }} 和 {{ sendToDeviceUrl }}（设备报告）。

source: Deactivate
ja_jp: 無効にする
zh_cn: 停用

source: Channels
ja_jp: チャネル
zh_cn: 通道

source: The telemetry report is broken down into several "channels", each with a different type of information that can be configured below.
ja_jp: テレメトリレポートはいくつかの「チャネル」に分割され、それぞれに以下で設定可能な異なるタイプの情報が含まれています。
zh_cn: 遥测报告细分为数个 "通道"，每个通道包含不同类型的信息，您可以在下面进行配置。

source: Basic
ja_jp: 基本
zh_cn: 基本

source: Includes basic information about the cluster:
ja_jp: クラスタに関する基本情報が含まれます。
zh_cn: 包含有关集群的基本信息：

source: Capacity of the cluster
ja_jp: クラスタの容量
zh_cn: 集群容量

source: Number of monitors, managers, OSDs, MDSs, object gateways, or other daemons
ja_jp: モニター、マネージャ、OSD、MDS、オブジェクトゲートウェイ、またはその他のデーモンの数
zh_cn: Monitor、Manager、OSD、MDS、对象网关或其他守护进程的数量

source: Software version currently being used
ja_jp: 現在使用されているソフトウェアバージョン
zh_cn: 当前所使用的软件版本

source: Number and types of RADOS pools and CephFS file systems
ja_jp: RADOSプールおよびCephFSファイルシステムの数とタイプ
zh_cn: RADOS 存储池和 CephFS 文件系统的数量及类型

source: Names of configuration options that have been changed from their default (but not their values)
ja_jp: デフォルトから変更された設定オプションの名前(値ではない)
zh_cn: 默认值被更改的配置选项的名称（而不是其值）

source: Crash
ja_jp: クラッシュ
zh_cn: 崩溃

source: Includes information about daemon crashes:
ja_jp: デーモンクラッシュに関する情報が含まれます。
zh_cn: 包含有关守护进程崩溃的信息：

source: Type of daemon
ja_jp: デーモンのタイプ
zh_cn: 守护进程类型

source: Version of the daemon
ja_jp: デーモンのバージョン
zh_cn: 守护进程版本

source: Operating system (OS distribution, kernel version)
ja_jp: オペレーティングシステム(OS配布、カーネルバージョン)
zh_cn: 操作系统（操作系统发行套件、内核版本）

source: Stack trace identifying where in the Ceph code the crash occurred
ja_jp: Cephコードのどこでクラッシュが発生したかを特定するスタックトレース
zh_cn: 标识 Ceph 代码中发生崩溃的位置的堆栈跟踪

source: Device
ja_jp: デバイス
zh_cn: 设备

source: Includes information about device metrics like anonymized SMART metrics.
ja_jp: 匿名化されたSMARTメトリックなどのデバイスメトリックに関する情報が含まれます。
zh_cn: 包含有关设备度量（如匿名 SMART 度量）的信息。

source: Ident
zh_cn: 身份

source: Includes user-provided identifying information about the cluster:
ja_jp: クラスタに関するユーザ提供の識別情報が含まれます。
zh_cn: 包含用户提供的关于集群的标识信息：

source: Contact Information
ja_jp: 連絡先データ
zh_cn: 联系信息

source: Submitting any contact information is completely optional and disabled by default.
ja_jp: 連絡先データの送信は完全にオプションで、デフォルトで無効になっています。
zh_cn: 提交任何联系信息完全是可选操作，默认已被禁用。

source: Contact
ja_jp: 連絡先
zh_cn: 联系

source: My first Ceph cluster
ja_jp: 初のCephクラスタ
zh_cn: 我的首个 Ceph 集群

source: Organization
ja_jp: 組織
zh_cn: 组织

source: Organization name
ja_jp: 組織名
zh_cn: 组织名称

source: Interval
ja_jp: 間隔
zh_cn: 间隔

source: The module compiles and sends a new report every 24 hours by default. You can adjust this interval by setting a different number of hours.
ja_jp: モジュールは、デフォルトで24時間ごとに新しいレポートをコンパイルして送信します。別の時間数を設定することで、この間隔を調整できます。
zh_cn: 模块默认每 24 小时编译并发送一次新报告。您可以设置不同的小时数以调整此间隔。

source: The entered value is too low! It must be greater or equal to 8.
ja_jp: 入力された値は小さすぎます。8以上の値を入力する必要があります。
zh_cn: 输入的值过小！值必须大于或等于 8。

source: Proxy
ja_jp: プロキシ
zh_cn: 代理

source: If the cluster cannot directly connect to the configured telemetry endpoint (default telemetry.ceph.com), you can configure a HTTP/HTTPS proxy server by e.g. adding https://10.0.0.1:8080
ja_jp: クラスタが設定済みのテレメトリエンドポイント(デフォルトのtelemetry.ceph.com)に直接接続できない場合、https://10.0.0.1:8080を追加するなどして、HTTP/HTTPSプロキシサーバを設定できます
zh_cn: 如果集群无法直接连接到配置的遥测端点（默认为 telemetry.ceph.com），您可以配置 HTTP/HTTPS 代理服务器，例如，通过添加 https://10.0.0.1:8080 来配置

source: You can also include a user:pass if needed e.g. https://ceph:telemetry@10.0.0.1:8080
ja_jp: 必要に応じてuser:passを含めることもできます。例: https://ceph:telemetry@10.0.0.1:8080
zh_cn: 如果需要，您还可以包含 user:pass，例如 https://ceph:telemetry@10.0.0.1:8080

source: Note: By clicking 'Next' you will first see a preview of the report content before you can activate the automatic submission of your data.
ja_jp: メモ: ［次へ］をクリックすると、データの自動送信を有効にする前に、最初にレポートコンテンツのプレビューが表示されます。
zh_cn: 注意： 点击 "下一步" 后，您首先会看到报告内容预览，然后才能激活数据的自动提交功能。

source: Step {{ step }} of 2: Telemetry report preview
ja_jp: ステップ {{ step }}/2: テレメトリレポートのプレビュー
zh_cn: 第 {{ step }} 步（共 2 步）：遥测报告预览

source: Report ID
ja_jp: レポートID
zh_cn: 报告 ID

source: A randomized UUID to identify a particular cluster over the course of several telemetry reports.
ja_jp: いくつかのテレメトリレポートの過程で特定のクラスタを識別するためのランダム化されたUUID。
zh_cn: 随机分配的 UUID，用于在数个遥测报告中标识特定的集群。

source: The actual telemetry data that will be submitted.
ja_jp: 送信される実際のテレメトリデータ。
zh_cn: 将要提交的实际遥测数据。

source: I agree to my telemetry data being submitted under the Community Data License Agreement - Sharing - Version 1.0
ja_jp: Community Data License Agreement - Sharing - Version 1.0 に基づいて送信されるテレメトリデータに同意します
zh_cn: 我同意根据 社区数据许可协议 - 共享 - 1.0 版本 提交我的遥测数据

source: The Telemetry module has been configured and activated successfully.
ja_jp: テレメトリモジュールが設定され、正常に有効化されました。
zh_cn: 已成功配置并激活遥测模块。

source: An Error occurred while updating the Telemetry module configuration. Please Try again
ja_jp: テレメトリ モジュール設定の更新中にエラーが発生しました。 もう一度お試しください
zh_cn: 更新遥测模块配置时发生错误。请重试

source: Last 5 minutes
ja_jp: 直前の5分間
zh_cn: 过去 5 分钟

source: Last 15 minutes
ja_jp: 直前の15分間
zh_cn: 过去 15 分钟

source: Last 30 minutes
ja_jp: 直前の30分間
zh_cn: 过去 30 分钟

source: Last 3 hours
ja_jp: 直前の3時間
zh_cn: 过去 3 小时

source: Last 6 hours
ja_jp: 直前の6時間
zh_cn: 过去 6 小时

source: Last 12 hours
ja_jp: 直前の12時間
zh_cn: 过去 12 小时

source: Last 24 hours
ja_jp: 直前の24時間
zh_cn: 过去 24 小时

source: Last 2 days
ja_jp: 過去2日間
zh_cn: 过去 2 天

source: Last 7 days
ja_jp: 過去7日間
zh_cn: 过去 7 天

source: Cluster
ja_jp: クラスタ
pl_pl: Klaster
zh_cn: 集群

source: Danger
ja_jp: 危険
zh_cn: 危险

source: Warning
ja_jp: 警告
pl_pl: Ostrzeżenie
pt_br: Aviso
zh_cn: 警报

source: See Logs for more details.
ja_jp: 詳細については、「 ログ 」を参照してください。
zh_cn: 请参见 日志 了解更多详情。

source: Cluster Status
ja_jp: クラスタのステータス
pl_pl: Status klastra
pt_br: Status do Cluster
zh_cn: 集群状态

source: Monitors
ja_jp: モニター
pl_pl: Monitory
pt_br: Monitores
zh_cn: Monitor

source: OSDs
ja_jp: OSD
pl_pl: OSD-ki
zh_cn: OSD

source: Managers
ja_jp: マネージャ
zh_cn: Manager

source: Object Gateways
ja_jp: オブジェクトゲートウェイ
pl_pl: Obiekty bram
pt_br: Gateways de Objetos
zh_cn: 对象网关

source: Metadata Servers
ja_jp: メタデータサーバ
pl_pl: Serwery metadanych
pt_br: Servidores de Metadados
zh_cn: 元数据服务器

source: iSCSI Gateways
ja_jp: iSCSIゲートウェイ
pl_pl: Bramy iSCSI
pt_br: Gateways iSCSI
zh_cn: iSCSI 网关

source: Capacity
ja_jp: 容量
pl_pl: Pojemność
pt_br: Capacidade
zh_cn: 容量

source: Raw Capacity
ja_jp: 未フォーマット時の容量
pl_pl: Pojemność rzędu
pt_br: Capacidade Bruta
zh_cn: 裸容量

source: PG Status
ja_jp: 配置グループのステータス
pl_pl: Status PG
pt_br: Status do PG
zh_cn: PG 状态

source: PGs per OSD
ja_jp: OSDあたりの配置グループ数
pl_pl: PG-y na OSD
pt_br: PGs por OSD
zh_cn: 每个 OSD 的 PG 数

source: Client Read/Write
ja_jp: クライアントの読み取り/書き込み
pl_pl: Odczyt/Zapis klienta
pt_br: Leitura/Gravação do Cliente
zh_cn: 客户端读/写

source: Client Throughput
ja_jp: クライアントのスループット
pl_pl: Przepustowość klienta
pt_br: Throughput do Cliente
zh_cn: 客户端吞吐量

source: Recovery Throughput
ja_jp: 回復スループット
pl_pl: Przepustowość odzyskiwania
pt_br: Throughput de Recuperação
zh_cn: 恢复吞吐量

source: Scrubbing
ja_jp: スクラビング
zh_cn: 正在洗刷

source: Reads
ja_jp: 読み取り回数
zh_cn: 读取次数

source: Writes
ja_jp: 書き込み回数
zh_cn: 写入次数

source: Avail.
ja_jp: 使用可能
zh_cn: 可用

source: Clean
ja_jp: クリーン
zh_cn: 正常

source: Working
ja_jp: 動作中
zh_cn: 运行中

source: Unknown
ja_jp: 不明
zh_cn: 未知

source: Healthy
ja_jp: 正常
zh_cn: 运行状况良好

source: Misplaced
ja_jp: 誤配置
zh_cn: 位置不正确

source: Degraded
ja_jp: 降格
zh_cn: 已降级

source: Unfound
ja_jp: 見つからない
zh_cn: 未找到

source: objects
ja_jp: オブジェクト
zh_cn: 对象

source: here
ja_jp: ここ
zh_cn: 此处

source: up
ja_jp: アップ
zh_cn: 启用
