Repository: ceph/ceph
Catalog: src/pybind/mgr/dashboard/frontend/src/locale/messages.*.xlf
Languages: ja_jp, pl_pl, pt_br, zh_cn

source: Created namespace ' pool/ namespace'
ja_jp: ネームスペース「 pool/ namespace」を作成しました
zh_cn: 已创建名称空间 " pool/ namespace"

source: Total images
ja_jp: 合計イメージ数
zh_cn: 映像总数

source: Deleted namespace ' pool/ namespace'
ja_jp: ネームスペース「 pool/ namespace」を削除しました
zh_cn: 已删除名称空间 " pool/ namespace"

source: Namespace contains images
ja_jp: ネームスペースにはイメージが含まれています
zh_cn: 名称空间包含映像

source: RBD Snapshot
ja_jp: RBDスナップショット
zh_cn: RBD 快照

source: Snapshot must be protected in order to clone.
ja_jp: クローンを作成するには、スナップショットを保護する必要があります。
zh_cn: 快照必须处于受保护状态才能克隆。

source: You are about to rollback
ja_jp: ロールバックしようとしています
pl_pl: Zaraz się wycofasz.
pt_br: Você está prestes a fazer rollback
zh_cn: 您即将进行回滚操作

source: Used
ja_jp: 使用済み
zh_cn: 已使用

source: PROTECTED
ja_jp: 保護済み
zh_cn: 受保护

source: UNPROTECTED
ja_jp: 未保護
zh_cn: 无保护

source: Created
ja_jp: 作成済み
zh_cn: 已创建

source: RBD snapshot rollback
ja_jp: RBDスナップショットのロールバック
zh_cn: RBD 快照回滚

source: Rollback
ja_jp: ロールバック
zh_cn: 回滚

source: RBD snapshot
ja_jp: RBDスナップショット
zh_cn: RBD 快照

source: Namespaces
ja_jp: ネームスペース
zh_cn: 名称空间

source: Trash
ja_jp: ごみ箱
pl_pl: Kosz
pt_br: Lixo
zh_cn: 回收站

source: Overall Performance
ja_jp: 全体的なパフォーマンス
pl_pl: Całkowita wydajność
pt_br: Desempenho Geral
zh_cn: 总体性能

source: Purge Trash
ja_jp: ごみ箱を空にする
pl_pl: Usuń Śmieci
pt_br: Purgar Lixo
zh_cn: 清空回收站

source: Expired at
ja_jp: 失効日
pl_pl: Wygasły w
pt_br: Venceu em
zh_cn: 过期时间

source: Protected until
ja_jp: 保護の終了日
pl_pl: Zabezpieczony do
pt_br: Protegido até
zh_cn: 保护期限

source: This image is protected until {{ expiresAt | cdDate }}.
ja_jp: このイメージは {{ expiresAt | cdDate }}まで保護されます。
pl_pl: Ten obraz jest chroniony do {{ expiresAt | cdDate }}.
zh_cn: 此映像在 {{ expiresAt | cdDate }} 前始终受到保护。

source: Status
ja_jp: ステータス
zh_cn: 状态

source: Deleted At
ja_jp: 削除日時
zh_cn: 删除时间

source: Move an image to trash
ja_jp: イメージをごみ箱に移動する
pl_pl: Przenieś obraz do kosza
pt_br: Mover imagem para o lixo
zh_cn: 将映像移至回收站

source: This image contains snapshot(s), which will prevent it from being removed after moved to trash.
ja_jp: このイメージにはスナップショットが含まれているため、ごみ箱に移動した後にイメージが削除されることはありません。
zh_cn: 此映像包含快照，这将阻止映像移至回收站后被删除。

source: To move {{ imageSpecStr }} to trash, click Move . Optionally, you can pick an expiration date.
ja_jp: {{ imageSpecStr }} をごみ箱に移動するには、 ［移動］ をクリックします。希望に応じて、失効日を選択できます。
zh_cn: 要将 {{ imageSpecStr }} 移至回收站，请点击 移动 。您可以视需要选择一个超期日期。

source: Protection expires at
ja_jp: 保護の失効日
pl_pl: Zabezpieczenie wygasa w
pt_br: Vencimento da proteção em
zh_cn: 保护期截至

source: NOT PROTECTED
ja_jp: 保護されていません
pl_pl: NIEZABEZPIECZONY
pt_br: NÃO PROTEGIDO
zh_cn: 无保护

source: Wrong date format. Please use "YYYY-MM-DD HH:mm:ss".
ja_jp: 日付の形式が正しくありません。「YYYY-MM-DD HH:mm:ss」という形式を使用してください。
pl_pl: Zły format daty. Proszę używać "RRRR-MM-DD GG:mm:ss".
pt_br: Formato de data incorreto. Use "AAAA-MM-DD HH:mm:ss".
zh_cn: 日期格式有误。请使用 "YYYY-MM-DD HH:mm:ss"。

source: Protection has already expired. Please pick a future date or leave it empty.
ja_jp: 保護はすでに失効しています。将来の日付を選択するか、日付を空白のままにしてください。
pl_pl: Ochrona już wygasła. Proszę wybrać przyszłą datę lub zostawić pustą.
pt_br: A proteção já venceu. Escolha uma data no futuro ou deixe-a vazia.
zh_cn: 保护期限已过。请选择一个将来的日期或留空。

source: To purge, select All or one pool and click Purge .
ja_jp: 空にするには、 すべて または1つのプールを選択して、 ［消去］ をクリックします。
zh_cn: 要进行清除，请选择 所有 或一个存储池，然后点击 清除 。

source: Pool:
ja_jp: プール:
pl_pl: Pul:
zh_cn: 存储池：

source: Pool name...
ja_jp: プール名...
pl_pl: Nazwa pula
pt_br: Nome do pool...
zh_cn: 存储池名称...

source: All
ja_jp: すべて
pl_pl: Wszystkie
pt_br: Tudo
zh_cn: 所有

source: Restore Image
ja_jp: イメージの復元
pl_pl: Przywróć obraz
pt_br: Restaurar Imagem
zh_cn: 恢复映像

source: To restore {{ imageSpec }}@ {{ imageId }} , type the image's new name and click Restore .
ja_jp: {{ imageSpec }}@ {{ imageId }} を復元するには、イメージの新しい名前を入力して、 ［復元］ をクリックします。
zh_cn: 要恢复 {{ imageSpec }}@ {{ imageId }} ，请键入映像的新名称，然后点击 恢复 。

source: New Name
ja_jp: 新しい名前
pl_pl: Nowa Nazwa
pt_br: Novo Nome
zh_cn: 新名称

source: type
ja_jp: タイプ
zh_cn: 类型

source: state
ja_jp: 状態
zh_cn: 状态

source: version
ja_jp: バージョン
zh_cn: 版本

source: Host
ja_jp: ホスト
zh_cn: 主机

source: root
ja_jp: ルート
zh_cn: 根

source: Evicted client ' clientId'
ja_jp: クライアント「 clientId」を削除しました
zh_cn: 已逐出客户端 " clientId"

source: Ranks
ja_jp: ランク
pl_pl: Szeregi
pt_br: Posições
zh_cn: 排位

source: Standbys
ja_jp: スタンバイ
zh_cn: 待机

source: MDS performance counters
ja_jp: MDSパフォーマンスカウンタ
zh_cn: MDS 性能计数器

source: Standby daemons
ja_jp: スタンバイデーモン
zh_cn: 待机守护进程

source: Rank
ja_jp: ランク
zh_cn: 排位

source: Daemon
ja_jp: デーモン
zh_cn: 守护进程

source: Activity
ja_jp: アクティビティ
zh_cn: 活跃度

source: Dentries
ja_jp: dエントリ
zh_cn: dentry

source: Inodes
ja_jp: iノード
zh_cn: inode

source: Dirs
ja_jp: ディレクトリ
zh_cn: 目录

source: Caps
ja_jp: 大文字
zh_cn: 功能

source: Type
ja_jp: タイプ
zh_cn: 类型

source: Quotas
ja_jp: クォータ
zh_cn: 配额

source: Origin
ja_jp: 元
zh_cn: 来源

source: Path
ja_jp: パス
zh_cn: 路径

source: Cannot create snapshots for files/folders in the subvolume folders[2]
ja_jp: サブボリューム folders[2]にファイル/フォルダのスナップショットを作成できません
zh_cn: 无法创建子卷 folders[2] 中的文件/文件夹的快照

source: Max size
ja_jp: 最大サイズ
zh_cn: 最大大小

source: Max files
ja_jp: 最大ファイル数
zh_cn: 最大文件数量

source: The inherited this.getQuotaValueFromPathMsg( nextMax.value, nextMax.path ) is the maximum value to be used.
ja_jp: 継承された this.getQuotaValueFromPathMsg( nextMax.value, nextMax.path )は使用される最大値です。
zh_cn: 继承的 this.getQuotaValueFromPathMsg( nextMax.value, nextMax.path ) 为将使用的最大值。

source: Save
ja_jp: 保存
zh_cn: 保存

source: action CephFS this.getQuotaName() quota for ' path'
ja_jp: 「 path」の actionCephFS this.getQuotaName()クオータ
zh_cn: action " path" 的 CephFS this.getQuotaName() 配额

source: size
ja_jp: サイズ
zh_cn: 大小

source: files
ja_jp: ファイル数
zh_cn: 文件数量

source: this.getQuotaName() quota value from ' path'
ja_jp: 「 path」からの this.getQuotaName()クォータ value
zh_cn: " path" 中的 this.getQuotaName() 配额 value

source: Value has to be at least 0 or more
ja_jp: 値は少なくとも0以上である必要があります
zh_cn: 值必须大于或等于 0

source: Value has to be at most maxValue or less
ja_jp: 値は maxValue以下にする必要があります
zh_cn: 值必须小于或等于 maxValue

source: Updated
ja_jp: 更新済み
zh_cn: 已更新

source: in order to inherit quotaValue
ja_jp: quotaValueを継承するため
zh_cn: 以继承 quotaValue

source: which isn't used because of the inheritance of quotaValue
ja_jp: quotaValueを継承するため使用されていません
zh_cn: 未使用，因为继承了 quotaValue

source: in order to have no quota on the directory
ja_jp: ディレクトリにクォータがないようにするため
zh_cn: 为了不为目录分配配额

source: Create Snapshot
ja_jp: スナップショットの作成
zh_cn: 创建快照

source: Please enter the name of the snapshot.
ja_jp: スナップショットの名前を入力してください。
zh_cn: 请输入快照的名称。

source: Created snapshot ' name' for ' path'
ja_jp: 「 path」のスナップショット「 name」を作成しました
zh_cn: 已创建 " path" 的快照 " name"

source: CephFs Snapshot
ja_jp: CephFSスナップショット
zh_cn: CephFs 快照

source: Deleted snapshot ' name' for ' path'
ja_jp: 「 path」のスナップショット「 name」を削除しました
zh_cn: 已删除 " path" 的快照 " name"

source: Enabled
ja_jp: 有効化済み
zh_cn: 已启用

source: Clients
ja_jp: クライアント
pl_pl: Klienci
pt_br: Clientes
zh_cn: 客户端

source: Directories
ja_jp: ディレクトリ
zh_cn: 目录

source: Performance Details
ja_jp: パフォーマンスの詳細
pl_pl: Szczegóły wydajności
pt_br: Detalhes de Desempenho
zh_cn: 性能详细信息

source: Description
ja_jp: 説明
pl_pl: Opis
pt_br: Descrição
zh_cn: 描述

source: Long description
ja_jp: 長い説明
pl_pl: Długi opis
pt_br: Descrição extensa
zh_cn: 详细描述

source: Current values
ja_jp: 現行値
pl_pl: Obecne wartości
pt_br: Valores atuais
zh_cn: 当前值

source: Default
ja_jp: デフォルト
pl_pl: Domyślna
pt_br: Padrão
zh_cn: 默认值

source: Daemon default
ja_jp: デーモンのデフォルト
pl_pl: Domyślny demon
pt_br: Padrão do daemon
zh_cn: 守护进程的默认值

source: Type
ja_jp: タイプ
pl_pl: Typ
pt_br: Tipo
zh_cn: 类型

source: Min
ja_jp: 最小
pt_br: Mín.
zh_cn: 下限

source: Max
ja_jp: 最大
pt_br: Máx.
zh_cn: 上限

source: Flags
ja_jp: フラグ
pl_pl: Flagi
zh_cn: 标志

source: Services
ja_jp: サービス
pl_pl: Usługi
pt_br: Serviços
zh_cn: 服务

source: Source
ja_jp: ソース
pl_pl: Źródło
pt_br: Origem
zh_cn: 来源

source: Level
ja_jp: レベル
pl_pl: Poziom
pt_br: Nível
zh_cn: 级别

source: Can be updated at runtime (editable)
ja_jp: 実行時に更新できます(編集可能)
pl_pl: Może być aktualizowany w czasie wykonywania (edytowalny)
pt_br: Pode ser atualizado em tempo de execução (editável)
zh_cn: 可在运行时更新（可编辑）

source: Tags
ja_jp: タグ
pl_pl: Tagi
zh_cn: 标记

source: Enum values
ja_jp: 列挙値
pl_pl: Wartości enumerowane
pt_br: Valores de enum
zh_cn: 枚举值

source: See also
ja_jp: 関連項目
pl_pl: Zobacz także
pt_br: Consulte também
zh_cn: 另请参见

source: The value can be updated at runtime.
ja_jp: この値は実行時に更新できます。
zh_cn: 该值可在运行时更新。

source: Daemons/clients do not pull this value from the monitor config database. We disallow setting this option via 'ceph config set ...'. This option should be configured via ceph.conf or via the command line.
ja_jp: デーモン/クライアントはこの値をモニター設定データベースから取得しません。 このオプションを「ceph config set ...」を通じて設定することは禁止されています。 このオプションは、ceph.confまたはコマンドラインを通じて 設定する必要があります。
zh_cn: 守护进程/客户端不会从 monitor 的配置数据库提取此值。 因此不能用 "ceph config set ..." 设置此选项，但可以通过 ceph.conf 或者用命令行进行配置。

source: Option takes effect only during daemon startup.
ja_jp: オプションはデーモン始動時のみに有効になります。
zh_cn: 选项仅会在守护进程启动期间生效。

source: Option only affects cluster creation.
ja_jp: オプションはクラスタの作成のみに適用されます。
zh_cn: 选项仅会影响集群的创建。

source: Option only affects daemon creation.
ja_jp: オプションはデーモンの作成のみに適用されます。
zh_cn: 选项仅会影响守护进程的创建。

source: Values
ja_jp: 値
pl_pl: Wartości
pt_br: Valores
zh_cn: 值

source: -- Default --
ja_jp: -- デフォルト --
zh_cn: -- 默认值 --

source: The entered value is too high! It must not be greater than {{ maxValue }}.
ja_jp: 入力された値は大きすぎます。 {{ maxValue }}より大きい値を入力することはできません。
pl_pl: Podana wartość jest za wysoka. Nie może być większa niż {{ maxValue }}.
zh_cn: 输入的值太大！值不得大于 {{ maxValue }}。

source: The entered value is too low! It must not be lower than {{ minValue }}.
ja_jp: 入力された値は小さすぎます。 {{ minValue }}より小さい値を入力することはできません。
pl_pl: Podana wartość jest za mała. Nie może być mniejsza od {{ minValue }}.
zh_cn: 输入的值太小！值不得小于 {{ minValue }}。

source: Updated config option request.name
ja_jp: 設定オプション request.nameを更新しました
zh_cn: 已更新配置选项 request.name

source: Level
ja_jp: レベル
zh_cn: 级别

source: Service
ja_jp: サービス
zh_cn: 服务

source: Modified
ja_jp: 変更済み
zh_cn: 已修改

source: Current value
ja_jp: 現行値
zh_cn: 当前值

source: Editable
ja_jp: 編集可能
zh_cn: 可编辑

source: Cluster Resources
ja_jp: クラスタリソース
zh_cn: 集群资源

source: Hosts
ja_jp: ホスト
pl_pl: Hosty
zh_cn: 主机

source: Storage Capacity
ja_jp: ストレージ容量
zh_cn: 存储容量

source: Number of devices
ja_jp: デバイスの数
zh_cn: 设备数量

source: Raw capacity
ja_jp: 未フォーマット時の容量
zh_cn: 裸容量

source: CPUs
ja_jp: CPU
zh_cn: CPU

source: Memory
ja_jp: メモリ
zh_cn: 内存

source: Host Details
ja_jp: ホストの詳細
zh_cn: 主机详细信息

source: Welcome to {{ projectConstants.projectName }}
ja_jp: {{ projectConstants.projectName }}へようこそ
zh_cn: 欢迎使用 {{ projectConstants.projectName }}

source: Please expand your cluster first
ja_jp: 最初にクラスタを拡張してください
zh_cn: 请先扩展您的集群

source: Expand Cluster
ja_jp: クラスタを拡張
zh_cn: 扩展集群

source: Skip
ja_jp: スキップ
zh_cn: 跳过

source: Add Hosts
ja_jp: ホストを追加
zh_cn: 添加主机

source: Create OSDs
ja_jp: OSDを作成する
zh_cn: 创建 OSD

source: Create Services
ja_jp: サービスを作成
zh_cn: 创建服务

source: You are about to skip the cluster expansion process. You’ll need to navigate through the menu to add hosts and services.
ja_jp: クラスタ拡張プロセスをスキップしようとしています。 メニュー内を移動して、ホストとサービスを追加する 必要があります。
zh_cn: 您即将跳过集群扩展流程。您需要 在菜单中导航以添加主机和服务 。

source: Are you sure you want to continue?
ja_jp: 続行してもよろしいですか?
pl_pl: Jesteś pewny, że chcesz kontynuować?
pt_br: Deseja realmente continuar?
zh_cn: 确实要继续吗？

source: Continue
ja_jp: 続行
zh_cn: 继续

source: Cluster expansion skipped by user
ja_jp: クラスタ拡張がユーザによってスキップされました
zh_cn: 用户已跳过集群扩展

source: Cluster expansion was successful
ja_jp: クラスタ拡張に成功しました
zh_cn: 集群扩展成功

source: Expand Cluster
ja_jp: クラスタを拡張
zh_cn: 扩展集群

source: CRUSH map viewer
ja_jp: CRUSHマップビューア
pl_pl: widok CRUSH mapy
pt_br: Visualizador de mapa CRUSH
zh_cn: CRUSH 索引查看器

source: Devices
ja_jp: デバイス
zh_cn: 设备

source: Physical Disks
ja_jp: 物理ディスク
zh_cn: 物理磁盘

source: Device health
ja_jp: デバイスヘルス
zh_cn: 设备健康状况

source: No hostname found.
ja_jp: ホスト名が見つかりません。
zh_cn: 未找到主机名。

source: Hostname
ja_jp: ホスト名
pl_pl: Nazwa hosta
pt_br: Nome de host
zh_cn: 主机名

source: To add multiple hosts at once, you can enter:
ja_jp: 一度に複数のホストを追加するには、次のように入力します。
zh_cn: 要一次添加多个主机，您可以输入：

source: a comma-separated list of hostnames (e.g.: example-01,example-02,example-03) ,
ja_jp: ホスト名のカンマ区切りリスト (例: example-01,example-02,example-03) 、
zh_cn: 主机名称的逗号分隔列表 （例如：example-01,example-02,example-03） ，

source: a range expression (e.g.: example-[01-03].ceph) ,
ja_jp: 範囲式 (例: example-[01-03].ceph) 、
zh_cn: 范围表达式 （例如：example-[01-03].ceph） ，

source: a comma separated range expression (e.g.: example-[01-05].lab.com,example2-[1-4].lab.com,example3-[001-006].lab.com)
ja_jp: カンマ区切りの範囲式 (例: example-[01-05].lab.com,example2-[1-4].lab.com,example3-[001-006].lab.com)
zh_cn: 范围表达式的逗号分隔列表 （例如：example-[01-05].lab.com,example2-[1-4].lab.com,example3-[001-006].lab.com）

source: The chosen hostname is already in use.
ja_jp: 選択されたホスト名はすでに使用されています。
zh_cn: 所选主机名已被使用。

source: Network address
ja_jp: ネットワークアドレス
zh_cn: 网络地址

source: The value is not a valid IP address.
ja_jp: 値は有効なIPアドレスではありません。
zh_cn: 不合法的IP地址

source: Labels
ja_jp: ラベル
zh_cn: 标签

source: Maintenance Mode
ja_jp: 保守モード
zh_cn: 维护模式

source: There are no labels.
ja_jp: ラベルはありません。
zh_cn: 没有标签。

source: Filter or add labels
ja_jp: ラベルのフィルタリングまたは追加
zh_cn: 过滤或添加标签

source: Add label
ja_jp: ラベルの追加
zh_cn: 添加标签

source: host
ja_jp: ホスト
zh_cn: 主机

source: Hosts List
ja_jp: ホストリスト
pl_pl: Lista hostów
pt_br: Lista de Hosts
zh_cn: 主机列表

source: Data will be available only if Orchestrator is available.
ja_jp: Orchestratorが利用できる場合にのみ、データが利用できます。
zh_cn: 仅当 Orchestrator 可用时，才能获取数据。

source: SSD, NVMEs
ja_jp: SSD、NVME
zh_cn: SSD、NVME

source: Flash
ja_jp: フラッシュ
zh_cn: 闪存

source: The feature is disabled because the selected host is not managed by Orchestrator.
ja_jp: 選択したホストがOrchestratorによって管理されていないため、この機能は無効になっています。
zh_cn: 由于所选主机并不是由 Orchestrator 管理，该功能已禁用。

source: Labels
ja_jp: ラベル
zh_cn: 标签

source: Model
ja_jp: モデル
zh_cn: 型号

source: CPUs
ja_jp: CPU
zh_cn: CPU

source: Cores
ja_jp: コア
zh_cn: 内核

source: Total Memory
ja_jp: 合計メモリ
zh_cn: 总内存

source: Raw Capacity
ja_jp: 未フォーマット時の容量
zh_cn: 裸容量

source: HDDs
ja_jp: HDD
zh_cn: HDD

source: Flash
ja_jp: フラッシュ
zh_cn: 闪存

source: NICs
ja_jp: NIC
zh_cn: NIC

source: Edit Host: host.hostname
ja_jp: ホストの編集: host.hostname
zh_cn: 编辑主机： host.hostname

source: Edit Host
ja_jp: ホストの編集
zh_cn: 编辑主机

source: Updated Host " host.hostname"
ja_jp: ホスト「 host.hostname」を更新しました
zh_cn: 已更新主机 &quot; host.hostname&quot;

source: " host.hostname" moved to maintenance
ja_jp: 「 host.hostname」が保守に移動されました
zh_cn: &quot; host.hostname&quot; 已进入维护模式

source: " host.hostname" cannot be put into maintenance
ja_jp: 「 host.hostname」は保守できません
zh_cn: 无法将 &quot; host.hostname&quot; 置于维护模式

source: " host.hostname" has exited maintenance
ja_jp: 「 host.hostname」は保守を終了しました
zh_cn: &quot; host.hostname&quot; 已退出维护模式

source: " host['hostname']" stopped draining
ja_jp: 「 host['hostname']」はドレインを停止しました
zh_cn: &quot; host['hostname']&quot; 已停止排空

source: " host['hostname']" started draining
ja_jp: 「 host['hostname']」はドレインを開始しました
zh_cn: &quot; host['hostname']&quot; 已开始排空

source: Identify
ja_jp: 識別
zh_cn: 身份

source: Device path
ja_jp: デバイスパス
zh_cn: 设备路径

source: Available
ja_jp: 使用可能
zh_cn: 可用

source: Vendor
ja_jp: ベンダー
zh_cn: 供应商

source: OSDs
ja_jp: OSD
zh_cn: OSD

source: Identify device device
ja_jp: デバイス deviceの識別
zh_cn: 识别设备 device

source: Please enter the duration how long to blink the LED.
ja_jp: LEDを点滅させる時間を入力してください。
zh_cn: 请输入 LED 闪烁的时长。

source: 1 minute
ja_jp: 1分
zh_cn: 1 分钟

source: 2 minutes
ja_jp: 2分
zh_cn: 2 分钟

source: 5 minutes
ja_jp: 5分
zh_cn: 5 分钟

source: 10 minutes
ja_jp: 10分
zh_cn: 10 分钟

source: 15 minutes
ja_jp: 15分
zh_cn: 15 分钟

source: Execute
ja_jp: 実行
zh_cn: 执行

source: Identifying ' device' started on host ' hostname'
ja_jp: ホスト「 device」の識別がホスト「 hostname」で開始されました
zh_cn: 正在识别主机 " hostname" 上启动的 " device"

source: Cluster Logs
ja_jp: クラスタログ
pl_pl: Logi z klastra
pt_br: Registros do Cluster
zh_cn: 集群日志

source: Audit Logs
ja_jp: 監査ログ
pl_pl: Audyt logów
pt_br: Registros de Auditoria
zh_cn: 审计日志

source: Priority:
ja_jp: 優先度:
zh_cn: 优先级：

source: Keyword:
ja_jp: キーワード:
zh_cn: 关键字

source: Date:
ja_jp: 日付:
zh_cn: 日期

source: Time range:
ja_jp: 時刻の範囲:
zh_cn: 时间范围：

source: No log entries found. Please try to select different filter options.
ja_jp: ログエントリが見つかりません。別のフィルタオプションを選択してみてください。
zh_cn: 未找到任何日志条目。请尝试选择不同的过滤选项。

source: Reset filter.
ja_jp: フィルタをリセットします。
zh_cn: 重置过滤器。

source: Edit Manager module
ja_jp: マネージャモジュールの編集
pl_pl: Edytuj moduł zarządzania
pt_br: Editar módulo do gerenciador
zh_cn: 编辑 Manager 模块

source: The entered value is not a valid UUID, e.g.: 67dcac9f-2c03-4d6c-b7bd-1210b3a259a8
ja_jp: 入力された値は有効なUUIDではありません(有効なUUIDの例: 67dcac9f-2c03-4d6c-b7bd-1210b3a259a8)。
pl_pl: Wpisana wartość nie jest poprawnym UUID, np. 67dcac9f-2c03-4d6c-b7bd-1210b3a259a8
pt_br: O valor inserido não é um UUID válido. Ex.: 67dcac9f-2c03-4d6c-b7bd-1210b3a259a8
zh_cn: 输入的值不是有效的 UUID，例如：67dcac9f-2c03-4d6c-b7bd-1210b3a259a8

source: The entered value needs to be a valid IP address.
ja_jp: 有効なIPアドレスを入力する必要があります。
pl_pl: Wpisana wartość musi być poprawnym adresem IP
pt_br: O valor inserido precisa ser um endereço IP válido.
zh_cn: 输入的值应该是有效的 IP 地址。

source: The entered value is too high! It must be lower or equal to {{ moduleOption.value.max }}.
ja_jp: 入力された値は大きすぎます。 {{ moduleOption.value.max }}以下の値を入力する必要があります。
pl_pl: Podana wartość jest za wysoka! Musi być mniejsza bądź równa {{ moduleOption.value.max }}.
zh_cn: 输入的值太大！值必须小于或等于 {{ moduleOption.value.max }}。

source: The entered value is too low! It must be greater or equal to {{ moduleOption.value.min }}.
ja_jp: 入力された値は小さすぎます。 {{ moduleOption.value.min }}以上の値を入力する必要があります。
pl_pl: Podana wartość jest za niska! Musi być większa bądź równa {{ moduleOption.value.min }}.
zh_cn: 输入的值太小！值必须大于或等于 {{ moduleOption.value.min }}。

source: The entered value needs to be a number.
ja_jp: 数字を入力する必要があります。
pl_pl: Podana wartość musi być liczbą
pt_br: O valor inserido precisa ser um número.
zh_cn: 输入的值应该是数字。

source: The entered value needs to be a number or decimal.
ja_jp: 数字または小数を入力する必要があります。
pl_pl: Podana wartość musi być liczbą albo dziesiętną.
pt_br: O valor inserido precisa ser um número ou decimal.
zh_cn: 输入的值应该是数字或小数。

source: Updated options for module ' this.moduleName'.
ja_jp: モジュール「 this.moduleName」のオプションを更新しました。
zh_cn: 已更新模块 " this.moduleName" 的选项。

source: Always-On
ja_jp: 常にオン
zh_cn: 始终启用

source: Edit
ja_jp: 編集
zh_cn: 编辑

source: Enable
ja_jp: 有効化
zh_cn: 启用

source: Disable
ja_jp: 無効化
zh_cn: 禁用

source: This Manager module is always on.
ja_jp: このマネージャモジュールは常にオンになっています。
zh_cn: 此 Manager 模块始终处于启用状态。

source: Reconnecting, please wait ...
ja_jp: 再接続していますので、しばらくお待ちください...
zh_cn: 正在重新连接，请稍候...

source: Status
ja_jp: ステータス
zh_cn: 状态

source: Cluster ID
ja_jp: クラスタID
pl_pl: Klaster ID
pt_br: ID do Cluster
zh_cn: 集群 ID

source: monmap modified
ja_jp: monmapが変更されました
pl_pl: Zmodyfikowana monmapa
pt_br: monmap modificado
zh_cn: monmap 修改时间

source: monmap epoch
ja_jp: monmapエポック
pl_pl: epoka monmap
pt_br: época de monmap
zh_cn: monmap 版本编号

source: quorum con
ja_jp: 定数con
pl_pl: kworum con
zh_cn: 仲裁 con

source: quorum mon
ja_jp: 定数mon
pl_pl: kworum mon
zh_cn: 仲裁 mon

source: required con
ja_jp: 必須のcon
pl_pl: wymagany con
pt_br: con obrigatório
zh_cn: 所需 con

source: required mon
ja_jp: 必須のmon
pl_pl: Wymagane mon
pt_br: mon obrigatório
zh_cn: 所需 mon

source: In Quorum
ja_jp: 定数内
pl_pl: W kworum
pt_br: No Quorum
zh_cn: 仲裁成员

source: Not In Quorum
ja_jp: 非定数内
pl_pl: Nie w kworum
pt_br: Não está no Quorum
zh_cn: 非仲裁成员

source: Public Address
ja_jp: パブリックアドレス
zh_cn: 公用地址

source: Open Sessions
ja_jp: セッションの開始
zh_cn: 活动会话

source: OSD creation preview
ja_jp: OSD作成プレビュー
zh_cn: OSD 创建预览

source: DriveGroups
zh_cn: DriveGroup

source: Attributes (OSD map)
ja_jp: 属性(OSDマップ)
pl_pl: Atrybuty (mapa OSD-ków)
pt_br: Atributos (mapa OSD)
zh_cn: 属性（OSD 索引）

source: Metadata
ja_jp: メタデータ
pl_pl: Metadane
pt_br: Metadados
zh_cn: 元数据

source: Metadata not available
ja_jp: メタデータを使用できません
pl_pl: Niedostępne metadane
pt_br: Metadados não disponíveis
zh_cn: 元数据不可用

source: Performance counter
ja_jp: パフォーマンスカウンタ
pl_pl: Licznik wydajności
pt_br: Contador de desempenho
zh_cn: 性能计数器

source: {{ name }} devices
ja_jp: {{ name }}デバイス
zh_cn: {{ name }} 设备

source: The primary storage devices. These devices contain all OSD data.
ja_jp: プライマリストレージデバイス。これらのデバイスにはすべてのOSDデータが含まれています。
zh_cn: 主存储设备。这些设备包含所有 OSD 数据。

source: Write-Ahead-Log devices. These devices are used for BlueStore’s internal journal. It is only useful to use a WAL device if the device is faster than the primary device (e.g. NVME devices or SSDs). If there is only a small amount of fast storage available (e.g., less than a gigabyte), we recommend using it as a WAL device.
ja_jp: Write-Ahead-Logデバイス。これらのデバイスは、BlueStoreの内部ジャーナルに使用されます。WALデバイスを使用するのは、デバイスがプライマリデバイス(NVMEデバイスやSSDなど)より高速である場合にのみ役立ちます。使用可能な高速ストレージが少量(ギガバイト未満など)の場合は、WALデバイスとして使用することをお勧めします。
zh_cn: 预写式日志设备。这些设备用于存储 BlueStore 的内部日志。仅当 WAL 设备速度快于主设备（例如 NVME 设备或 SSD）时，才适合使用 WAL 设备。如果可用的快速存储空间很少（例如不到 1 GB），我们建议将其用作 WAL 设备。

source: DB devices can be used for storing BlueStore’s internal metadata. It is only helpful to provision a DB device if it is faster than the primary device (e.g. NVME devices or SSD).
ja_jp: DBデバイスは、BlueStoreの内部メタデータの保存に使用できます。DBデバイスのプロビジョニングは、プライマリデバイス(NVMEデバイスやSSDなど)より高速である場合にのみ役立ちます。
zh_cn: DB 设备可用于存储 BlueStore 的内部元数据。仅当 DB 设备速度快于主设备（例如 NVME 设备或 SSD）时，才适合供给 DB 设备。

source: Add
ja_jp: 追加
pl_pl: Dodaj
pt_br: Adicionar
zh_cn: 添加

source: Clear
ja_jp: クリア
zh_cn: 清除

source: Raw capacity: {{ capacity | dimlessBinary }}
ja_jp: 未フォーマット時の容量: {{ capacity | dimlessBinary }}
zh_cn: 裸容量： {{ capacity | dimlessBinary }}

source: No available devices
ja_jp: 利用可能なデバイスがありません
zh_cn: 没有可用的设备

source: Please add primary devices first
ja_jp: 最初にプライマリデバイスを追加してください
zh_cn: 请先添加主设备

source: Add devices by using filters
ja_jp: フィルタを使用してデバイスを追加します
zh_cn: 使用过滤器添加设备

source: {{ deviceType }} devices
ja_jp: {{ deviceType }}デバイス
zh_cn: {{ deviceType }} 设备

source: At least one of these filters must be applied in order to proceed:
ja_jp: 続行するには、これらのフィルタの少なくとも1つを適用する必要があります。
zh_cn: 至少须应用以下过滤器之一才能继续：

source: Number of devices: {{ filteredDevices.length }}. Raw capacity: {{ capacity | dimlessBinary }}.
ja_jp: デバイス数: {{ filteredDevices.length }}。未フォーマット時の容量: {{ capacity | dimlessBinary }}。
zh_cn: 设备数量： {{ filteredDevices.length }}。裸容量： {{ capacity | dimlessBinary }}。

source: Individual OSD Flags
ja_jp: 個々のOSDフラグ
zh_cn: 各 OSD 标志

source: Cluster-wide
ja_jp: クラスタ全体
zh_cn: 集群范围

source: Restore previous selection
ja_jp: 以前の選択の復元
zh_cn: 恢复先前的选择

source: No Up
ja_jp: アップなし
zh_cn: 不启用

source: OSDs are not allowed to start
ja_jp: OSDを始動することは許可されていません
zh_cn: 不允许启动 OSD

source: No Down
ja_jp: ダウンなし
zh_cn: 不停用

source: OSD failure reports are being ignored, such that the monitors will not mark OSDs down
ja_jp: OSDの障害レポートは無視されているため、OSDはモニターによってダウンとしてマークされません
zh_cn: 当前不受理 OSD 故障报告，因此 monitor 不会将 OSD 标记为停用

source: No In
ja_jp: インなし
zh_cn: 不加入

source: OSDs that were previously marked out will not be marked back in when they start
ja_jp: 以前にアウトとしてマークされたOSDは、それらの始動時にインとしてマークされることはありません
zh_cn: 之前被标记为除名的 OSD 在启动后将不会被重新标记为加入集群

source: No Out
ja_jp: アウトなし
zh_cn: 不除名

source: OSDs will not automatically be marked out after the configured interval
ja_jp: OSDは、設定済みの間隔が経過した後に自動的にアウトとしてマークされません
zh_cn: 发现 OSD 在配置的间隔时间后无响应时，该 OSD 将不会自动被标记为除名。

source: The flag has been enabled for the entire cluster.
ja_jp: フラグはクラスタ全体で有効になっています。
zh_cn: 已为整个集群启用该标志。

source: Updated OSD Flags
ja_jp: OSDフラグを更新しました
zh_cn: 已更新 OSD 标志

source: Cluster-wide OSD Flags
ja_jp: クラスタ全体のOSDフラグ
pl_pl: Flagi OSD w całym klastrze
pt_br: Flags OSD de todo o Cluster
zh_cn: 集群范围的 OSD 标志

source: Pause
ja_jp: 一時停止
zh_cn: 暂停
