Repository: ceph/ceph
Catalog: src/pybind/mgr/dashboard/frontend/src/locale/messages.*.xlf
Languages: ja_jp, pl_pl, pt_br, zh_cn

source: scalar_mds specifies the plugin that is used as a building block in the layered construction. It can be one of jerasure, isa, shec.
ja_jp: scalar_mdsは、階層構造のビルディングブロックとして使用されるプラグイン を指定します。jerasure、isa、shecのいずれかになります。
zh_cn: scalar_mds 指定分层构造中用作构建块 的插件。可以是 jerasure、isa、shec 之一。

source: technique specifies the technique that will be picked within the 'scalar_mds' plugin specified. Supported techniques are 'reed_sol_van', 'reed_sol_r6_op', 'cauchy_orig', 'cauchy_good', 'liber8tion' for jerasure, 'reed_sol_van', 'cauchy' for isa and 'single', 'multiple' for shec.
ja_jp: テクニックは、指定された「scalar_mds」プラグイン内で 選択されるテクニックを指定します。サポートされているテクニックは、 jerasureの場合は「reed_sol_van」、「reed_sol_r6_op」、「cauchy_orig」、 「cauchy_good」、「liber8tion」、isaの場合は「reed_sol_van」、 「cauchy」、shecの場合は「single」、「multiple」です。
zh_cn: 算法指定将会在所指定的 "scalar_mds" 插件中 选择的算法。支持的算法有 "reed_sol_van"、"reed_sol_r6_op"、"cauchy_orig"、 "cauchy_good"、"liber8tion"（用于 jerasure）、"reed_sol_van"、 "cauchy"（用于 isa），"single"、"multiple"（用于 shec）。

source: The name of the crush bucket used for the first step of the CRUSH rule. For instance step take default.
ja_jp: CRUSHルールの最初のステップ(「デフォルトの使用」ステップなど)用に 使用されるCrushバケットの名前。
zh_cn: 规则集第一步所指向的 CRUSH 桶名称， 例如 step take default。

source: Ensure that no two chunks are in a bucket with the same failure domain. For instance, if the failure domain is host no two chunks will be stored on the same host. It is used to create a CRUSH rule step such as step chooseleaf host.
ja_jp: 同じ障害ドメインの単一バケット内に2つのチャンクが配置されることを防止します。 たとえば、障害ドメインがホストである場合は、2つのチャンクが同じホストに保管されることはありません。 これを使用して、「リーフホストの選択」ステップなどのCRUSHルールステップが作成されます。
zh_cn: 确保两个编码块不会存在于同一故障域的桶中。 例如，假设故障域是主机，就不会有两个编码块存储于同一主机上。 此值用于创建类似 step chooseleaf host 的 CRUSH 规则步骤。

source: Restrict placement to devices of a specific class (e.g., ssd or hdd), using the crush device class names in the CRUSH map.
ja_jp: CRUSHマップ内でCrushデバイスクラス名を使用して、配置先を特定クラス(ssdやhddなど)のデバイスのみに制限します。
zh_cn: 使用 CRUSH 索引中的 crush 设备类型名称， 将归置限制于特定类型的设备（例如，ssd 或 hdd）。

source: Set the directory name from which the erasure code plugin is loaded.
ja_jp: イレイジャコードプラグインの読み込み元となるディレクトリ名を設定します。
zh_cn: 设置从中加载纠删码插件的目录名称。

source: Allows all operations
ja_jp: すべての操作を許可します
zh_cn: 允许所有操作

source: Allows only operations that do not modify the server
ja_jp: サーバに変更を加えない操作のみを許可します
zh_cn: 只允许不修改服务器端数据的操作

source: Allows no access at all
ja_jp: アクセスを一切許可しません
zh_cn: 完全禁止访问

source: Please specify a filesystem volume.
ja_jp: ファイルシステムのボリュームを指定してください。
zh_cn: 请指定文件系统卷。

source: The feature is disabled because Orchestrator is not available.
ja_jp: Orchestratorが使用できないため、この機能は無効になっています。
zh_cn: 该功能已禁用，因为 Orchestrator 不可用。

source: The Orchestrator backend doesn't support this feature.
ja_jp: Orchestratorバックエンドは、この機能をサポートしていません。
zh_cn: Orchestrator 后端不支持此功能。

source: -- Select the priority --
ja_jp: -- 優先度を選択してください --
zh_cn: -- 请选择优先级 --

source: Low
ja_jp: 低
zh_cn: 低

source: High
ja_jp: 高
zh_cn: 高

source: The user list data might be stale. If needed, you can manually reload it.
ja_jp: ユーザリストのデータが古くなっている可能性があります。必要に応じて、手動で再ロードできます。
zh_cn: 用户列表数据可能已过时。如果需要，您可以手动重新加载这些数据。

source: Retrieving data for statusFor.
ja_jp: statusForのデータを取得しています。
zh_cn: 正在检索 statusFor 的数据。

source: Retrieving data.
ja_jp: データを取得しています。
zh_cn: 正在检索数据。

source: Please wait...
ja_jp: しばらくお待ちください...
zh_cn: 请稍候...

source: Displaying previously cached data for statusFor.
ja_jp: statusForの以前にキャッシュされたデータを表示しています。
zh_cn: 正在显示之前缓存的 statusFor 数据。

source: Displaying previously cached data.
ja_jp: 以前にキャッシュされたデータを表示しています。
zh_cn: 正在显示之前缓存的数据。

source: Could not load data for statusFor.
ja_jp: statusForのデータをロードできませんでした。
zh_cn: 无法加载 statusFor 的数据。

source: Could not load data.
ja_jp: データをロードできませんでした。
zh_cn: 无法加载数据。

source: Please check the cluster health.
ja_jp: クラスタヘルスを確認してください。
zh_cn: 请检查集群健康状况。

source: Error
ja_jp: エラー
zh_cn: 错误

source: Information
ja_jp: 情報
zh_cn: 信息

source: Success
ja_jp: 成功
zh_cn: 成功

source: Danger
ja_jp: 危険
zh_cn: 危险

source: Remove the custom configuration value. The default configuration will be inherited and used instead.
ja_jp: カスタム設定値を削除します。デフォルト設定値が継承されて代わりに使用されます。
zh_cn: 删除自定义配置值。将继承并改用默认配置。

source: The entered value is too high! It must not be greater than {{ option.maxValue }}.
ja_jp: 入力された値は大きすぎます。 {{ option.maxValue }}より大きい値を入力することはできません。
zh_cn: 输入的值太大！值不得大于 {{ option.maxValue }}。

source: The entered value is too low! It must not be lower than {{ option.minValue }}.
ja_jp: 入力された値は小さすぎます。 {{ option.minValue }}より小さい値を入力することはできません。
zh_cn: 输入的值太小！值不得小于 {{ option.minValue }}。

source: Copy to Clipboard
ja_jp: クリップボードにコピー
zh_cn: 复制到剪贴板

source: Are you sure that you want to {{ actionDescription | lowercase }} {{ itemNames[0] }} ?
ja_jp: 本当に {{ actionDescription | lowercase }} {{ itemNames[0] }} してもよろしいですか?
zh_cn: 您确定要 {{ actionDescription | lowercase }} {{ itemNames[0] }} 吗？

source: Are you sure that you want to {{ actionDescription | lowercase }} the selected items?
ja_jp: 選択されたアイテムを本当に {{ actionDescription | lowercase }}してもよろしいですか?
zh_cn: 您确定要 {{ actionDescription | lowercase }}所选项吗？

source: Are you sure that you want to {{ actionDescription | lowercase }} the selected {{ itemDescription }}?
ja_jp: 選択された {{ itemDescription }}を本当に {{ actionDescription | lowercase }}してもよろしいですか?
pl_pl: Jesteś pewny, że chcesz {{ actionDescription | lowercase }} wybrany {{ itemDescription }}?
zh_cn: 您确定要 {{ actionDescription | lowercase }}所选 {{ itemDescription }}吗？

source: Yes, I am sure.
ja_jp: はい。
pl_pl: Tak, jestem pewny.
pt_br: Sim, desejo.
zh_cn: 是的，我确定。

source: documentation
ja_jp: ドキュメント
zh_cn: 文档

source: Download
ja_jp: ダウンロード
zh_cn: 下载

source: This field is required.
ja_jp: このフィールドは必須です。
zh_cn: 这是必填字段！

source: An error occurred.
ja_jp: エラーが発生しました。
zh_cn: 发生错误。

source: Loading panel data...
ja_jp: パネルデータを読み込んでいます...
pl_pl: Trwa ładowanie danych...
pt_br: Carregando dados do painel...
zh_cn: 正在加载面板的相关数据...

source: Please consult the on how to configure and enable the monitoring functionality.
ja_jp: 監視機能を設定および有効化する方法に関する を参照してください。
zh_cn: 请参见 了解如何配置和启用监控功能。

source: Grafana Dashboard doesn't exist. Please refer to on how to add dashboards to Grafana.
ja_jp: Grafanaダッシュボードが存在していません。 Grafanaにダッシュボードを追加する方法に関する を参照してください。
zh_cn: Grafana 仪表盘不存在。请参见 了解如何在 Grafana 中添加仪表盘。

source: Grafana Time Picker
pl_pl: Wybór czasu Grafana
pt_br: Seletor de Horário do Grafana
zh_cn: Grafana 时间选择器

source: Reset Settings
ja_jp: 設定のリセット
pl_pl: Zresetuj ustawienia
pt_br: Redefinir Configurações
zh_cn: 重置设置

source: Last 1 hour (Default)
ja_jp: 直前の1時間(デフォルト)
zh_cn: 过去 1 小时（默认值）

source: Yesterday
ja_jp: 昨日
zh_cn: 昨天

source: Today so far
ja_jp: 本日の現時点まで
zh_cn: 今天到目前为止

source: Day before yesterday
ja_jp: 一昨日
zh_cn: 前天

source: This day last week
ja_jp: 先週の同じ曜日
zh_cn: 上周的今天

source: Previous week
ja_jp: 前週
zh_cn: 上个星期

source: This week so far
ja_jp: 今週の現時点まで
zh_cn: 本周以来

source: Previous month
ja_jp: 前月
zh_cn: 上个月

source: This month so far
ja_jp: 今月の現時点まで
zh_cn: 本月以来

source: Last 30 days
ja_jp: 過去30日間
zh_cn: 过去 30 天

source: Last 90 days
ja_jp: 過去90日間
zh_cn: 过去 90 天

source: Last 6 months
ja_jp: 過去6カ月
zh_cn: 过去 6 个月

source: Last 1 year
ja_jp: 過去1年間
zh_cn: 过去 1 年

source: Previous year
ja_jp: 前年
zh_cn: 去年

source: This year so far
ja_jp: 今年の現時点まで
zh_cn: 今年以来

source: Last 2 years
ja_jp: 過去2年間
zh_cn: 过去 2 年

source: Last 5 years
ja_jp: 過去5年間
zh_cn: 过去 5 年

source: Select a Language
ja_jp: 言語の選択
pl_pl: Wybierz język
pt_br: Selecionar Idioma
zh_cn: 请选择语言

source: Clear notifications
ja_jp: 通知のクリア
zh_cn: 清除通知

source: Remove notification
ja_jp: 通知の削除
zh_cn: 删除通知

source: Duration:
ja_jp: 期間:
zh_cn: 时长：

source: There are no notifications.
ja_jp: 通知はありません。
zh_cn: 没有通知。

source: The feature is not supported in the current Orchestrator.
ja_jp: この機能は、現在のOrchestratorではサポートされていません。
zh_cn: 当前的 Orchestrator 不支持该功能。

source: Orchestrator is not available. Please consult the on how to configure and enable the functionality.
ja_jp: Orchestratorが利用できません。機能を設定および有効化する方法については を参照してください。
zh_cn: Orchestrator 不可用。请参见 了解如何配置和启用该功能。

source: Your password will expire in less than 1 day. Click here to change it now.
ja_jp: パスワードの有効期限が 1日以内 に切れます。今すぐ変更するには ここ をクリックしてください。
zh_cn: 您的密码将在 1 天内 超期。请点击 此处 立即更改。

source: Your password will expire in {{ expirationDays }} day(s). Click here to change it now.
ja_jp: パスワードの有効期限が {{ expirationDays }} 日以内に切れます。今すぐ変更するには ここ をクリックしてください。
zh_cn: 您的密码将在 {{ expirationDays }} 天后超期。请点击 此处 立即更改。

source: Refresh
ja_jp: 再読み込み
zh_cn: 刷新

source: No items selected.
ja_jp: アイテムが選択されていません。
zh_cn: 未选择项目。

source: Deselect item to select again
ja_jp: アイテムを選択解除して再選択してください
zh_cn: 取消选择以重新选择

source: Selection limit reached
ja_jp: 選択の上限に達しました
zh_cn: 达到选择项数上限。

source: Filter tags
ja_jp: タグのフィルタリング
zh_cn: 过滤标记

source: Add badge
ja_jp: バッジの追加
zh_cn: 添加徽章

source: There are no items available.
ja_jp: 使用可能なアイテムはありません。
zh_cn: 没有可用的项目。

source: The Ceph community needs your help to continue improving: please Activate the Telemetry module.
ja_jp: Cephコミュニティは改善を続けるためにあなたの支援が必要です。 テレメトリ モジュールを 有効 にしてください。
zh_cn: Ceph 需要您的帮助以持续改进：请 激活 遥测 模块。

source: Telemetry activation reminder muted
ja_jp: テレメトリアクティベーションリマインダがミュートされました
zh_cn: 遥测激活提醒功能已禁用

source: You can activate the module on the Telemetry configuration page (<b>Dashboard Settings</b> -> <b>Telemetry configuration</b>) at any time.
ja_jp: モジュールは、テレメトリ設定ページ(［<b>ダッシュボード設定</b>］>［<b>テレメトリ設定</b>］)でいつでも有効化できます。
zh_cn: 您随时都可在 "遥测配置" 页面（<b>仪表盘设置</b> -> <b>遥测配置</b>）中激活该模块。

source: Add
ja_jp: 追加
zh_cn: 添加

source: Set
ja_jp: 設定
zh_cn: 设置

source: Submit
ja_jp: 送信
zh_cn: 提交

source: Remove
ja_jp: 削除
zh_cn: 删除

source: Unset
ja_jp: 設定解除
zh_cn: 取消设置

source: Cancel
ja_jp: キャンセル
zh_cn: 取消

source: Preview
ja_jp: プレビュー
zh_cn: 预览

source: Move
ja_jp: 移動
zh_cn: 移动

source: Next
ja_jp: 次へ
zh_cn: 下一步

source: Back
ja_jp: 戻る
zh_cn: 返回

source: Clone
ja_jp: 複製
zh_cn: 克隆

source: Copy
ja_jp: コピー
zh_cn: 复制

source: Deep Scrub
ja_jp: ディープスクラブ
zh_cn: 深层洗刷

source: Destroy
ja_jp: 破棄
zh_cn: 销毁

source: Evict
ja_jp: 削除
zh_cn: 逐出

source: Flatten
ja_jp: フラット化
zh_cn: 展开

source: Mark Down
ja_jp: ダウンとしてマーク
zh_cn: 标记为停用

source: Mark In
ja_jp: インとしてマーク
zh_cn: 标记为加入

source: Mark Lost
ja_jp: 喪失としてマーク
zh_cn: 标记为丢失

source: Mark Out
ja_jp: アウトとしてマーク
zh_cn: 标记为除名

source: Protect
ja_jp: 保護
zh_cn: 保护

source: Rename
ja_jp: 名前の変更
zh_cn: 重命名

source: Restore
ja_jp: 復元
zh_cn: 恢复

source: Reweight
ja_jp: 再重みづけ
zh_cn: 重设权重

source: Scrub
ja_jp: スクラブ
zh_cn: 洗刷

source: Show
ja_jp: 表示
zh_cn: 显示

source: Move to Trash
ja_jp: ごみ箱に移動する
zh_cn: 移至回收站

source: Unprotect
ja_jp: 保護解除
zh_cn: 解除保护

source: Change
ja_jp: 変更
zh_cn: 更改

source: Enter Maintenance
ja_jp: 保守に入る
zh_cn: 进入维护模式

source: Exit Maintenance
ja_jp: 保守を終了する
zh_cn: 退出维护模式

source: Start Drain
ja_jp: ドレインを開始
zh_cn: 开始排空

source: Stop Drain
ja_jp: ドレインを停止
zh_cn: 停止排空

source: Recreate
ja_jp: 再作成
zh_cn: 重新创建

source: Expire
ja_jp: 期限切れ
zh_cn: 过期

source: Deleted
ja_jp: 削除済み
zh_cn: 已删除

source: Added
ja_jp: 追加済み
zh_cn: 已添加

source: Removed
ja_jp: 削除済み
zh_cn: 已删除

source: Edited
ja_jp: 編集済み
zh_cn: 已编辑

source: Canceled
ja_jp: キャンセル済み
zh_cn: 已取消

source: Previewed
ja_jp: プレビュー済み
zh_cn: 已预览

source: Moved
ja_jp: 移動済み
zh_cn: 已将

source: Cloned
ja_jp: 複製済み
zh_cn: 已克隆

source: Copied
ja_jp: コピー済み
zh_cn: 已复制

source: Deep Scrubbed
ja_jp: ディープスクラブ済み
zh_cn: 已深层洗刷

source: Destroyed
ja_jp: 破棄済み
zh_cn: 已销毁

source: Flattened
ja_jp: フラット化済み
zh_cn: 已展开

source: Marked Down
ja_jp: ダウンとしてマーク済み
zh_cn: 已标记为停用

source: Marked In
ja_jp: インとしてマーク済み
zh_cn: 已标记为加入

source: Marked Lost
ja_jp: 喪失としてマーク済み
zh_cn: 已标记为丢失

source: Marked Out
ja_jp: アウトとしてマーク済み
zh_cn: 已标记为除名

source: Protected
ja_jp: 保護済み
zh_cn: 受保护

source: Purged
ja_jp: 消去済み
zh_cn: 已清除

source: Renamed
ja_jp: 名前変更済み
zh_cn: 已重命名

source: Restored
ja_jp: 復元済み
zh_cn: 已恢复

source: Reweighted
ja_jp: 再重みづけ済み
zh_cn: 已重设权重

source: Rolled back
ja_jp: ロールバック済み
zh_cn: 已回滚

source: Scrubbed
ja_jp: スクラブ済み
zh_cn: 已洗刷

source: Showed
ja_jp: 表示済み
zh_cn: 已显示

source: Moved to Trash
ja_jp: ごみ箱に移動済み
zh_cn: 已移至回收站

source: Unprotected
ja_jp: 保護解除済み
zh_cn: 已解除保护

source: Recreated
ja_jp: 再作成済み
zh_cn: 已重新创建

source: Expired
ja_jp: 失効済み
zh_cn: 已过期

source: Close
ja_jp: 閉じる
zh_cn: 关闭

source: Clear filters
ja_jp: フィルタをクリア
zh_cn: 清除过滤器

source: selected
ja_jp: 選択済み
pl_pl: Wybrane
pt_br: selecionado(s)
zh_cn: 个已选中

source: found
ja_jp: 検出済み
pl_pl: Znaleziono
pt_br: encontrado(s)
zh_cn: 个已找到

source: total
ja_jp: 合計
pl_pl: Razem
zh_cn: 总数

source: Expand/Collapse Row
ja_jp: 行の展開/折りたたみ
zh_cn: 展开/收起行

source: Failed to load data.
ja_jp: データを読み込めませんでした。
zh_cn: 无法加载数据。

source: Loading form data...
ja_jp: フォームデータを読み込んでいます...
zh_cn: 正在加载表单数据...

source: Form data could not be loaded.
ja_jp: フォームデータを読み込めませんでした。
zh_cn: 无法加载表单数据。

source: Size has to be at least value or more
ja_jp: サイズは少なくとも value以上にする必要があります
zh_cn: 大小必须大于或等于 value

source: Size has to be at most value or less
ja_jp: サイズは少なくとも value以下にする必要があります
zh_cn: 大小必须小于或等于 value

source: Yes
ja_jp: はい
zh_cn: 是

source: No
ja_jp: いいえ
zh_cn: 否

source: in %s
ja_jp: %s で
zh_cn: %s后

source: %s ago
ja_jp: %s 前
zh_cn: %s前

source: a few seconds
ja_jp: 数秒
zh_cn: 几秒

source: %d seconds
ja_jp: %d 秒
zh_cn: %d 秒

source: a minute
ja_jp: 1分
zh_cn: 一分钟

source: %d minutes
ja_jp: %d 分
zh_cn: %d 分钟

source: an hour
ja_jp: 1時間
zh_cn: 一小时

source: %d hours
ja_jp: %d 時間
zh_cn: %d 小时

source: a day
ja_jp: 1日
zh_cn: 一天

source: %d days
ja_jp: %d 日
zh_cn: %d 天

source: a week
ja_jp: 1週間
zh_cn: 一周

source: %d weeks
ja_jp: %d 週間
zh_cn: %d 周

source: a month
ja_jp: 1ヵ月
zh_cn: 一个月

source: %d months
ja_jp: %d ヵ月
zh_cn: %d 个月

source: a year
ja_jp: 1年
zh_cn: 一年

source: %d years
ja_jp: %d 年
zh_cn: %d 年

source: Required rules for passwords:
ja_jp: パスワードに必要なルール:
zh_cn: 密码必须遵循的规则：

source: Must contain at least settings.pwdPolicyMinLength characters
ja_jp: 少なくとも settings.pwdPolicyMinLength文字含まれている必要があります
zh_cn: 必须至少包含 settings.pwdPolicyMinLength 个字符

source: Must not be the same as the previous one
ja_jp: 前のものと同じであってはなりません
zh_cn: 不得与之前的密码相同

source: Cannot contain the username
ja_jp: ユーザ名を含めることはできません
zh_cn: 不能包含用户名

source: Cannot contain any configured keyword
ja_jp: 設定済みのキーワードを含めることはできません
zh_cn: 不能包含任何配置的关键字

source: Cannot contain any repetitive characters e.g. "aaa"
ja_jp: 「aaa」などの繰り返し文字を含めることはできません。
zh_cn: 不能包含任何重复字符，例如 "aaa"

source: Cannot contain any sequential characters e.g. "abc"
ja_jp: 「abc」などの連続した文字を含めることはできません。
zh_cn: 不能包含任何顺序字符，例如 "abc"

source: Must consist of characters from the following groups: * Alphabetic a-z, A-Z * Numbers 0-9 * Special chars: !"#$%& '()*+,-./:;<=>?@[\]^_`{{|}}~ * Any other characters (signs)
ja_jp: 次のグループの文字で構成されている必要があります。 * アルファベットのa-z、A-Z * 数字0〜9 * 特殊文字: !"#$%& '()*+,-./:;<=>?@[\]^_`{{|}}~ * その他の文字(記号)
zh_cn: 必须包含以下类型的字符： * 字母 a-z、A-Z * 数字 0-9 * 特殊字符：!"#$%& '()*+,-./:;<=>?@[\]^_`{{|}}~ * 任何其他字符（符号）

source: Your matcher seems to match no currently defined rule or active alert.
ja_jp: マッチャーは、現在定義されているルールまたはアクティブなアラートに一致していないようです。
zh_cn: 您的匹配器似乎与当前定义的任何规则或活动告警均不匹配。

source: no active alerts
ja_jp: アクティブなアラートなし
zh_cn: 没有活动告警

source: 1 active alert
ja_jp: 1件のアクティブなアラート
zh_cn: 1 条活动告警

source: alerts active alerts
ja_jp: alerts件のアクティブなアラート
zh_cn: alerts 条活动告警

source: Matches 1 rule
ja_jp: 1個のルールに一致
zh_cn: 匹配 1 条规则

source: Matches rules rules
ja_jp: rules個のルールに一致
zh_cn: 匹配 rules 条规则

source: rule with alert.
ja_jp: ruleと alert。
zh_cn: 具有 alert 的 rule。

source: Quality of Service
ja_jp: サービス品質
zh_cn: 服务质量

source: BPS Limit
ja_jp: BPS制限
zh_cn: BPS 上限

source: The desired limit of IO bytes per second.
ja_jp: 希望する秒あたり入出力バイト数の上限。
zh_cn: 所需的每秒 IO 字节数上限。

source: IOPS Limit
ja_jp: IOPS制限
zh_cn: IOPS 上限

source: The desired limit of IO operations per second.
ja_jp: 希望する秒あたり入出力操作数の上限。
zh_cn: 所需的每秒 IO 操作次数上限。

source: Read BPS Limit
ja_jp: 読み取りBPS制限
zh_cn: 读 BPS 上限

source: The desired limit of read bytes per second.
ja_jp: 希望する秒あたり読み取りバイト数の上限。
zh_cn: 所需的每秒内读取的字节数上限。

source: Read IOPS Limit
ja_jp: 読み取りIOPS制限
zh_cn: 读 IOPS 上限

source: The desired limit of read operations per second.
ja_jp: 希望する秒あたり読み取り操作数の上限。
zh_cn: 所需的每秒读操作次数上限。

source: Write BPS Limit
ja_jp: 書き込みBPS制限
zh_cn: 写 BPS 上限

source: The desired limit of write bytes per second.
ja_jp: 希望する秒あたり書き込みバイト数の上限。
zh_cn: 所需的每秒内写入的字节数上限。

source: Write IOPS Limit
ja_jp: 書き込みIOPS制限
zh_cn: 写 IOPS 上限

source: The desired limit of write operations per second.
ja_jp: 希望する秒あたり書き込み操作数の上限。
zh_cn: 所需的每秒写操作次数上限。

source: BPS Burst
ja_jp: BPSバースト
zh_cn: BPS 突发

source: The desired burst limit of IO bytes.
ja_jp: 希望する入出力バイト数のバースト上限。
zh_cn: 所需的 IO 字节数突发上限。

source: IOPS Burst
ja_jp: IOPSバースト
zh_cn: IOPS 突发

source: The desired burst limit of IO operations.
ja_jp: 希望する入出力操作数のバースト上限。
zh_cn: 所需的 IO 操作次数突发上限。

source: Read BPS Burst
ja_jp: 読み取りBPSバースト
zh_cn: 读 BPS 突发

source: The desired burst limit of read bytes.
ja_jp: 希望する読み取りバイト数のバースト上限。
zh_cn: 所需的读取的字节数突发上限。

source: Read IOPS Burst
ja_jp: 読み取りIOPSバースト
zh_cn: 读 IOPS 突发

source: The desired burst limit of read operations.
ja_jp: 希望する読み取り操作数のバースト上限。
zh_cn: 所需的读操作次数突发上限。

source: Write BPS Burst
ja_jp: 書き込みBPSバースト
zh_cn: 写 BPS 突发

source: The desired burst limit of write bytes.
ja_jp: 希望する書き込みバイト数のバースト上限。
zh_cn: 所需的写入的字节数突发上限。

source: Write IOPS Burst
ja_jp: 書き込みIOPSバースト
zh_cn: 写 IOPS 突发

source: The desired burst limit of write operations.
ja_jp: 希望する書き込み操作数のバースト上限。
zh_cn: 所需的写操作次数突发上限。

source: Failed to this.operation.failure this.involves(metadata)
ja_jp: this.operation.failure this.involves(metadata)に失敗しました
zh_cn: 无法 this.operation.failure this.involves(metadata)

source: Executing
ja_jp: 実行中
zh_cn: 正在执行

source: execute
ja_jp: 実行
zh_cn: 执行

source: Executed
ja_jp: 実行済み
zh_cn: 已执行

source: unknown task
ja_jp: 不明なタスク
zh_cn: 未知任务

source: Creating
ja_jp: 作成中
zh_cn: 正在创建

source: create
ja_jp: 作成
zh_cn: 创建

source: Updating
ja_jp: 更新中
zh_cn: 正在更新

source: update
ja_jp: 更新
zh_cn: 更新

source: Deleting
ja_jp: 削除中
zh_cn: 正在删除

source: Adding
ja_jp: 追加中
zh_cn: 正在添加

source: add
ja_jp: 追加
zh_cn: 添加

source: Removing
ja_jp: 削除中
zh_cn: 正在删除

source: remove
ja_jp: 削除
zh_cn: 删除

source: Importing
ja_jp: インポート中
zh_cn: 正在导入

source: import
ja_jp: インポート
zh_cn: 导入

source: Imported
ja_jp: インポート済み
zh_cn: 已导入

source: RBD snapshot ' metadata.image_spec@ metadata.snapshot_name'
ja_jp: RBDスナップショット「 metadata.image_spec@ metadata.snapshot_name」
zh_cn: RBD 快照 " metadata.image_spec@ metadata.snapshot_name"

source: mirroring site name
ja_jp: ミラーリングサイト名
zh_cn: 镜像站点名称

source: bootstrap token
ja_jp: ブートストラップトークン
zh_cn: 引导令牌

source: mirror mode for pool ' metadata.pool_name'
ja_jp: プール「 metadata.pool_name」のミラーモード
zh_cn: 存储池 " metadata.pool_name" 的镜像模式

source: mirror peer for pool ' metadata.pool_name'
ja_jp: プール「 metadata.pool_name」のミラーピア
zh_cn: 存储池 " metadata.pool_name" 的镜像对等

source: all dashboards
ja_jp: すべてのダッシュボード
zh_cn: 所有仪表盘

source: Identifying
ja_jp: 識別中
zh_cn: 正在标识

source: identify
ja_jp: 識別
zh_cn: 标识

source: Identified
ja_jp: 識別済み
zh_cn: 已标识

source: device ' metadata.device' on host ' metadata.hostname'
ja_jp: ホスト「 metadata.hostname」上のデバイス「 metadata.device」
zh_cn: 主机 " metadata.hostname" 上的设备 " metadata.device"

source: OSDs (DriveGroups: metadata.tracking_id)
ja_jp: OSD (DriveGroups: metadata.tracking_id)
zh_cn: OSD（DriveGroup： metadata.tracking_id）

source: Name is already used by this.pool(metadata).
ja_jp: この名前は this.pool(metadata)によってすでに使用されています。
zh_cn: 该名称已被 this.pool(metadata) 使用。

source: this.rbd.default(metadata) is busy.
ja_jp: this.rbd.default(metadata)はビジー状態です。
zh_cn: this.rbd.default(metadata) 正忙。

source: this.rbd.default(metadata) contains snapshots.
ja_jp: this.rbd.default(metadata)にはスナップショットが含まれています。
zh_cn: this.rbd.default(metadata) 包含快照。

source: Cloning
ja_jp: 複製中
zh_cn: 正在克隆

source: clone
ja_jp: 複製
zh_cn: 克隆

source: Snapshot of this.rbd.child(metadata) must be protected.
ja_jp: this.rbd.child(metadata)のスナップショットは保護される必要があります。
zh_cn: this.rbd.child(metadata) 的快照必须受到保护。

source: Copying
ja_jp: コピー中
zh_cn: 正在复制

source: copy
ja_jp: コピー
zh_cn: 复制

source: Flattening
ja_jp: フラット化中
zh_cn: 正在展开

source: flatten
ja_jp: フラット化
zh_cn: 展开

source: Cannot unprotect this.rbd.snapshot( metadata ) because it contains child images.
ja_jp: this.rbd.snapshot( metadata )は子イメージを含んでいるため保護解除できません。
zh_cn: 无法将 this.rbd.snapshot( metadata ) 解除保护，因为它包含子映像。

source: Cannot delete this.rbd.snapshot(metadata) because it's protected.
ja_jp: 保護されているため this.rbd.snapshot(metadata)を削除できません。
zh_cn: 无法删除 this.rbd.snapshot(metadata)，因为它受到保护。

source: Rolling back
ja_jp: ロールバック中
zh_cn: 正在回滚

source: rollback
ja_jp: ロールバック
zh_cn: 回滚

source: Moving
ja_jp: 移動中
zh_cn: 正在将

source: move
ja_jp: 移動
zh_cn: 将

source: image ' metadata.image_spec' to trash
ja_jp: イメージ「 metadata.image_spec」をごみ箱に
zh_cn: 映像 " metadata.image_spec" 移至回收站

source: Could not find image.
ja_jp: イメージが見つかりませんでした。
zh_cn: 找不到映像。

source: Restoring
ja_jp: 復元中
zh_cn: 正在将

source: restore
ja_jp: 復元
zh_cn: 将

source: image ' metadata.image_id_spec' into ' metadata.new_image_name'
ja_jp: イメージ「 metadata.image_id_spec」を「 metadata.new_image_name」に
zh_cn: 映像 " metadata.image_id_spec" 移至 " metadata.new_image_name" 中

source: Image name ' metadata.new_image_name' is already in use.
ja_jp: イメージ名「 metadata.new_image_name」はすでに使用されています。
zh_cn: 映像名称 " metadata.new_image_name" 已被使用。

source: image ' metadata.image_id_spec'
ja_jp: イメージ「 metadata.image_id_spec」
zh_cn: 映像 " metadata.image_id_spec"

source: Purging
ja_jp: 消去中
zh_cn: 正在清除

source: purge
ja_jp: 消去
zh_cn: 清除

source: all pools
ja_jp: すべてのプール
zh_cn: 所有存储池

source: images from message
ja_jp: messageからのイメージ
zh_cn: message 中的映像

source: Cannot disable mirroring because it contains a peer.
ja_jp: ピアを含んでいるためミラーリングを無効化できません。
zh_cn: 因为它包含对等，无法禁用镜像功能。

source: host ' metadata.hostname'
ja_jp: ホスト「 metadata.hostname」
zh_cn: 主机 " metadata.hostname"

source: pool ' metadata.pool_name'
ja_jp: プール「 metadata.pool_name」
zh_cn: 存储池 " metadata.pool_name"

source: erasure code profile ' metadata.name'
ja_jp: イレイジャコードプロファイル「 metadata.name」
zh_cn: 纠删码配置 " metadata.name"

source: crush rule ' metadata.name'
ja_jp: Crushルール「 metadata.name」
zh_cn: Crush 规则 " metadata.name"

source: target ' metadata.target_iqn'
ja_jp: ターゲット「 metadata.target_iqn」
zh_cn: 目标 " metadata.target_iqn"

source: Service ' metadata.service_name'
ja_jp: サービス「 metadata.service_name」
zh_cn: 服务 " metadata.service_name"

source: n/a
ja_jp: なし

source: Squash
ja_jp: スカッシュ

source: Squash
ja_jp: スカッシュ
pt_br: Executar Squash

source: Scalar mds
ja_jp: スカラmds

source: Swift
ja_jp: スウィフト
pl_pl: Szybki

source: Manager modules
pl_pl: Zarządca modułów
pt_br: Módulos do gerenciador

source: NFS
pl_pl: Sieciowy system plików NFS

source: Filesystems
pl_pl: Systemy plików
pt_br: Sistemas de arquivos

source: Retrieving data for . Please wait...
pl_pl: Trwa pobieranie danych dla . Czekaj...

source: Displaying previously cached data for .
pl_pl: Wyświetlanie wcześniej buforowanych danych dla .

source: Could not load data for . Please check the cluster health.
pl_pl: Nie można załadować danych dla . Sprawdź proszę zdrowie klastra.

source: Back
pl_pl: Wstecz
pt_br: Voltar

source: Please consult the documentation on how to configure and enable the monitoring functionality.
pl_pl: Sprawdź proszę dokumentację jak skonfigurować i uruchomić funkcje monitoringu.

source: Grafana Dashboard doesn't exist. Please refer to documentation on how to add dashboards to Grafana.
pl_pl: Pulpit Grafany nie istnieje. Sprawdź proszę dokumentację jak dodaj pulpity do Grafany.

source: Failed to load data.
pl_pl: Błąd wczytywania danych.
pt_br: Falha ao carregar dados.

source: Confirm
pl_pl: Potwierdź
pt_br: Confirmar

source: Cancel
pl_pl: Anuluj
pt_br: Cancelar

source: {isEdit, select, 1 {...} other {...}} target
pl_pl: {isEdit, select, 1 {...} other {...}} docelowy obiekt

source: {VAR_SELECT, select, 1 {Edit} other {Add} }
pl_pl: {VAR_SELECT, wybierz, 1 {Edytuj} inaczej{Dodaj} }
