Repository: ceph/ceph
Catalog: src/pybind/mgr/dashboard/frontend/src/locale/messages.*.xlf
Languages: ja_jp, pl_pl, pt_br, zh_cn

# ngb.alert.close
source: Close
ja_jp: 閉じる
zh_cn: 关闭

# ngb.carousel.previous
source: Previous
ja_jp: 前へ
zh_cn: 上一页

# ngb.carousel.next
source: Next
ja_jp: 次へ
zh_cn: 下一页

# ngb.datepicker.select-month
source: Select month
ja_jp: 月を選択
zh_cn: 选择月份

# ngb.datepicker.select-year
source: Select year
ja_jp: 年を選択
zh_cn: 选择年份

# ngb.datepicker.previous-month
source: Previous month
ja_jp: 前月
zh_cn: 上个月

# ngb.datepicker.next-month
source: Next month
ja_jp: 来月
zh_cn: 下月

# ngb.pagination.first-aria
source: First
ja_jp: 最初へ
zh_cn: 第一页

# ngb.pagination.previous-aria
source: Previous
ja_jp: 前へ
zh_cn: 上一页

# ngb.pagination.next-aria
source: Next
ja_jp: 次へ
zh_cn: 下一页

# ngb.pagination.last-aria
source: Last
ja_jp: 最後へ
zh_cn: 最后一页

# ngb.timepicker.hours
source: Hours
ja_jp: 時間
zh_cn: 小时

# ngb.timepicker.minutes
source: Minutes
ja_jp: 分
zh_cn: 分钟

# ngb.timepicker.increment-hours
source: Increment hours
ja_jp: 時間を増やす
zh_cn: 递增小时数

# ngb.timepicker.decrement-hours
source: Decrement hours
ja_jp: 時間を減らす
zh_cn: 递减小时数

# ngb.timepicker.increment-minutes
source: Increment minutes
ja_jp: 分を増やす
zh_cn: 递增分钟数

# ngb.timepicker.decrement-minutes
source: Decrement minutes
ja_jp: 分を減らす
zh_cn: 递减分钟数

# ngb.timepicker.seconds
source: Seconds
ja_jp: 秒
zh_cn: 秒

# ngb.timepicker.increment-seconds
source: Increment seconds
ja_jp: 秒を増やす
zh_cn: 递增秒数

# ngb.timepicker.decrement-seconds
source: Decrement seconds
ja_jp: 秒を減らす
zh_cn: 递减秒数

# ngb.toast.close-aria
source: Close
ja_jp: 閉じる
zh_cn: 关闭

source: Must be greater than or equal to {{ limits['min'] }}.
ja_jp: {{ limits['min'] }}以上である必要があります。
zh_cn: 必须大于或等于 {{ limits['min'] }}。

source: Must be less than or equal to {{ limits['max'] }}.
ja_jp: {{ limits['max'] }}以下である必要があります。
zh_cn: 必须小于或等于 {{ limits['max'] }}。

source: Overview
ja_jp: 概要
pl_pl: Przegląd
pt_br: Visão geral
zh_cn: 概览

source: Targets
ja_jp: ターゲット
pl_pl: Obiekty docelowe
pt_br: Destinos
zh_cn: 目标

source: iSCSI Topology
ja_jp: iSCSIトポロジ
pl_pl: Topologia iSCSI
pt_br: Topologia iSCSI
zh_cn: iSCSI 结构图

source: Name
ja_jp: 名前
zh_cn: 名称

source: Current
ja_jp: 現在
zh_cn: 当前

source: Default
ja_jp: デフォルト
zh_cn: 默认值

source: Discovery Authentication
ja_jp: 検出認証
pl_pl: Uwierzytelnianie wykrywania
pt_br: Autenticação de Descoberta
zh_cn: 发现身份验证

source: User
ja_jp: ユーザ
pl_pl: Użytkownik
pt_br: Usuário
zh_cn: 用户

source: This field is required.
ja_jp: このフィールドは必須です。
pl_pl: Pole jest wymagane.
pt_br: Este campo é obrigatório.
zh_cn: 这是必填字段！

source: User names must have a length of 8 to 64 characters and can contain alphanumeric characters, '.', '@', '-', '_' or ':'.
ja_jp: ユーザ名の長さは8〜64文字で、英数字、「.」、「@」、「-」、「_」、または「:」を含めることができます。
zh_cn: 用户名长度必须为 8 至 64 个字符，可以包含字母数字字符、"."、"@"、"-"、"_" 或 ":"。

source: Password
ja_jp: パスワード
pl_pl: Hasło
pt_br: Senha
zh_cn: 密码

source: Passwords must have a length of 12 to 16 characters and can contain alphanumeric characters, '@', '-', '_' or '/'.
ja_jp: パスワードの長さは12〜16文字で、英数字、「@」、「-」、「_」、または「/」を含めることができます。
zh_cn: 密码长度必须为 12 至 16 个字符，可以包含字母数字字符、"@"、"-"、"_" 或 "/"。

source: Mutual User
ja_jp: 相互ユーザ
pl_pl: Wspólny użytkownik
pt_br: Usuário Mútuo
zh_cn: 互认证用户

source: Mutual Password
ja_jp: 相互パスワード
pl_pl: Wspólne hasło
pt_br: Senha Mútua
zh_cn: 互认证密码

source: Updated discovery authentication
ja_jp: 検出認証を更新しました
zh_cn: 已更新发现身份验证

source: Target IQN
ja_jp: ターゲットIQN
pl_pl: Nazwa IQN obiektu docelowego iSCSI
pt_br: IQN de Destino
zh_cn: 目标 IQN

source: IQN has wrong pattern.
ja_jp: IQNのパターンが正しくありません。
pl_pl: Błędna składnia nazwy IQN.
pt_br: IQN tem padrão incorreto.
zh_cn: IQN 格式错误。

source: An IQN has the following notation 'iqn.$year-$month.$reversedAddress:$definedName'
ja_jp: IQNは「iqn.$year-$month.$reversedAddress:$definedName」という形式で表記されます。
zh_cn: IQN 应由以下格式构成：“iqn.$year-$month.$reversedAddress:$definedName”

source: For example: iqn.2016-06.org.dashboard:storage:disk.sn-a8675309
ja_jp: 例: iqn.2016-06.org.dashboard:storage:disk.sn-a8675309
pl_pl: Na przykład: iqn.2016-06.org.dashboard:storage:disk.sn-a8675309
pt_br: Por exemplo: iqn.2016-06.org.dashboard:storage:disk.sn-a8675309
zh_cn: 例如：iqn.2016-06.org.dashboard:storage:disk.sn-a8675309

source: More information
ja_jp: 詳細情報
pl_pl: Więcej informacji
pt_br: Mais informações
zh_cn: 更多信息

source: This target has modified advanced settings.
ja_jp: このターゲットの詳細設定は変更されています。
pl_pl: Ten obiekt docelowy zmodyfikował zaawansowane ustawienia.
pt_br: Este destino tem configurações avançadas modificadas.
zh_cn: 此目标的高级设置修改过。

source: Portals
ja_jp: ポータル
pl_pl: Portale
pt_br: Portais
zh_cn: 端口

source: Add portal
ja_jp: ポータルの追加
pl_pl: Dodaj portal
pt_br: Adicionar portal
zh_cn: 添加端口

source: At least {{ minimum_gateways }} gateways are required.
ja_jp: 少なくとも {{ minimum_gateways }}台のゲートウェイが必要です。
pl_pl: Wymagane są przynajmniej {{ minimum_gateways }} bramy.
zh_cn: 至少需要 {{ minimum_gateways }} 个网关。

source: Images
ja_jp: イメージ
pl_pl: Obrazy
pt_br: Imagens
zh_cn: 映像

source: Backstore: {{ imagesSettings[image].backstore | iscsiBackstore }}.
ja_jp: バックストア: {{ imagesSettings[image].backstore | iscsiBackstore }}。
zh_cn: 后备存储： {{ imagesSettings[image].backstore | iscsiBackstore }}。

source: This image has modified settings.
ja_jp: このイメージの設定は変更されています。
pl_pl: Ten obraz zmodyfikował ustawienia.
pt_br: Esta imagem tem configurações modificadas.
zh_cn: 此映像的设置修改过。

source: Duplicated LUN numbers.
ja_jp: 重複したLUN番号。
zh_cn: 重复的 LUN 编号。

source: Duplicated WWN.
ja_jp: 重複したWWN。
zh_cn: 重复的 WWN。

source: Add image
ja_jp: イメージの追加
pl_pl: Dodaj obraz.
pt_br: Adicionar imagem
zh_cn: 添加映像

source: ACL authentication
ja_jp: ACL認証
pl_pl: Uwierzytelnianie ACL
pt_br: Autenticação ACL
zh_cn: ACL 身份验证

source: User names must have a length of 8 to 64 characters and can contain alphanumeric characters, '.', '@', '-', '_' or ':'.
ja_jp: ユーザ名の長さは8〜64文字で、英数字、「.」、「@」、「-」、「_」、または「:」を含めることができます。
zh_cn: 用户名长度必须为 8 至 64 个字符，可以包含字母数字字符、"."、"@"、"-"、"_" 或 ":"。

source: Passwords must have a length of 12 to 16 characters and can contain alphanumeric characters, '@', '-', '_' or '/'.
ja_jp: パスワードの長さは12〜16文字で、英数字、「@」、「-」、「_」、または「/」を含めることができます。
zh_cn: 密码长度必须为 12 至 16 个字符，可以包含字母数字字符、"@"、"-"、"_" 或 "/"。

source: Initiators
ja_jp: イニシエータ
pl_pl: Inicjatory iSCSI
pt_br: Iniciadores
zh_cn: 授权人

source: Initiator
ja_jp: イニシエータ
pl_pl: Inicjator iSCSI
pt_br: Iniciador
zh_cn: 授权人

source: Client IQN
ja_jp: クライアントIQN
pl_pl: Klient IQN
pt_br: IQN do Cliente
zh_cn: 客户端 IQN

source: Initiator IQN needs to be unique.
ja_jp: イニシエータIQNは一意である必要があります。
pl_pl: Inicjator IQN powinien być unikalny.
pt_br: O IQN do Iniciador precisa ser exclusivo.
zh_cn: 授权人 IQN 必须唯一。

source: User names must have a length of 8 to 64 characters and can contain alphanumeric characters, '.', '@', '-', '_' or ':'.
ja_jp: ユーザ名の長さは8〜64文字で、英数字、「.」、「@」、「-」、「_」、または「:」を含めることができます。
zh_cn: 用户名长度必须为 8 至 64 个字符，可以包含字母数字字符、"."、"@"、"-"、"_" 或 ":"。

source: Passwords must have a length of 12 to 16 characters and can contain alphanumeric characters, '@', '-', '_' or '/'.
ja_jp: パスワードの長さは12〜16文字で、英数字、「@」、「-」、「_」、または「/」を含めることができます。
zh_cn: 密码长度必须为 12 至 16 个字符，可以包含字母数字字符、"@"、"-"、"_" 或 "/"。

source: Initiator belongs to a group. Images will be configure in the group.
ja_jp: イニシエータはいずれかのグループに属します。イメージはそのグループ内で設定されます。
pl_pl: Inicjator iSCSI należą do grupy. Obrazy będą skonfigurowane w grupie.
pt_br: O iniciador pertence a um grupo. As imagens serão configuradas no grupo.
zh_cn: 授权人属于某个组。将在组中配置映像。

source: No items added.
ja_jp: アイテムが追加されていません。
pl_pl: Brak dodanych pozycji.
pt_br: Nenhum item adicionado.
zh_cn: 未添加项目。

source: Add initiator
ja_jp: イニシエータの追加
pl_pl: Dodaj inicjator iSCSI
pt_br: Adicionar iniciador
zh_cn: 添加授权人

source: Groups
ja_jp: グループ
pl_pl: Grupy
pt_br: Grupos
zh_cn: 组

source: Group
ja_jp: グループ
pl_pl: Grupa
pt_br: Grupo
zh_cn: 组

source: Name
ja_jp: 名前
pl_pl: Nazwa
pt_br: Nome
zh_cn: 名称

source: Add group
ja_jp: グループの追加
pl_pl: Dodaj grupę
pt_br: Adicionar grupo
zh_cn: 添加组

source: There are no portals available.
ja_jp: 使用可能なポータルはありません。
zh_cn: 没有可用的端口。

source: There are no images available.
ja_jp: 使用可能なイメージはありません。
zh_cn: 没有可用的映像。

source: There are no images available. Please make sure you add an image to the target.
ja_jp: 使用可能なイメージはありません。ターゲットにイメージを追加したことを確認してください。
zh_cn: 没有可用的映像。请确保为目标添加一个映像。

source: There are no initiators available. Please make sure you add an initiator to the target.
ja_jp: 使用可能なイニシエータはありません。ターゲットにイニシエータを追加したことを確認してください。
zh_cn: 没有可用的授权人。请确保为目标添加一个授权人。

source: target
ja_jp: ターゲット
zh_cn: 目标

source: Configure
ja_jp: 設定
zh_cn: 配置

source: Changing these parameters from their default values is usually not necessary.
ja_jp: 通常はこれらのパラメータをデフォルト値から変更する必要はありません。
pl_pl: Zmiana tych parametrów z domyślnych wartości przeważnie nie jest potrzebna.
pt_br: Não costuma ser necessário mudar o valor padrão destes parâmetros.
zh_cn: 通常无须更改这些默认参数值。

source: Identifier
ja_jp: 識別子
zh_cn: 标识符

source: Settings
ja_jp: 設定
pl_pl: Ustawienia
pt_br: Configurações
zh_cn: 设置

source: Backstore
ja_jp: バックストア
pl_pl: Tylny koniec przechowywania
zh_cn: 后备存储

source: Advanced Settings
ja_jp: 詳細設定
pl_pl: Ustawienia zaawansowane
pt_br: Configurações Avançadas
zh_cn: 高级设置

source: iSCSI Targets not available
ja_jp: 使用可能なiSCSIターゲットがありません
pl_pl: obiekty docelowe iSCSI niedostępne
pt_br: Destinos iSCSI não disponíveis
zh_cn: 没有可用的 iSCSI 目标

source: Please consult the on how to configure and enable the iSCSI Targets management functionality.
ja_jp: iSCSIターゲットの管理機能を設定および有効化する方法については、 を参照してください。
zh_cn: 请参见 了解如何配置和启用 iSCSI 目标管理功能。

source: Available information:
ja_jp: 取得可能な情報:
pl_pl: Dostępne informacje:
pt_br: Informações disponíveis:
zh_cn: 可用信息：

source: Discovery authentication
ja_jp: 検出認証
zh_cn: 发现身份验证

source: Target
ja_jp: ターゲット
zh_cn: 目标

source: Portals
ja_jp: ポータル
zh_cn: 端口

source: Images
ja_jp: イメージ
zh_cn: 映像

source: # Sessions
ja_jp: セッション数
zh_cn: 会话数量

source: Unavailable gateway(s)
ja_jp: 使用できないゲートウェイ
zh_cn: 不可用的网关

source: Target has active sessions
ja_jp: ターゲットにはアクティブなセッションがあります
zh_cn: 目标具有活跃会话

source: iSCSI target
ja_jp: iSCSIターゲット
zh_cn: iSCSI 目标

source: Gateways
ja_jp: ゲートウェイ
zh_cn: 网关

source: State
ja_jp: 状態
zh_cn: 状态

source: # Targets
ja_jp: ターゲット数
zh_cn: 目标数量

source: Pool
ja_jp: プール
zh_cn: 存储池

source: Image
ja_jp: イメージ
zh_cn: 映像

source: Backstore
ja_jp: バックストア
zh_cn: 后备存储

source: Read Bytes
ja_jp: 読み取りバイト数
zh_cn: 读字节数

source: Write Bytes
ja_jp: 書き込みバイト数
zh_cn: 写字节数

source: Read Ops
ja_jp: 読み取り操作数
zh_cn: 读操作数

source: Write Ops
ja_jp: 書き込み操作数
zh_cn: 写操作数

source: A/O Since
ja_jp: 次の日付以降のA/O
zh_cn: 活动/优化开始时间

source: Create Bootstrap Token
ja_jp: ブートストラップトークンの作成
zh_cn: 创建引导令牌

source: To create a bootstrap token which can be imported by a peer site cluster, provide the local site's name, select which pools will have mirroring enabled, and click Generate .
ja_jp: ピアサイトクラスタでインポートできるブートストラップトークンを作成するには、ローカルサイトの名前を入力し、ミラーリングを有効にするプールを選択して、 ［生成］ をクリックします。
zh_cn: 要创建可由对等站点集群导入的引导令牌，请提供本地站点的名称，选择将为其启用镜像的存储池， 然后点击 生成 。

source: Site Name
ja_jp: サイト名
zh_cn: 站点名称

source: Name...
ja_jp: 名前...
pl_pl: Nazwa...
pt_br: Nome...
zh_cn: 名称...

source: Pools
ja_jp: プール
pl_pl: Pule
zh_cn: 存储池

source: At least one pool is required.
ja_jp: 少なくとも1つのプールが必要です。
zh_cn: 至少需指定一个存储池。

source: Generate
ja_jp: 生成
zh_cn: 生成

source: Token
ja_jp: トークン
zh_cn: 令牌

source: Generated token...
ja_jp: 生成されたトークン...
zh_cn: 生成的令牌...

source: Close
ja_jp: 閉じる
pl_pl: Zamknij
pt_br: Fechar
zh_cn: 关闭

source: Import Bootstrap Token
ja_jp: ブートストラップトークンのインポート
zh_cn: 导入引导令牌

source: To import a bootstrap token which was created by a peer site cluster, provide the local site's name, select which pools will have mirroring enabled, provide the generated token, and click Import .
ja_jp: ピアサイトクラスタで作成されたブートストラップトークンをインポートするには、ローカルサイトの名前を入力し、ミラーリングを有効にするプールを選択して、 ［インポート］ をクリックします。
zh_cn: 要导入由对等站点集群创建的引导令牌，请提供本地站点的名称，选择将为其启用镜像的存储池，提供生成的令牌， 然后点击 导入 。

source: Direction
ja_jp: 方向
zh_cn: 方向

source: The token is invalid.
ja_jp: トークンは無効です。
zh_cn: 令牌无效。

source: Instance
ja_jp: インスタンス
zh_cn: 实例

source: Hostname
ja_jp: ホスト名
zh_cn: 主机名

source: Version
ja_jp: バージョン
zh_cn: 版本

source: Health
ja_jp: ヘルス
zh_cn: 健康状况

source: Issue
ja_jp: 問題
zh_cn: 问题

source: Progress
ja_jp: 進捗
zh_cn: 进度

source: Description
ja_jp: 説明
zh_cn: 描述

source: Daemons
ja_jp: デーモン
pl_pl: Demony
zh_cn: 守护进程

source: Create Bootstrap Token
ja_jp: ブートストラップトークンの作成
zh_cn: 创建引导令牌

source: Import Bootstrap Token
ja_jp: ブートストラップトークンのインポート
zh_cn: 导入引导令牌

source: Edit pool mirror mode
ja_jp: プールのミラーモードの編集
pl_pl: Tryb edycji lustrzanego pula
pt_br: Editar modo de espelho do pool
zh_cn: 编辑存储池镜像模式

source: To edit the mirror mode for pool {{ poolName }} , select a new mode from the list and click Update .
ja_jp: プール {{ poolName }} のミラーモードを編集するには、リストから新しいモードを選択して、 ［更新］ をクリックします。
zh_cn: 要编辑存储池 {{ poolName }} 的镜像模式，请从列表中选择新模式，然后点击 更新 。

source: Mode
ja_jp: モード
pl_pl: Tryb
pt_br: Modo
zh_cn: 模式

source: Peer clusters must be removed prior to disabling mirror.
ja_jp: ミラーを無効にする前に、ピアクラスタを削除する必要があります。
pl_pl: Sparowany klaster musi być usunięty przed wyłączeniem lustra.
pt_br: Clusters de peer devem ser removidos antes de desabilitar o espelho.
zh_cn: 在禁用镜像功能前必须先移除同伴集群。

source: Disabled
ja_jp: 無効化済み
zh_cn: 已禁用

source: {VAR_SELECT, select, edit {Edit} other {Add}}
zh_cn: {VAR_SELECT, select, edit {编辑} other {添加}}

source: {mode, select, edit {Edit} other {Add}} pool mirror peer
ja_jp: {mode, select, edit {Edit} other {Add}}プールミラーピア
zh_cn: {mode, select, edit {Edit} other {Add}}存储池镜像对等

source: {mode, select, edit {Edit} other {Add}} the pool mirror peer attributes for pool {{ poolName }} and click Submit .
ja_jp: {mode, select, edit {Edit} other {Add}}プール {{ poolName }} のプールミラーピア属性、および ［送信］ をクリックします。
zh_cn: {mode, select, edit {Edit} other {Add}}存储池 {{ poolName }} 的存储池镜像对等属性，并点击 提交 。

source: Cluster Name
ja_jp: クラスタ名
pl_pl: Nazwa Klastra
pt_br: Nome do Cluster
zh_cn: 集群名称

source: The cluster name is not valid.
ja_jp: このクラスタ名は無効です。
pl_pl: Nazwa klastra jest niepoprawna
pt_br: O nome do cluster não é válido.
zh_cn: 该集群名称无效。

source: The CephX ID is not valid.
ja_jp: このCephX IDは無効です。
pl_pl: ID CephX nie jest poprawne.
pt_br: O ID do CephX não é válido.
zh_cn: 该 CephX ID 无效。

source: Monitor Addresses
ja_jp: モニターアドレス
pl_pl: Adres monitora
pt_br: Endereços do Monitor
zh_cn: Monitor 地址

source: Comma-delimited addresses...
ja_jp: カンマ区切りアドレス...
pl_pl: Adresy rozdzielane przecinkami...
pt_br: Endereços delimitados por vírgula...
zh_cn: 逗号分隔的地址...

source: The monitory address is not valid.
ja_jp: この警告アドレスは無効です。
pl_pl: Adres monitora nie jest poprawny.
pt_br: O endereço de monitoria não é válido.
zh_cn: 该 Monitor 地址无效。

source: CephX Key
ja_jp: CephXキー
pl_pl: Klucz CephX
pt_br: Chave do CephX
zh_cn: CephX 密钥

source: Base64-encoded key...
ja_jp: Base64エンコード化済みキー...
pl_pl: Klucz zakodowany w Base64...
pt_br: Chave codificada com base64...
zh_cn: Base64 编码的密钥...

source: CephX key must be base64 encoded.
ja_jp: CephXキーはbase64でエンコードされている必要があります。
pl_pl: Klucz CephX musi być zakodowany w Base64/
pt_br: A chave do CephX deve ser codificada com base64.
zh_cn: CephX 密钥必须为 base64 编码。

source: # Local
ja_jp: #ローカル
pl_pl: # Lokalny
pt_br: Nº Local
zh_cn: 本地数量

source: # Remote
ja_jp: #リモート
pl_pl: # Zdalny
pt_br: Nº Remoto
zh_cn: 远程数量

source: Edit Mode
ja_jp: モードの編集
zh_cn: 编辑模式

source: Add Peer
ja_jp: ピアの追加
zh_cn: 添加对等

source: Edit Peer
ja_jp: ピアの編集
zh_cn: 编辑对等

source: Delete Peer
ja_jp: ピアの削除
zh_cn: 删除对等

source: Mode
ja_jp: モード
zh_cn: 模式

source: Leader
ja_jp: リーダー
zh_cn: 主管

source: # Local
ja_jp: #ローカル
zh_cn: 本地数量

source: # Remote
ja_jp: #リモート
zh_cn: 远程数量

source: mirror peer
ja_jp: ミラーピア
zh_cn: 镜像对等

source: RBD Configuration
ja_jp: RBD設定
pl_pl: Konfiguracja RBD
pt_br: Configuração de RBD
zh_cn: RBD 配置

source: Remove the local configuration value. The parent configuration value will be inherited and used instead.
ja_jp: ローカル設定値を削除します。親設定値が継承されて代わりに使用されます。
pl_pl: Usuń wartość konfiguracji lokalnej. Wartość konfiguracji rodzica będzie odziedziczona i zostanie użyta zamiast tej.
pt_br: Remova o valor de configuração local. No lugar dele, o valor de configuração pai será herdado e usado.
zh_cn: 删除本地的配置值。将继承并改用父配置值。

source: The minimum value is 0
ja_jp: 最小値は0です
zh_cn: 最小值为 0

source: Global
ja_jp: グローバル
pl_pl: Globalne
zh_cn: 全局

source: Image
ja_jp: イメージ
pl_pl: Obraz
pt_br: Imagem
zh_cn: 映像

source: Pool
ja_jp: プール
pl_pl: Pul
zh_cn: 存储池

source: Key
ja_jp: キー
zh_cn: 密钥

source: Source
ja_jp: ソース
zh_cn: 来源

source: Value
ja_jp: 値
zh_cn: 值

source: Only available for RBD images with fast-diff enabled
ja_jp: 高速差分 が有効になっているRBDイメージのみに使用できます
pl_pl: Dostępne tylko dla obrazów RBD z szybką różnicą włączone
zh_cn: 仅可用于启用了 fast-diff 的 RBD 映像

source: Details
ja_jp: 詳細
pl_pl: Szczegóły
pt_br: Detalhes
zh_cn: 详细信息

source: Data Pool
ja_jp: データプール
pl_pl: Dane pula
pt_br: Pool de Dados
zh_cn: 数据池

source: Created
ja_jp: 作成済み
pl_pl: Utworzony
pt_br: Criado
zh_cn: 已创建

source: Size
ja_jp: サイズ
pl_pl: Rozmiar
pt_br: Tamanho
zh_cn: 容量

source: Objects
ja_jp: オブジェクト数
pl_pl: Obiekty
pt_br: Objetos
zh_cn: 对象数

source: Object size
ja_jp: オブジェクトサイズ
pl_pl: Rozmiar obiektu
pt_br: Tamanho do objeto
zh_cn: 对象大小

source: Features
ja_jp: 機能
pl_pl: Funkcje
pt_br: Recursos
zh_cn: 特性

source: Provisioned
ja_jp: プロビジョニング済み
pl_pl: Zaopatrzony
pt_br: Aprovisionado
zh_cn: 已供给容量

source: N/A
ja_jp: なし
pl_pl: Niedostępny
zh_cn: 不适用

source: Total provisioned
ja_jp: プロビジョニング済み合計
pl_pl: Całkowite rezerwy
pt_br: Total aprovisionado
zh_cn: 总供给容量

source: Striping unit
ja_jp: ストライピング単位
pl_pl: Jednostka maskowana
pt_br: Unidade de distribuição
zh_cn: 条带单元大小

source: Striping count
ja_jp: ストライピング数
pl_pl: Licznik maskowania
pt_br: Total de distribuições
zh_cn: 条带个数

source: Parent
ja_jp: 親
pl_pl: Rodzic
pt_br: Pai
zh_cn: 父项

source: Block name prefix
ja_jp: ブロック名のプレフィックス
pl_pl: Prefiks nazwy bloku
pt_br: Prefixo do nome do bloco
zh_cn: 块设备名称前缀

source: Order
ja_jp: 順番
pl_pl: Zamówienie
pt_br: Ordem
zh_cn: 顺序

source: Format Version
ja_jp: フォーマットバージョン
zh_cn: 格式版本

source: Snapshots
ja_jp: スナップショット
pl_pl: Migawki
pt_br: Instantâneos
zh_cn: 快照

source: Configuration
ja_jp: 設定
pl_pl: Konfiguracja
pt_br: Configuração
zh_cn: 配置

source: Performance
ja_jp: パフォーマンス
pl_pl: Wydajność
pt_br: Desempenho
zh_cn: 性能

source: Information can not be displayed for RBD in status 'Removing'.
ja_jp: ステータス「削除中」のRBDの情報は表示できません。
zh_cn: 无法显示处于 "正在删除" 状态的 RBD 的信息。

source: This setting overrides the global value
ja_jp: この設定はグローバル値よりも優先されます
pl_pl: To ustawienie zastępuję wartość globalną.
pt_br: Esta configuração substitui o valor global
zh_cn: 此设置会覆盖全局值

source: This is the global value. No value for this option has been set for this image.
ja_jp: これはグローバル値です。このイメージについて、このオプションの値は設定されていません。
pl_pl: To jest globalna wartość. Dla tego obrazu nie ustawiono żadnej wartości dla tej opcji.
pt_br: Este é o valor global. Nenhum valor para esta opção foi definido para esta imagem.
zh_cn: 该值为全局值。没有为此映像设置此选项的值。

source: {{ action | titlecase }} from
ja_jp: 以下からの {{ action | titlecase }}
zh_cn: {{ action | titlecase }} 从

source: '/' and '@' are not allowed.
ja_jp: 「/」と「@」は使用できません。
pl_pl: '/' and '@' nie są dozwolone.
pt_br: '/' e '@' não são permitidos.
zh_cn: 不允许使用 "/" 和 "@"。

source: Loading...
ja_jp: 読み込んでいます...
pl_pl: Ładowanie...
pt_br: Carregando...
zh_cn: 正在加载...

source: -- No rbd pools available --
ja_jp: -- 使用可能なrbdプールがありません --
pl_pl: -- Brak dostępnych rbd puli --
pt_br: -- Não há pools de RBD disponíveis --
zh_cn: -- 没有可用的 RBD 存储池 --

source: -- Select a pool --
ja_jp: -- プールを選択してください --
pl_pl: -- Wybierz pul --
pt_br: -- Selecionar pool --
zh_cn: -- 请选择存储池 --

source: -- No namespaces available --
ja_jp: -- 使用可能なネームスペースがありません --
zh_cn: -- 没有可用的名称空间 --

source: -- Select a namespace --
ja_jp: -- ネームスペースを選択してください --
zh_cn: -- 请选择名称空间 --

source: Use a dedicated data pool
ja_jp: 専用のデータプールを使用してください
pl_pl: Użyj dedykowanych danych pul
pt_br: Usar pool de dados dedicado
zh_cn: 使用专用的数据池

source: You need more than one pool with the rbd application label use to use a dedicated data pool.
ja_jp: 専用のデータプールを使用するには、rbdアプリケーションラベルを使用する複数のプールが必要です。
zh_cn: 要使用专用的数据池，您需要多个使用了 RBD 应用标签的存储池。

source: Data pool
ja_jp: データプール
pl_pl: Dane pul
pt_br: Pool de dados
zh_cn: 数据池

source: Dedicated pool that stores the object-data of the RBD.
ja_jp: RBDのオブジェクトデータを保管するための専用プール
pl_pl: Dedykowany pul, który przechowuje dane obiektowe z RBD
pt_br: Pool dedicado que armazena os dados de objetos do RBD.
zh_cn: 专用于存储 RBD 的对象数据的存储池。

source: -- No data pools available --
ja_jp: -- 使用可能なデータプールがありません --
pl_pl: -- Brak danych puli --
pt_br: -- Não há pools de dados disponíveis --
zh_cn: -- 没有可用的数据池 --

source: e.g., 10GiB
ja_jp: 例: 10GiB
pl_pl: np. 10 GiB
pt_br: ex. 10 GiB
zh_cn: 例如 10GiB

source: You have to increase the size.
ja_jp: サイズを大きくする必要があります。
pl_pl: Musisz zwiększyć rozmiar.
pt_br: Você precisa aumentar o tamanho.
zh_cn: 您必须提高容量。

source: Advanced...
ja_jp: 詳細...
pl_pl: Zaawansowane...
pt_br: Avançado...
zh_cn: 高级...

source: Advanced
ja_jp: 詳細
pl_pl: Zaawansowane
pt_br: Avançado
zh_cn: 高级

source: Striping
ja_jp: ストライピング
pl_pl: Maskowanie
pt_br: Distribuição
zh_cn: 条带

source: -- Select stripe unit --
ja_jp: -- ストライプ単位を選択してください --
pl_pl: -- Wybierz jednostkę pasków --
pt_br: -- Selecionar unidade de distribuição --
zh_cn: -- 请选择条带单元大小 --

source: This field is required because stripe count is defined!
ja_jp: ストライプ数が定義されているため、このフィールドは必須です。
pl_pl: Pole jest wymagane, ponieważ licznik pasków jest zdefiniowany.
pt_br: Este campo é obrigatório porque o total de distribuições foi definido!
zh_cn: 因为设置了条带个数，所以这是必填字段！

source: Stripe unit is greater than object size.
ja_jp: ストライプ単位がオブジェクトサイズより大きいです。
pl_pl: Jednostka pasków jest większa niż rozmiar obiektu.
pt_br: A unidade de distribuição é maior do que o tamanho do objeto.
zh_cn: 条带单元大小超过了对象大小。

source: This field is required because stripe unit is defined!
ja_jp: ストライプ単位が定義されているため、このフィールドは必須です。
pl_pl: Pole jest wymagane, ponieważ jednostka pasków jest zdefiniowana!
pt_br: Este campo é obrigatório porque a unidade de distribuição foi definida!
zh_cn: 因为设置了条带单元大小，所以这是必填字段！

source: Stripe count must be greater than 0.
ja_jp: ストライプ数は0より大きい必要があります。
pl_pl: Licznik pasków musi być większy od 0.
pt_br: O total de distribuições deve ser maior do que 0.
zh_cn: 条带个数必须大于 0。

source: Deep flatten
ja_jp: ディープフラット化
zh_cn: 完全展开

source: Layering
ja_jp: 階層化
zh_cn: 分层

source: Exclusive lock
ja_jp: 排他ロック
zh_cn: 互斥锁

source: Object map (requires exclusive-lock)
ja_jp: オブジェクトマップ(排他ロックが必要)
zh_cn: object map（需要互斥锁支持）

source: Fast diff (interlocked with object-map)
ja_jp: 高速差分(オブジェクトマップと連動)
zh_cn: Fast diff（与 object-map 互锁）

source: Deleting this image will also delete all its snapshots.
ja_jp: このイメージを削除すると、そのすべてのスナップショットも削除されます。
zh_cn: 删除此映像时也会删除它的所有快照。

source: The following snapshots are currently protected and will be removed:
ja_jp: 次のスナップショットは現在保護されており、削除されます。
zh_cn: 以下快照当前受到保护，将会被删除：

source: RBD in status 'Removing'
ja_jp: ステータス「削除中」のRBD
zh_cn: RBD 处于 "正在删除" 状态

source: Namespace
ja_jp: ネームスペース
zh_cn: 名称空间

source: Size
ja_jp: サイズ
zh_cn: 容量

source: Usage
ja_jp: 使用量
zh_cn: 使用率

source: Objects
ja_jp: オブジェクト数
zh_cn: 对象数

source: Object size
ja_jp: オブジェクトサイズ
zh_cn: 对象大小

source: Parent
ja_jp: 親
zh_cn: 父项

source: Mirroring
ja_jp: ミラーリング
zh_cn: 镜像

source: Warning
ja_jp: 警告
zh_cn: 警报

source: This RBD has cloned snapshots. Please delete related RBDs before deleting this RBD.
ja_jp: このRBDはスナップショットのクローンを作成しました。このRBDを削除する前に関連するRBDを削除してください。
zh_cn: 此 RBD 具有克隆的快照。请先删除相关 RBD，再删除此 RBD。

source: This RBD image has an invalid name and can't be managed by ceph.
ja_jp: このRBDイメージの名前は無効であり、cephで管理できません。
zh_cn: 此 RBD 映像的名称无效，无法通过 Ceph 进行管理。

source: Action not possible for an RBD in status 'Removing'
ja_jp: ステータスが「削除中」のRBDではアクションを実行できません
zh_cn: 无法对处于 "正在删除" 状态的 RBD 执行操作

source: Create Namespace
ja_jp: ネームスペースの作成
zh_cn: 创建名称空间

source: Namespace already exists.
ja_jp: ネームスペースはすでに存在します。
zh_cn: 名称空间已存在。
