Repository: ceph/ceph
Catalog: src/pybind/mgr/dashboard/frontend/src/locale/messages.*.xlf
Languages: ja_jp, pl_pl, pt_br, zh_cn

source: no filesystems
ja_jp: ファイルシステムがありません
zh_cn: 无文件系统

source: active
ja_jp: アクティブ
zh_cn: 活跃

source: standby
ja_jp: スタンバイ
zh_cn: 待机

source: standby daemons
ja_jp: スタンバイデーモン
zh_cn: 待机守护进程

source: active daemon
ja_jp: アクティブデーモン
zh_cn: 活跃守护进程

source: value.monmap.mons.length.toString() (quorum value.quorum.join(', '))
ja_jp: value.monmap.mons.length.toString() (定数 value.quorum.join(', '))
zh_cn: value.monmap.mons.length.toString()（仲裁 value.quorum.join(', ')）

source: total
ja_jp: 合計
zh_cn: 总数

source: near full
ja_jp: ほぼフル
zh_cn: 将满

source: full
ja_jp: フル
zh_cn: 全部

source: Clients ( {{ clients.length }})
ja_jp: クライアント( {{ clients.length }})
zh_cn: 客户端 ( {{ clients.length }})

source: Addresses
ja_jp: アドレス
zh_cn: 地址

source: Access Type
ja_jp: アクセスタイプ
zh_cn: 访问类型

source: Cluster
ja_jp: クラスタ
zh_cn: 集群

source: NFS Protocol
ja_jp: NFSプロトコル
zh_cn: NFS 协议

source: Pseudo
ja_jp: 疑似
zh_cn: 伪

source: Transport
ja_jp: トランスポート
zh_cn: 传输

source: Storage Backend
ja_jp: ストレージバックエンド
zh_cn: 存储后端

source: CephFS User
ja_jp: CephFSユーザ
zh_cn: CephFS 用户

source: CephFS Filesystem
ja_jp: CephFSファイルシステム
zh_cn: CephFS 文件系统

source: Security Label
ja_jp: セキュリティラベル
zh_cn: 安全标签

source: Object Gateway
ja_jp: オブジェクトゲートウェイ
zh_cn: 对象网关

source: Object Gateway User
ja_jp: オブジェクトゲートウェイユーザ
zh_cn: 对象网关用户

source: Any client can access
ja_jp: 任意のクライアントからアクセスできます
pl_pl: Każdy klient ma dostęp
pt_br: Qualquer cliente pode acessar
zh_cn: 任何客户端均可访问

source: Addresses
ja_jp: アドレス
pl_pl: Adresy
pt_br: Endereços
zh_cn: 地址

source: Must contain one or more comma-separated values
ja_jp: 1つ以上のカンマ区切り値を含んでいる必要があります
pl_pl: Musi zawierać jedną albo więcej ,rozdzielonych przecinkiem, wartości
pt_br: Deve conter um ou mais valores separados por vírgula
zh_cn: 必须包含一个或多个逗号分隔值

source: For example:
ja_jp: 例:
pl_pl: Na przykład:
pt_br: Por exemplo:
zh_cn: 例如：

source: Access Type
ja_jp: アクセスタイプ
pl_pl: Typ dostępu
pt_br: Tipo de Acesso
zh_cn: 访问类型

source: Add clients
ja_jp: クライアントの追加
pl_pl: Dodaj klientów
pt_br: Adicionar clientes
zh_cn: 添加客户端

source: (inherited from global config)
ja_jp: (グローバル設定から継承)
zh_cn: （从全局配置继承）

source: -- Select the access type --
ja_jp: -- アクセスタイプを選択してください --
zh_cn: -- 选择访问类型 --

source: inherited from global config
ja_jp: グローバル設定から継承されました
zh_cn: 从全局配置继承

source: -- Select what kind of user id squashing is performed --
ja_jp: -- 実行されるユーザIDスカッシュ操作を選択してください --
zh_cn: -- 请选择执行哪种类型的用户 ID 匿名访问 --

source: This is the ID of an NFS Service.
ja_jp: これはNFSサービスのIDです。
zh_cn: 这是 NFS 服务的 ID。

source: -- No cluster available --
ja_jp: -- 使用可能なクラスタがありません --
pl_pl: -- Brak dostępnego klastra --
pt_br: -- Não há clusters disponíveis --
zh_cn: -- 没有可用的集群 --

source: -- Select the cluster --
ja_jp: -- クラスタを選択してください --
pl_pl: -- Wybierz klaster --
pt_br: -- Selecionar cluster --
zh_cn: -- 请选择集群 --

source: This field is required. To create a new NFS cluster, add a new NFS Service .
ja_jp: このフィールドは必須です。 新しいNFSクラスタを作成するには、 新しいNFSサービスを追加します 。
zh_cn: 这是必填字段。要创建新 NFS 集群，请 添加新 NFS 服务 。

source: Storage Backend
ja_jp: ストレージバックエンド
pl_pl: Pamięć Podręczna
pt_br: Backend de Armazenamento
zh_cn: 存储后端

source: -- Select the storage backend --
ja_jp: -- ストレージバックエンドを選択してください --
pl_pl: -- Wybierz pamięć podręczną --
pt_br: -- Selecionar backend de armazenamento --
zh_cn: -- 请选择存储后端 --

source: Volume
ja_jp: ボリューム
zh_cn: 卷

source: -- No CephFS filesystem available --
ja_jp: -- 利用可能なCephFSファイルシステムがありません --
zh_cn: -- 没有可用的 CephFS 文件系统 --

source: -- Select the CephFS filesystem --
ja_jp: -- CephFSファイルシステムを選択してください --
zh_cn: -- 选择 CephFS 文件系统 --

source: Security Label
ja_jp: セキュリティラベル
pl_pl: Etykieta bezpieczeństwa
pt_br: Rótulo de Segurança
zh_cn: 安全标签

source: Enable security label
ja_jp: セキュリティラベルの有効化
pl_pl: Uruchom etykietę bezpieczeństwa
pt_br: Habilitar rótulo de segurança
zh_cn: 启用安全标签

source: CephFS Path
ja_jp: CephFSパス
pl_pl: Ścieżka CephFS
pt_br: Caminho do CephFS
zh_cn: CephFS 路径

source: A path in a CephFS file system.
ja_jp: CephFSファイルシステム内のパス。
zh_cn: CephFS 文件系统中的路径。

source: Path need to start with a '/' and can be followed by a word
ja_jp: パスは「/」で始まる必要があり、その後ろに1つの単語を配置できます
pl_pl: Ścieżka powinna zaczynać się z '/' i następne może być słowo
pt_br: O caminho precisa começar com '/' e pode ser seguido de uma palavra
zh_cn: 路径需以 "/" 开头，后面可跟单词

source: The path does not exist in the selected volume.
ja_jp: パスは選択したボリュームに存在しません。
zh_cn: 选定卷中不存在该路径。

source: Bucket
ja_jp: バケット
zh_cn: 存储桶

source: The bucket does not exist or is not in the default realm (if multiple realms are configured). To continue, create a new bucket .
ja_jp: バケットが存在しないか、デフォルトレルムにありません(複数のレルムが設定されている場合)。 続行するには、 新しいバケットを作成します 。
zh_cn: 存储桶不存在或不在默认领域中（如果配置了多个领域）。要继续，请 创建新的存储桶 。

source: NFS Protocol
ja_jp: NFSプロトコル
pl_pl: Protokół NFS
pt_br: Protocolo NFS
zh_cn: NFS 协议

source: Pseudo
ja_jp: 疑似
zh_cn: 伪

source: The position that this NFS v4 export occupies in the Pseudo FS (it must be unique).
ja_jp: この NFS v4 エクスポートが Pseudo FS 内で占有する位置(この位置は一意である必要があります)。
zh_cn: 此 NFS v4 导出在 伪文件系统 中的位置（必须唯一）。

source: By using different Pseudo options, the same Path may be exported multiple times.
ja_jp: 異なる［疑似］オプションを使用することで、同じパスを複数回エクスポートできます。
pl_pl: Używając różnych opcji Pseudo, ta sama Ścieżka może być wyeksportowana kilka razy.
pt_br: Ao usar opções diferentes de Pseudo, o mesmo Caminho pode ser exportado várias vezes.
zh_cn: 通过使用不同伪选项，可将同一路径导出多次。

source: The pseudo is already in use by another export.
ja_jp: 疑似はすでに別のエクスポートによって使用されています。
zh_cn: 另一个导出中已在使用该伪代码。

source: Pseudo needs to start with a '/' and can't contain any of the following: >, <, |, &, ( or ).
ja_jp: 擬似は「/」で始まる必要があり、>、<、|、&、(または)のいずれも含めることはできません。
zh_cn: 伪必须以 "/" 开头且不能包含以下任何字符：>、<、|、&、( 或 )。

source: -- No access type available --
ja_jp: -- 使用可能なアクセスタイプがありません --
pl_pl: -- Brak dostępnych typów dostępu --
pt_br: -- Não há tipos de acesso disponíveis --
zh_cn: -- 没有可用的访问类型 --

source: The Object Gateway NFS backend has a number of limitations which will seriously affect applications writing to the share. Please consult the for details before enabling write access.
ja_jp: オブジェクトゲートウェイNFSバックエンドには、共有に書き込むアプリケーションに重大な影響を及ぼすいくつかの制限があります。 書き込みアクセスを有効にする前に、 で詳細を確認してください。
zh_cn: 对象网关 NFS 后端存在一些限制，将会严重影响写入该共享的应用。在启用写入访问权限前，请参见 了解详细信息。

source: -- No squash available --
ja_jp: -- 使用可能なスカッシュがありません --
pl_pl: - Brak squasha -
pt_br: -- Não há squashes disponíveis --
zh_cn: -- 没有可用的 squash --

source: Transport Protocol
ja_jp: トランスポートプロトコル
pl_pl: Protokół Transportu
pt_br: Protocolo de Transporte
zh_cn: 传输协议

source: No user id squashing is performed.
ja_jp: 実行されるユーザIDスカッシュ操作はありません。
zh_cn: 未在执行用户 ID 匿名访问。

source: uid 0 and gid 0 are squashed to the Anonymous_Uid and Anonymous_Gid gid 0 in alt_groups lists is also squashed.
ja_jp: uid 0とgid 0は、alt_groupsリストのAnonymous UIDおよびAnonymous GID gid 0にスカッシュ操作されます。
zh_cn: uid 0 和 gid 0 会映射到 Anonymous_Uid 和 Anonymous_Gid，alt_groups 列表中的 gid 0 也会映射为匿名组。

source: uid 0 and gid of any value are squashed to the Anonymous_Uid and Anonymous_Gid alt_groups lists is discarded.
ja_jp: 任意の値のuid 0とgidはAnonymous_Uidにスカッシュ操作され、Anonymous_Gid alt_groupsリストは破棄されます。
zh_cn: uid 0 和任意值的 gid 均会映射到 Anonymous_Uid 和 Anonymous_Gid，alt_groups 列表会被丢弃。

source: All users are squashed.
ja_jp: すべてのユーザがスカッシュ操作されます。
zh_cn: 所有用户都作为匿名用户。

source: NFS export
ja_jp: NFSエクスポート
zh_cn: NFS 导出

source: fsalItem.descr backend is not available. errorMessage
ja_jp: fsalItem.descrバックエンドは使用できません。 errorMessage
zh_cn: fsalItem.descr 后端不可用。 errorMessage

source: Error while retrieving paths.
ja_jp: パスの取得中にエラーが発生しました。
zh_cn: 检索路径时出错。

source: Error while retrieving bucket names.
ja_jp: バケット名の取得中にエラーが発生しました。
zh_cn: 检索存储桶名称时出错。

source: Object Gateway
ja_jp: オブジェクトゲートウェイ
pl_pl: Dostęp obiektowy
pt_br: Gateway de Objetos
zh_cn: 对象网关

source: Performance counters not available
ja_jp: パフォーマンスカウンタを使用できません
pl_pl: Liczniki wydajności nie są dostępne
pt_br: Contadores de desempenho não disponíveis
zh_cn: 性能计数器不可用

source: The name can only consist of alphanumeric characters, dashes and underscores.
ja_jp: 名前は英数字、ダッシュ、および下線のみで構成される必要があります。
pl_pl: Nazwa może składać się z alfanumerycznych znaków, kresek i podkreśleń.
pt_br: O nome pode conter apenas caracteres alfanuméricos, traços e sublinhados.
zh_cn: 名称只能由字母、数字、短划线和下划线组成。

source: The chosen erasure code profile name is already in use.
ja_jp: 選択されたイレイジャコードプロファイル名はすでに使用されています。
pl_pl: Wybrana nazwa profilu kodu kasowania jest już używana.
pt_br: O nome do perfil de código de eliminação escolhido já está em uso.
zh_cn: 所选纠删码配置名称已被使用。

source: Root
ja_jp: ルート
zh_cn: 根

source: Failure domain type
ja_jp: 障害ドメインタイプ
zh_cn: 故障域类型

source: Device class
ja_jp: デバイスクラス
zh_cn: 设备类型

source: Let Ceph decide
ja_jp: Cephの決定を許可する
zh_cn: 让 Ceph 决定

source: Crush Rule
ja_jp: Crushルール
zh_cn: Crush 规则

source: Plugin
ja_jp: プラグイン
pl_pl: Wtyczka
zh_cn: 插件

source: Data chunks (k)
ja_jp: データチャンク(k)
pl_pl: Ramka danych (k)
pt_br: Pacotes de dados (k)
zh_cn: 数据块 (k)

source: Must be equal to or greater than 2.
ja_jp: 2以上である必要があります。
pl_pl: Musi być większa bądź równa 2.
pt_br: Deve ser igual ou maior do que 2.
zh_cn: 必须大于或等于 2。

source: Chunks (k+m) have exceeded the available OSDs of {{deviceCount}}.
ja_jp: チャンク(k+m)は、 {{deviceCount}}の使用可能なOSD数を超えています。
zh_cn: 数据块 (k+m) 已超过 {{deviceCount}} 的可用 OSD 数量。

source: For an equal distribution k has to be a multiple of (k+m)/l.
ja_jp: 等分布の場合、kは(k+m)/lの倍数でなければなりません。
zh_cn: 要实现均衡分布，k 必须为 (k+m)/l 的倍数。

source: K has to be equal to or greater than m in order to recover data correctly through c.
ja_jp: cからデータを正しく復元するには、kはm以上である必要があります。
zh_cn: K 必须大于或等于 m 才能通过 c 正确恢复数据。

source: Distribution factor: {{lrcMultiK}}
ja_jp: 分布係数: {{lrcMultiK}}
zh_cn: 分布系数： {{lrcMultiK}}

source: Coding chunks (m)
ja_jp: コーディングチャンク(m)
pl_pl: Kodowanie kawałka (m)
pt_br: Pacotes de codificação (m)
zh_cn: 编码块 (m)

source: Must be equal to or greater than 1.
ja_jp: 1以上である必要があります。
pl_pl: Musi być większa bądź równa 1.
pt_br: Deve ser igual ou maior do que 1.
zh_cn: 必须大于或等于 1。

source: Durability estimator (c)
ja_jp: 耐久性推定子(c)
pl_pl: Estymator trwałości (c)
pt_br: Estimador de durabilidade (c)
zh_cn: 持久性估值 (c)

source: C has to be equal to or lower than m as m defines the amount of chunks that can be used.
ja_jp: mは使用可能なチャンクの量を定義するため、Cはm以下である必要があります。
zh_cn: C 必须小于或等于 m，因为 m 定义可以使用的数据块数量。

source: Helper chunks (d)
ja_jp: ヘルパーチャンク(d)
zh_cn: 助手块 (d)

source: Set d manually or use the plugin's default calculation that maximizes d.
ja_jp: dを手動で設定するか、dを最大化するプラグインのデフォルト計算を使用します。
zh_cn: 手动设置 d 或使用插件的默认计算值（最大值为 d）。

source: D is automatically updated on k and m changes
ja_jp: Dはkとmの変更時に自動的に更新されます
zh_cn: D 会在 k 和 m 更改时自动更新

source: D can be set from {{getDMin()}} to {{getDMax()}}
ja_jp: Dは {{getDMin()}}～ {{getDMax()}}まで設定できます
zh_cn: D 可设置为 {{getDMin()}} 到 {{getDMax()}}

source: D can only be set to {{getDMax()}}
ja_jp: Dは {{getDMax()}}にのみ設定できます
zh_cn: D 仅可设置为 {{getDMax()}}

source: D has to be greater than k ( {{getDMin()}}).
ja_jp: Dはk ( {{getDMin()}})より大きい必要があります。
zh_cn: D 必须大于 k ( {{getDMin()}})。

source: D has to be lower than k + m ( {{getDMax()}}).
ja_jp: Dはk + m ( {{getDMax()}})より低い必要があります。
zh_cn: D 必须小于 k + m ( {{getDMax()}})。

source: Locality (l)
ja_jp: 地域(l)
pl_pl: Lokalność (l)
pt_br: Localidade (l)
zh_cn: 局部性因子 (l)

source: Can't split up chunks (k+m) correctly with the current locality.
ja_jp: 現在の地域ではチャンク(k+m)を正しく分割できません。
zh_cn: 无法使用当前局部性因子正确分割 (k+m) 个数据块。

source: Locality groups: {{lrcGroups}}
ja_jp: 地域グループ: {{lrcGroups}}
zh_cn: 局部性因子组： {{lrcGroups}}

source: Crush failure domain
ja_jp: Crush障害ドメイン
pl_pl: Domena niepowodzenia Crush
pt_br: Domínio de falha do Crush
zh_cn: CRUSH 故障域

source: Crush Locality
ja_jp: Crush地域
pl_pl: Lokalność Crusha
pt_br: Localidade do Crush
zh_cn: CRUSH 局部性

source: None
ja_jp: なし
pl_pl: Nic
pt_br: Nenhum
zh_cn: 无

source: Technique
ja_jp: 技法
pl_pl: Technika
pt_br: Técnica
zh_cn: 算法

source: Packetsize
ja_jp: パケットサイズ
pl_pl: Rozmiar pakietu
pt_br: Tamanho do pacote
zh_cn: 数据包大小

source: Crush root
ja_jp: Crushルート
pl_pl: korzeń Crusha
pt_br: Raiz do Crush
zh_cn: CRUSH 根

source: Crush device class
ja_jp: Crushデバイスクラス
pl_pl: urządzenie klasy Crush
pt_br: Classe do dispositivo do Crush
zh_cn: CRUSH 设备类型

source: Available OSDs: {{deviceCount}}
ja_jp: 使用可能なOSD数: {{deviceCount}}
zh_cn: 可用 OSD： {{deviceCount}}

source: Directory
ja_jp: ディレクトリ
pl_pl: Katalog
pt_br: Diretório
zh_cn: 目录

source: EC Profile
ja_jp: ECプロファイル
zh_cn: EC 配置

source: Cache Tiers Details
ja_jp: キャッシュ層の詳細
pl_pl: Szczegóły poziomów pamięci podręcznej
pt_br: Detalhes das Camadas do Cache
zh_cn: 缓存层详细信息

source: Cache Mode
ja_jp: キャッシュモード
zh_cn: 缓存模式

source: Min Evict Age
ja_jp: 退去までの最小経過時間
zh_cn: 逐出前至少可存留的时间

source: Min Flush Age
ja_jp: 消去までの最小経過時間
zh_cn: 刷回前至少可存留的时间

source: Target Max Bytes
ja_jp: ターゲットの最大バイト数
zh_cn: 目标最大字节数

source: Target Max Objects
ja_jp: ターゲットの最大オブジェクト数
zh_cn: 目标最大对象数

source: No applications added
ja_jp: アプリケーションは追加されていません
zh_cn: 未添加任何应用标记

source: Applications limit reached
ja_jp: アプリケーション数の上限に達しました
zh_cn: 应用标记已达到上限

source: A pool can only have up to four applications definitions.
ja_jp: 1つのプールは最大で4つのアプリケーション定義しか保有できません。
zh_cn: 一个存储池最多只能有四个应用标记定义。

source: Allowed characters '_a-zA-Z0-9'
ja_jp: 使用可能な文字「_a-zA-Z0-9」
zh_cn: 可用的字符为 "_a-zA-Z0-9"

source: Maximum length is 128 characters
ja_jp: 最大長は128文字です
zh_cn: 长度限制为 128 个字符

source: Filter or add applications'
ja_jp: アプリケーションのフィルタリングまたは追加
zh_cn: 过滤或添加应用

source: Add application
ja_jp: アプリケーションの追加
zh_cn: 添加应用标记

source: The chosen Ceph pool name is already in use.
ja_jp: 選択されたCephプール名はすでに使用されています。
pl_pl: Wybrana nazwa Ceph pula jest już użyta.
pt_br: O nome do pool do Ceph escolhido já está em uso.
zh_cn: 所选 Ceph 存储池名称已被使用。

source: It's not possible to create an RBD pool with '/' in the name. Please change the name or remove 'rbd' from the applications list.
ja_jp: 名前に「/」が含まれたRBDプールを作成することはできません。名前を変更するか、アプリケーションリストから「rbd」を削除してください。
zh_cn: 无法创建名称中包含 "/" 的 RBD 存储池。请更改名称或从应用列表中删除 "rbd"。

source: Pool name can only contain letters, numbers, '.', '-', '_' or '/'.
ja_jp: プール名には、文字、数字、「.」、「-」、「_」、または「/」のみを含めることができます。
zh_cn: 存储池名称只能包含字母、数字、"."、"-"、"_" 或 "/"。

source: Pool type
ja_jp: プールタイプ
pl_pl: Typ pula
pt_br: Tipo de pool
zh_cn: 存储池类型

source: -- Select a pool type --
ja_jp: -- プールタイプを選択してください --
pl_pl: -- Wybierz typ pula --
pt_br: -- Selecionar tipo de pool --
zh_cn: -- 请选择存储池类型 --

source: PG Autoscale
ja_jp: 配置グループオートスケール
zh_cn: PG 自动伸缩

source: Placement groups
ja_jp: 配置グループ
pl_pl: Grupa umieszczenia
pt_br: Grupos de posicionamento
zh_cn: 归置组

source: At least one placement group is needed!
ja_jp: 少なくとも1つの配置グループが必要です。
pl_pl: Przynajmniej jedna grupa umieszczenia jest wymagana
pt_br: Pelo menos um grupo de posicionamento é necessário!
zh_cn: 至少需要一个归置组！

source: Your cluster can't handle this many PGs. Please recalculate the PG amount needed.
ja_jp: ご使用のクラスタはこれだけ多数の配置グループを処理できません。必要な配置グループの数を再計算してください。
pl_pl: Twój klaster nie obsługuje tylu PG. Skalkuluj proszę potrzebną ilość PG.
pt_br: Seu cluster não pode processar tantos PGs. Recalcule a quantidade de PG necessária.
zh_cn: 您的集群无法处理这么多的 PG。请重新计算需要的 PG 数量。

source: Calculation help
ja_jp: 計算のヘルプ
pl_pl: Pomoc obliczeniowa
pt_br: Ajuda no cálculo
zh_cn: 在线 PG 计算器

source: The current PGs settings were calculated for you, you should make sure the values suit your needs before submit.
ja_jp: 現在の配置グループ設定は自動的に計算されたため、送信前に、これらの値がニーズに合っていることを確認してください。
zh_cn: 当前的 PG 设置是为您计算的，您应在提交前确保这些值符合您的需求。

source: Replicated size
ja_jp: 複製されたサイズ
pl_pl: Replikowany rozmiar
pt_br: Tamanho replicado
zh_cn: 副本个数

source: Minimum: {{ getMinSize() }}
ja_jp: 最小値: {{ getMinSize() }}
zh_cn: 最低： {{ getMinSize() }}

source: Maximum: {{ getMaxSize() }}
ja_jp: 最大値: {{ getMaxSize() }}
zh_cn: 最高： {{ getMaxSize() }}

source: The size specified is out of range. A value from {{ getMinSize() }} to {{ getMaxSize() }} is usable.
ja_jp: 指定されたサイズは範囲外です。 有効な値の範囲は {{ getMinSize() }}～ {{ getMaxSize() }}です。
zh_cn: 指定的个数超出范围。请使用介于 {{ getMinSize() }} 到 {{ getMaxSize() }} 的值。

source: A size of 1 will not create a replication of the object. The 'Replicated size' includes the object itself.
ja_jp: 1のサイズではオブジェクトのレプリケーションは作成されません。「複製されたサイズ」にはオブジェクト自体が含まれます。
zh_cn: 指定个数 1 将不创建对象的副本。"副本个数" 包括对象本身。

source: EC Overwrites
ja_jp: ECの上書き
pl_pl: EC Nadpisuje
pt_br: Sobregravações de EC
zh_cn: EC 重写

source: Applications
ja_jp: アプリケーション
pl_pl: Zastosowania
pt_br: Aplicativos
zh_cn: 应用标记

source: Erasure code profile
ja_jp: イレイジャコードプロファイル
pl_pl: Skasuj profil kodu.
pt_br: Perfil do código de eliminação
zh_cn: 纠删码配置

source: -- No erasure code profile available --
ja_jp: -- 使用可能なイレイジャコードプロファイルがありません --
pl_pl: -- Brak profilu kasowania --
pt_br: -- Não há perfis de código de eliminação disponíveis --
zh_cn: -- 没有可用的纠删码配置 --

source: -- Select an erasure code profile --
ja_jp: -- イレイジャコードプロファイルを選択してください --
pl_pl: -- Wybierz profil kodu wymazywania --
pt_br: -- Selecionar perfil do código de eliminação --
zh_cn: -- 请选择纠删码配置 --

source: This profile can't be deleted as it is in use.
ja_jp: このプロファイルは使用中のため削除できません。
zh_cn: 此配置正被使用，不能删除。

source: Profile
ja_jp: プロファイル
zh_cn: 配置

source: Used by pools
ja_jp: プールで使用
zh_cn: 由存储池使用

source: Profile is not in use.
ja_jp: プロファイルは使用されていません。
zh_cn: 配置未被使用。

source: Crush ruleset
ja_jp: Crushルールセット
pl_pl: zbiór zasad Crush
pt_br: Conjunto de regras do Crush
zh_cn: CRUSH 规则集

source: A new crush ruleset will be implicitly created.
ja_jp: 新しいCrushルールセットが暗黙的に作成されます。
zh_cn: 将隐式创建一个新的 crush 规则集。

source: There are no rules.
ja_jp: ルールはありません。
zh_cn: 没有规则。

source: -- Select a crush rule --
ja_jp: -- Crushルールを選択してください --
pl_pl: -- Wybierz zasadę Crush --
pt_br: -- Selecionar regra de crush --
zh_cn: -- 请选择 CRUSH 规则 --

source: This rule can't be deleted as it is in use.
ja_jp: このルールは使用中のため削除できません。
zh_cn: 此规则正被使用，不能删除。

source: Crush rule
ja_jp: Crushルール
pl_pl: zasada Crush
pt_br: Regra de Crush
zh_cn: CRUSH 规则

source: Crush steps
ja_jp: Crushステップ
pl_pl: Kroki Crush
pt_br: Etapas do Crush
zh_cn: CRUSH 步骤

source: Rule is not in use.
ja_jp: ルールは使用されていません。
zh_cn: 规则未被使用。

source: The rule can't be used in the current cluster as it has too few OSDs to meet the minimum required OSD by this rule.
ja_jp: このルールは、このルールで最低限必要なOSDを満たすにはOSDが少なすぎるため、現在のクラスタでは使用できません。
zh_cn: 无法在当前集群中使用该规则，因为集群的 OSD 数量太少，不满足此规则要求的最低 OSD 数量。

source: Compression
ja_jp: 圧縮
pl_pl: Kompresja
pt_br: Compactação
zh_cn: 压缩

source: Algorithm
ja_jp: アルゴリズム
pl_pl: Algorytm
pt_br: Algoritmo
zh_cn: 算法

source: -- No erasure compression algorithm available --
ja_jp: -- 使用可能なイレイジャ圧縮アルゴリズムがありません --
pl_pl: -- Brak algorytmu kompresji wymazywania --
pt_br: -- Não há algoritmos de compactação de eliminação disponíveis --
zh_cn: -- 没有可用的纠删码压缩算法 --

source: Minimum blob size
ja_jp: 最小blobサイズ
pl_pl: Minimalny rozmiar blob
pt_br: Tamanho mínimo do blob
zh_cn: blob 大小下限

source: e.g., 128KiB
ja_jp: 例: 128KiB
pl_pl: np. 128 KB
pt_br: ex. 128 KiB
zh_cn: 例如 128 KiB

source: Value should be greater than 0
ja_jp: 値は0より大きい必要があります
pl_pl: Wartość powinna być większa niż 0
pt_br: O valor deve ser maior do que 0
zh_cn: 值应大于 0

source: Value should be less than the maximum blob size
ja_jp: 値は最大blobサイズより小さい必要があります
zh_cn: 值应小于 blob 大小上限

source: Maximum blob size
ja_jp: 最大blobサイズ
pl_pl: Maksymalny rozmiar blob
pt_br: Tamanho máximo do blob
zh_cn: blob 大小上限

source: e.g., 512KiB
ja_jp: 例: 512KiB
pl_pl: np. 512 KB
pt_br: ex. 512 KiB
zh_cn: 例如 512KiB

source: Value should be greater than the minimum blob size
ja_jp: 値は最小blobサイズより大きい必要があります
pl_pl: Wartość powinna być większa niż minimalny rozmiar blob
pt_br: O valor deve ser maior do que o tamanho mínimo do blob
zh_cn: 值应大于 blob 大小下限

source: Ratio
ja_jp: 率
pl_pl: Stosunek
pt_br: Taxa
zh_cn: 比例

source: Compression ratio
ja_jp: 圧縮率
pl_pl: Skompresowany stosunek
pt_br: Taxa de compactação
zh_cn: 压缩率

source: Value should be between 0.0 and 1.0
ja_jp: 値は0.0～1.0の間である必要があります
pl_pl: Wartość powinna być pomiędzy 0.0, a 1.0
pt_br: O valor deve ser entre 0.0 e 1.0
zh_cn: 值应介于 0.0 到 1.0 之间

source: Max bytes
ja_jp: 最大バイト数
zh_cn: 最大字节数

source: Leave it blank or specify 0 to disable this quota.
ja_jp: このクォータを無効にするには、空白のままにするか、0を指定します。
zh_cn: 留空或指定 0 可禁用此配额。

source: A valid quota should be greater than 0.
ja_jp: 有効なクォータは0より大きい必要があります。
zh_cn: 有效配额应大于 0。

source: Max objects
ja_jp: 最大オブジェクト数
zh_cn: 最大对象数

source: The value should be greater or equal to 0
ja_jp: 値は0以上である必要があります
zh_cn: 该值应大于或等于 0

source: pool
ja_jp: プール
zh_cn: 存储池

source: erasure code profile
ja_jp: イレイジャコードプロファイル
zh_cn: 纠删码配置

source: crush rule
ja_jp: Crushルール
zh_cn: Crush 规则

source: Pools List
ja_jp: プールリスト
pl_pl: Lista puli
pt_br: Lista de Pools
zh_cn: 存储池列表

source: Data Protection
ja_jp: データ保護
zh_cn: 数据保护

source: Applications
ja_jp: アプリケーション
zh_cn: 应用标记

source: PG Status
ja_jp: 配置グループのステータス
zh_cn: PG 状态

source: Crush Ruleset
ja_jp: Crushルールセット
zh_cn: CRUSH 规则集

source: Pool deletion is disabled by the mon_allow_pool_delete configuration setting.
ja_jp: プールの削除は、mon_allow_pool_delete構成設定によって無効にされています。
zh_cn: mon_allow_pool_delete 配置设置已禁用存储池删除功能。

source: Owner
ja_jp: 所有者
pl_pl: Właściciel
pt_br: Proprietário
zh_cn: 所有者

source: Index type
ja_jp: インデックスタイプ
pl_pl: Typ indeksu
pt_br: Tipo de índice
zh_cn: 索引类型

source: Placement rule
ja_jp: 配置ルール
pl_pl: Zasada umieszczania
pt_br: Regra de posicionamento
zh_cn: 归置规则

source: Marker
ja_jp: マーカー
pl_pl: Znacznik
pt_br: Marcador
zh_cn: 标记

source: Maximum marker
ja_jp: 最大マーカー
pl_pl: Maksymalny znacznik
pt_br: Marcador máximo
zh_cn: 上限标记

source: Master version
ja_jp: マスタバージョン
pl_pl: Główna wersja
pt_br: Versão master
zh_cn: 主版本

source: Modification time
ja_jp: 変更時間
pl_pl: Czas modyfikacji
pt_br: Horário da modificação
zh_cn: 修改时间

source: Zonegroup
ja_jp: ゾーングループ
pl_pl: Strefa
pt_br: Grupo de zonas
zh_cn: 区域组

source: Versioning
ja_jp: バージョニング
zh_cn: 版本控制

source: MFA Delete
ja_jp: MFA削除
zh_cn: MFA 删除

source: Bucket quota
ja_jp: バケットクォータ
pl_pl: kontyngent wiadra
pt_br: Cota do compartimento
zh_cn: 存储桶配额

source: Enabled
ja_jp: 有効化済み
pl_pl: Uaktywniony
pt_br: Habilitado
zh_cn: 已启用

source: Maximum size
ja_jp: 最大サイズ
pl_pl: Maksymalny rozmiar
pt_br: Tamanho máximo
zh_cn: 大小上限

source: Unlimited
ja_jp: 無制限
pl_pl: Nielimitowany
pt_br: Ilimitado
zh_cn: 无限制

source: Maximum objects
ja_jp: 最大オブジェクト数
pl_pl: Maksimum obiektów
pt_br: Máximo de objetos
zh_cn: 对象数目上限

source: Locking
ja_jp: ロック
zh_cn: 锁定

source: Days
ja_jp: 日数
zh_cn: 天

source: Bucket names can only contain lowercase letters, numbers, periods and hyphens.
ja_jp: バケット名には、小文字、数字、ピリオド、ハイフンのみを含めることができます。
zh_cn: 存储桶名称只能包含小写字母、数字、句点和连字符。

source: The chosen name is already in use.
ja_jp: 選択された名前はすでに使用されています。
pl_pl: Wybrana nazwa już jest użyta.
pt_br: O nome escolhido já está em uso.
zh_cn: 所选名称已被使用。

source: Bucket names must not contain uppercase characters or underscores.
ja_jp: バケット名に大文字やアンダースコアを含めることはできません。
zh_cn: 存储桶名称不能包含大写字符或下划线。

source: Each label must start and end with a lowercase letter or a number.
ja_jp: 各ラベルは、小文字または数字で始まり、小文字または数字で終わる必要があります。
zh_cn: 每个标签都必须以小写字母或数字开头和结尾。

source: Bucket names cannot be formatted as IP address.
ja_jp: バケット名をIPアドレスとしてフォーマットすることはできません。
zh_cn: 存储桶名称不能采用 IP 地址格式。

source: Bucket labels cannot be empty and can only contain lowercase letters, numbers and hyphens.
ja_jp: バケットラベルは空にすることはできず、小文字、数字、ハイフンのみを含めることができます。
zh_cn: 存储桶标签不能为空，并且只能包含小写字母、数字和连字符。

source: Bucket names must be 3 to 63 characters long.
ja_jp: バケット名は3～63文字である必要があります。
zh_cn: 存储桶名称长度必须在 3 到 63 个字符之间。

source: -- Select a user --
ja_jp: -- ユーザを選択してください --
pl_pl: -- Wybierz użytkownika --
pt_br: -- Selecionar usuário --
zh_cn: -- 请选择用户 --

source: Placement target
ja_jp: 配置ターゲット
zh_cn: 归置目标

source: -- Select a placement target --
ja_jp: -- 配置ターゲットを選択してください --
zh_cn: -- 选择归置目标 --

source: Enables versioning for the objects in the bucket.
ja_jp: バケット内のオブジェクトのバージョニングを有効にします。
zh_cn: 对存储桶中的对象启用版本控制。

source: Multi-Factor Authentication
ja_jp: 多要素認証
zh_cn: 多重身份验证
