Repository: ceph/ceph
Catalog: src/pybind/mgr/dashboard/frontend/src/locale/messages.*.xlf
Languages: ja_jp, pl_pl, pt_br, zh_cn

source: An IQN has the following notation 'iqn.$year-$month.$reversedAddress:$definedName'
pl_pl: IQN ma następującą notację „iqn. $ Rok-$ miesiąc. $ odwróconyAdres: $ zdefiniowanaNazwa”

source: Backstore: {{ imagesSettings[image].backstore }}.
pl_pl: Tylny koniec przechowywania: {{ imagesSettings[image].backstore }}.

source: At least 1 image is required.
pl_pl: Wymagany jest przynajmniej 1 obraz.
pt_br: Pelo menos 1 imagem é necessária.

source: Usernames must have a length of 8 to 64 characters and can only contain letters, '.', '@', '-', '_' or ':'.
pl_pl: Nazwy użytkowników muszą mieć długość od 8 do 64 znaków i mogą zawierać jedynie litery, '.', '@', '-', '_' lub ':'.
pt_br: Os nomes de usuário devem ter entre 8 e 64 caracteres e apenas podem conter letras, '.', '@', '-', '_' ou ':'.

source: Submit
pl_pl: Zatwierdź
pt_br: Enviar

source: Usernames must have a length of 8 to 64 characters and can only contain letters, '.', '@', '-', '_' or ':'.
pl_pl: Nazwy użytkowników muszą mieć długość od 8 do 64 znaków i mogą zawierać jedynie litery, '.', '@', '-', '_' lub ':'.
pt_br: Os nomes de usuário devem ter entre 8 e 64 caracteres e apenas podem conter letras, '.', '@', '-', '_' ou ':'.

source: Please consult the documentation on how to configure and enable the iSCSI Targets management functionality.
pl_pl: Sprawdź proszę dokumentację jak skonfigurować i uruchomić zarządzanie funkcjonalnościami obiektami docelowymi iSCSI

source: Set discovery authentication
pl_pl: Ustaw uwierzytelnianie wykrywania

source: {VAR_SELECT, select, editing {Edit} cloning {Clone} copying {Copy} other {Add} }
pl_pl: {VAR_SELECT, wybierz, edytowanie{Edytuj} klonowanie{Klonuj} kopiowanie{Kopiuj} inaczej {Dodaj} }

source: {VAR_SELECT, select, cloning {Clone from} copying {Copy from} other {Parent} }
pl_pl: {VAR_SELECT, wybierz, klonowanie{Klonuj od} kopiowanie{Kopiuj od} inaczej {Rodzic} }

source: Stripe unit
pl_pl: Jednostka pasków
pt_br: Unidade de distribuição

source: Stripe count
pl_pl: Licznik pasków
pt_br: Total de distribuições

source: {VAR_SELECT, select, editing {Update} cloning {Clone} copying {Copy} other {Create} }
pl_pl: {VAR_SELECT, wybierz, edytowanie{Aktualizuj} klonowanie{Klonuj} kopiowanie{Kopiuj} inaczej {Dodaj} }

source: Save
pl_pl: Zapisz
pt_br: Salvar

source: No entries found
pl_pl: Nie znaleziono wejść
pt_br: Nenhuma entrada encontrada

source: Loading configuration...
pl_pl: Ładowanie konfiguracji.
pt_br: Carregando configuração...

source: The configuration could not be loaded.
pl_pl: Nie można załadować konfiguracji
pt_br: Não foi possível carregar a configuração.

source: Update
pl_pl: Zaktualizuj
pt_br: Atualizar

source: Reweight OSD
pl_pl: Ponowne ważenie OSD

source: Reweight
pl_pl: Ponowne ważenie
pt_br: Reponderar

source: OSDs {deep, select, 1 {...}}Scrub
pl_pl: Szoruj {deep, select, 1 {...}} OSD-ki

source: {VAR_SELECT, select, 1 {Deep } }
pl_pl: {VAR_SELECT, wybierz, 1 {Głębokość} }
pt_br: {VAR_SELECT, select, 1 {Profundo } }

source: You are about to apply a {deep, select, 1 {...}}scrub to the OSD {{ selected[0].id }} .
pl_pl: Zamierzasz zaaplikować {deep, select, 1 {...}} szorowanie na OSD {{ selected[0].id }} .

source: {VAR_SELECT, select, 1 {deep } }
pl_pl: {VAR_SELECT, wybierz, 1 {głębokość} }
pt_br: {VAR_SELECT, select, 1 {profundo} }

source: Set Cluster-wide Flags
pl_pl: Ustaw flagi na całym klastrze

source: Set Cluster-wide Recovery Priority
pl_pl: Ustaw priorytet odzyskiwania dla całego klastra

source: OSD {{ selection.first().id }} will be marked {{ markActionDescription }} if you proceed.
pl_pl: Jeśli kontynuujesz OSD {{ selection.first().id }} będzie zaznaczony {{ markActionDescription }} .

source: The OSD is not safe to destroy!
pl_pl: Nie można bezpiecznie zniszczyć tego OSD.

source: OSD {{ selection.first().id }} will be {{ actionDescription }} if you proceed.
pl_pl: Jeśli kontyuujesz OSD {{ selection.first().id }} będzie {{ actionDescription }} .

source: Health
pl_pl: Zdrowie
pt_br: Saúde

source: Statistics
pl_pl: Statystyki
pt_br: Estatísticas

source: Please consult the documentation on how to configure and enable the NFS Ganesha management functionality.
pl_pl: Sprawdź proszę dokumentację jak należy skonfigurować i uruchomić zarządzanie funkcjami NFS Ganeshy

source: Required field
pl_pl: Obowiązkowe pole
pt_br: Campo obrigatório

source: NFS export {{ export_id ? cluster_id + ':' + export_id : '' }}
pl_pl: NFS eksportuje {{ export_id ? cluster_id + ':' + export_id : '' }}

source: Add daemon
pl_pl: Dodaj demona
pt_br: Adicionar daemon

source: Object Gateway User
pl_pl: Użytkownik dostępu obiektowego
pt_br: Usuário do Gateway de Objetos

source: -- No users available --
pl_pl: -- Brak dostępnych użytkowników --
pt_br: -- Não há usuários disponíveis --

source: -- Select the object gateway user --
pl_pl: -- Wybierz użytkownika dostępu obiektowego --
pt_br: -- Selecionar usuário do gateway de objetos --

source: CephFS User ID
pl_pl: CephFS Użytkownik ID
pt_br: ID de Usuário do CephFS

source: -- No clients available --
pl_pl: -- Brak dostępnych klientów --
pt_br: -- Não há clientes disponíveis --

source: -- Select the cephx client --
pl_pl: -- Wybierz klienta cephx --
pt_br: -- Selecionar cliente do cephx --

source: CephFS Name
pl_pl: Nazwa CephFS
pt_br: Nome do CephFS

source: New directory will be created
pl_pl: Nowy katalog będzie stworzony.
pt_br: Novo diretório será criado

source: Path
pl_pl: Ścieżka
pt_br: Caminho

source: Path can only be a single '/' or a word
pl_pl: Ścieżką może być tylko '/' albo słowo
pt_br: O caminho pode ser apenas uma '/' ou uma palavra

source: New bucket will be created
pl_pl: Nowe wiadro będzie stworzone
pt_br: Novo compartimento será criado

source: NFS Tag
pl_pl: Tag NFS
pt_br: Tag NFS

source: Alternative access for NFS v3 mounts (it must not have a leading /).
pl_pl: Alternatywny dostęp do NFS v3 montuje ( nie musi mieć poprzedzającego '/' )

source: Clients may not mount subdirectories (i.e. if Tag = foo, the client may not mount foo/baz).
pl_pl: Klient może nie montować podkatalogów ( np. jeśli Tag = foo, klient może nie montować foo/baz)
pt_br: Clientes não podem montar subdiretórios (ou seja, se Tag = foo, o cliente não poderá montar foo/baz).

source: By using different Tag options, the same Path may be exported multiple times.
pl_pl: Używając różnych opcji Tagu, ta sama Ścieżka może być wyeksportowana kilka razy.
pt_br: Ao usar opções diferentes de Tag, o mesmo Caminho pode ser exportado várias vezes.

source: The position that this NFS v4 export occupies in the Pseudo FS (it must be unique).
pl_pl: Pozycja, którą NFS v4 eksport zajmuje w Pseudo FS (musi być unikatowa).

source: Wrong format
pl_pl: Zły format

source: -- Select the access type --
pl_pl: -- Wybierz typ dostępu --
pt_br: -- Selecionar tipo de acesso --

source: --Select what kind of user id squashing is performed --
pl_pl: -- Wybierz, jakiego rodzaju identyfikacja użytkownika ma być przeprowadzana --
pt_br: --Selecionar que tipo de squash de ID de usuário será executado --

source: Add erasure code profile
pl_pl: Dodaj profil kasowania

source: any
pl_pl: którykolwiek
pt_br: qualquer

source: {editing, select, 1 {...} other {...}} pool
pl_pl: {editing, select, 1 {...} other {...}} pul

source: {VAR_SELECT, select, 1 {Edit} other {Add} }
pl_pl: {VAR_SELECT, wybierz, 1 {Edytuj} inaczej{Dodaj} }

source: You can only increase the number of PGs of an existing pool. Currently your pool has {{ data.pool.pg_num }} PGs.
pl_pl: Możesz zwiększyć liczbę PG na utrworzonym pulu. Teraz pul ma {{ data.pool.pg_num }} PGs.

source: The current PGs settings were calculated for you, you should make sure the values suit your needs before submit.
pl_pl: Obecne ustawienia PG zostały policzone dla Ciebie, powinieneś upewnić się czy te wartości Ci odpowiadają przed zatwierdzeniem.

source: The rule can't be used in the current cluster as it has to few OSDs to meet the minimum required OSD by this rule.
pl_pl: Zasada nie może być użyta w obecnym klastrze, gdyż ma zbyt mało OSD-ków, żeby spełnić minimum OSD-ków wymaganych przez tę zasadę.
pt_br: Impossível usar a regra no cluster atual porque ela tem poucos OSDs para atender ao OSD mínimo necessário para esta regra.

source: The size specified is out of range. A value from {{ getMinSize() }} to {{ getMaxSize() }} is valid.
pl_pl: Sprecyzowany rozmiar jest poza zakresem. Wartość od {{ getMinSize() }} do {{ getMaxSize() }} jest poprawna.

source: Value should be greater than the maximum blob size
pl_pl: Wartość powinna być większa niż maksymalny rozmiar blob

source: It's not possible to create an RBD pool with '/' in the name.
pl_pl: Nie można stworzyć pula RBD z '/' w nazwie.

source: Please change the name or remove 'rbd' from the applications list.
pl_pl: Proszę zmienić nazwę albo usunąć 'rbd' z listy zastosowań.

source: {editing, select, 1 {...} other {...}} pool
pl_pl: {editing, select, 1 {...} other {...}} pul

source: {VAR_SELECT, select, 1 {Edit} other {Create} }
pl_pl: {VAR_SELECT, wybierz, 1 {Edytuj} inaczej{Utwórz} }

source: Please consult the documentation on how to configure and enable the Object Gateway management functionality.
pl_pl: Sprawdź proszę dokumentację jak skonfigurować i i uruchomić zarządzanie funkcjami Dostępu obiektowego

source: Loading bucket data...
pl_pl: Ładowanie wiadra danych
pt_br: Carregando dados do compartimento...

source: The bucket data could not be loaded.
pl_pl: Nie można załadować wiadra danych.

source: {editing, select, 1 {...} other {...}} bucket
pl_pl: {editing, select, 1 {...} other {...}} wiadro

source: Id
pl_pl: Number ID

source: {VAR_SELECT, select, 1 {Update} other {Add} }
pl_pl: {VAR_SELECT, wybierz, 1 {Aktualizuj} inaczej{Utwórz} }

source: Daemons List
pl_pl: Lista demonów
pt_br: Lista de Daemons

source: Capability
pl_pl: Zdolność

source: Loading user data...
pl_pl: Ładowanie danych użytkownika...
pt_br: Carregando dados do usuário...

source: The user data could not be loaded.
pl_pl: Nie można załadować danych użytkownika.
pt_br: Não foi possível carregar os dados do usuário.

source: Add subuser
pl_pl: Dodaj pod-użytkownika

source: S3
pl_pl: S3 (prosty serwis przechowywania)

source: Add S3 key
pl_pl: Dodaj klucz S3

source: Add capability
pl_pl: Dodaj zdolność

source: Welcome to Ceph!
pl_pl: Witamy w Cephie!
pt_br: Bem-vindo ao Ceph!

source: Login
pl_pl: Zaloguj

source: {mode, select, editing {...} other {...}} Role
pl_pl: {mode, select, editing {...} other {...}} Rola

source: {VAR_SELECT, select, editing {Edit} other {Add} }
pl_pl: {VAR_SELECT, wybierz, edytowanie{Edytuj} inaczej{Dodaj} }

source: {mode, select, editing {...} other {...}} Role
pl_pl: {mode, select, editing {...} other {...}} Rola

source: {VAR_SELECT, select, editing {Update} other {Create} }
pl_pl: {VAR_SELECT, wybierz, edytowanie {Aktualizuj} inaczej{Utwórz} }

source: Sorry, the user does not exist in Ceph.
pl_pl: Przepraszam, użytkownik nie istnieje w Ceph.
pt_br: O usuário não existe no Ceph.

source: Return to Login Page . You'll be logged out from the Identity Provider when you retry logging in.
pl_pl: Powrót do Strony Logowania . Zostaniesz wylogowany z Dostastcy Tożsamości , kiedy spróbujesz się zalgować.

source: {mode, select, editing {...} other {...}} User
pl_pl: {mode, select, editing {...} other {...}} Użytkownik

source: {mode, select, editing {...} other {...}} User
pl_pl: {mode, select, editing {...} other {...}} Użytkownik

source: Forbidden
pl_pl: Zakazany
pt_br: Proibido

source: Sorry, you are not allowed to see what you were looking for.
pl_pl: Przepraszam, nie masz dostępu do tego czego szukasz.
pt_br: Você não tem permissão para ver o que está procurando.

source: Sorry, we could not find what you were looking for
pl_pl: Przepraszam, nie możemy znaleźć tego czego szukasz.
pt_br: Não foi possível localizar o que você está procurando

source: Remove all
pl_pl: Usuń wszystko

source: Recent Notifications
pl_pl: Ostatnie powiadomienia

source: There are no background tasks.
pl_pl: Brak zadań w tle.

source: Background Tasks
pl_pl: Zagadnienia w tle

source: Documentation
pl_pl: Dokumentacja
pt_br: Documentação

source: API
pl_pl: Interfejs API

source: Signed in as {{ username }}
pl_pl: Zalogowany jako {{ username }}

source: The mininum value is 0
pl_pl: Minimalna wartość wynosi 0.
pt_br: O valor mínimo é 0

source: Histogram not available: {{ osd.histogram_failed }}
pl_pl: Histogram niedostępny: {{ osd.histogram_failed }}

source: Writes
pl_pl: Pisze
pt_br: Gravações

source: Reads
pl_pl: Czyta
pt_br: Leituras

source: Manager Daemons
pl_pl: Zarządzanie demonami
pt_br: Daemons do Gerenciador

source: Client IOPS
pl_pl: Klient IOPS
pt_br: IOPS do Cliente

source: Scrub
pl_pl: Szoruj
pt_br: Remoção

source: See Logs for more details.
pl_pl: zobacz logi , żeby mieć więcej szczegółów.

source: To move {{ poolName }}/ {{ imageName }} to trash, click Move Image . Optionally, you can pick an expiration date.
pl_pl: Żeby przenieść {{ poolName }}/ {{ imageName }} do kosza, kliknij Przenieś obraz . Opcjonalnie, możesz wybrać datę ważności.

source: Move Image
pl_pl: Przenieś obraz
pt_br: Mover Imagem

source: { editing, select, true {...} other {...}} RBD Snapshot
pl_pl: { editing, select, true {...} other {...}} migawka RBD

source: {VAR_SELECT, select, true {Rename} other {Create} }
pl_pl: {VAR_SELECT, wybierz, prawda {Zmień nazwe} inaczej{Utwórz} }
pt_br: {VAR_SELECT, select, true {Renomear} other {Criar} }

source: { editing, select, true {...} other {...}} Snapshot
pl_pl: { editing, select, true {...} other {...}} Migawka

source: PROTECTED
pl_pl: ZABEZPIECZONE

source: UNPROTECTED
pl_pl: NIEZABEZPIECZONY
pt_br: NÃO PROTEGIDO

source: To purge, select one or All images and click
pl_pl: Aby usunąć, wybierz jeden albo wszystkie obrazy i kliknij
pt_br: Para purgar, selecione uma ou Todas as imagens e clique em

source: To restore
pl_pl: Przywróć
pt_br: Para restaurar

source: type the image's new name and click
pl_pl: Wpisz nazwe nowego obrazu i kliknij.
pt_br: digite o novo nome da imagem e clique em

source: Issues
pl_pl: Zagadnienia
pt_br: Problemas

source: Syncing
pl_pl: Synchronizacja
pt_br: Sincronizando

source: Ready
pl_pl: Gotowy
pt_br: Pronto

source: To edit the mirror mode for pool {{ poolName }} , select a new mode from the list and click Update .
pl_pl: Aby edytować tryb lustrzanydla pula {{ poolName }} , wybierz tryb z listy i kliknij Zaktualizuj .

source: {mode, select, edit {...} other {...}} pool mirror peer
pl_pl: {mode, select, edit {...} other {...}} sparowany pul lustrzany

source: {VAR_SELECT, select, edit {Edit} other {Add} }
pl_pl: {VAR_SELECT, wybierz, edytuj{Edytuj} inaczej {Dodaj} }
pt_br: {VAR_SELECT, select, edit {Editar} other {Adicionar} }

source: {mode, select, edit {...} other {...}} the pool mirror peer attributes for pool {{ poolName }} and click Submit .
pl_pl: {mode, select, edit {...} other {...}} pul lustra sparowanych atrybutów dla pula {{ poolName }} i kliknij Zatwierdź .

source: Clients: {{ clientCount }}
pl_pl: Klienci: {{ clientCount }}

source: Current
pl_pl: Obecny
pt_br: Atual

source: Updated discovery authentication
pl_pl: Zaktualizowane uwierzytelnianie wykrywania
pt_br: Autenticação de descoberta atualizada

source: There are no portals available.
pl_pl: Brak dostępnych portali.
pt_br: Não há portais disponíveis.

source: There are no images available.
pl_pl: Nie ma dostępnych obrazów.
pt_br: Não há imagens disponíveis.

source: There are no images available. Please make sure you add an image to the target.
pl_pl: Nie ma dostępnych obrazów. Proszę się upewnić, że dodajesz obraz do obiektu docelowego.
pt_br: Não há imagens disponíveis. Adicione uma imagem ao destino.

source: There are no initiators available. Please make sure you add an initiator to the target.
pl_pl: Nie ma dostępnych inicjatorów iSCSI. Proszę upewnić się, że dodajesz inicjator iSCSI do obiektu docelowego.
pt_br: Não há iniciadores disponíveis. Adicione um iniciador ao destino.

source: Target
pl_pl: obiekt docelowy iSCSI
pt_br: Destino

source: # Active/Optimized
pl_pl: # Aktywny/Zoptymalizowany

source: # Active/Non-Optimized
pl_pl: # Aktywny/Niezoptymalizowany

source: Active/Optimized
pl_pl: Aktywny/Zoptymalizowany

source: Active/Non-Optimized
pl_pl: Aktywny/Niezoptymalizowany

source: Read Bytes
pl_pl: Odczyt bajtów
pt_br: Bytes de Leitura

source: Write Bytes
pl_pl: Zapis bajtów
pt_br: Bytes de Gravação

source: Read Ops
pl_pl: Odczyt Ops
pt_br: Op. de Leitura

source: Write Ops
pl_pl: Zapis Ops
pt_br: Op. de Gravação

source: A/O Since
pl_pl: A/O Od
pt_br: A/O Desde

source: Instance
pl_pl: Instancja
pt_br: Instância

source: Issue
pl_pl: Zagadnienie
pt_br: Problema

source: State
pl_pl: Stan
pt_br: Estado

source: Progress
pl_pl: Progres
pt_br: Andamento

source: Edit Mode
pl_pl: Tryb Edycji
pt_br: Modo de Edição

source: Add Peer
pl_pl: Dodaj parowanie
pt_br: Adicionar Peer

source: Edit Peer
pl_pl: Edytuj parowanie
pt_br: Editar Peer

source: Delete Peer
pl_pl: Usuń parowanie
pt_br: Excluir Peer

source: Leader
pl_pl: Lider

source: mirror peer
pl_pl: lustrzane parowanie
pt_br: espelhar peer

source: Key
pl_pl: Klucz
pt_br: Chave

source: Deep flatten
pl_pl: Głębokie spłaszczenie
pt_br: Nivelamento profundo

source: Layering
pl_pl: Warstwowanie
pt_br: Disposição em camadas

source: Exclusive lock
pl_pl: Wyłączna blokada
pt_br: Bloqueio exclusivo

source: Object map (requires exclusive-lock)
pl_pl: Mapa obiektów (wymaga wyłącznej blokady)
pt_br: Mapa de objetos (requer bloqueio exclusivo)

source: Journaling (requires exclusive-lock)
pl_pl: Kronikowanie (wymaga wyłącznej blokady)
pt_br: Registro em diário (requer bloqueio exclusivo)

source: Fast diff (requires object-map)
pl_pl: Szybka różnica (wymaga mapy obiektów)

source: Copy
pl_pl: Kopia
pt_br: Copiar

source: Flatten
pl_pl: Spłaszcz
pt_br: Nivelar

source: Move to Trash
pl_pl: Przenieś do kosza
pt_br: Mover para Lixo

source: Create
pl_pl: Stwórz
pt_br: Criar

source: Rename
pl_pl: Zmień nazwę
pt_br: Renomear

source: Protect
pl_pl: Zabezpiecz
pt_br: Proteger

source: Unprotect
pl_pl: Odbezpiecz
pt_br: Cancelar proteção

source: Clone
pl_pl: Sklonuj
pt_br: Clonar

source: Rollback
pl_pl: Wycofanie
pt_br: Fazer Rollback

source: RBD snapshot rollback
pl_pl: Wycofywanie migawek RBD
pt_br: Rollback de instantâneo do RBD

source: RBD snapshot
pl_pl: migawka RBD
pt_br: Instantâneo do RBD

source: Restore
pl_pl: Przywróć
pt_br: Restaurar

source: Deleted At
pl_pl: Usunięty o
pt_br: Excluído à(s)

source: type
pl_pl: typ
pt_br: tipo

source: state
pl_pl: stan
pt_br: estado

source: version
pl_pl: wersja
pt_br: versão

source: root
pl_pl: administrator
pt_br: raiz

source: Rank
pl_pl: Ranga
pt_br: Posição

source: Daemon
pl_pl: Demon

source: Activity
pl_pl: Aktywność
pt_br: Atividade

source: Dentries
pl_pl: centrale

source: Inodes
pl_pl: i-węzły

source: Usage
pl_pl: Użycie
pt_br: Uso

source: Standby daemons
pl_pl: Czuwanie demona
pt_br: Daemons de standby

source: The value can be updated at runtime.
pl_pl: Wartość może być zaktualizowana w czasie wykonywania .
pt_br: É possível atualizar o valor em temo de execução.

source: Daemons/clients do not pull this value from the monitor config database. We disallow setting this option via 'ceph config set ...'. This option should be configured via ceph.conf or via the command line.
pl_pl: Demony/klienci nie pobierają tej wartości z bazy danych skonfigurowanego monitora. Nie zezwalamy na ustawienie tej opcji przez 'konfiguracje ceph ustaw.. '. Ta opcja powinna być skonfigurowana przez ceph.conf albo przez terminal.
pt_br: Daemons/clientes não extraem este valor do banco de dados de configuração do monitor. A configuração desta opção não é permitida por meio de 'ceph config set ...'. Essa opção deve ser configurada por meio do ceph.conf ou da linha de comando.

source: Option takes effect only during daemon startup.
pl_pl: Opcja działa tylko podczas startu demona.
pt_br: A opção entra em vigor apenas durante a inicialização do daemon.

source: Option only affects cluster creation.
pl_pl: Opcja dotyczy tylko tworzenia klastra.
pt_br: A opção afeta apenas a criação do cluster.

source: Option only affects daemon creation.
pl_pl: Opcja tylko wpływa na tworzenie demona.
pt_br: A opção afeta apenas a criação do daemon.

source: Updated config option {{name}}
pl_pl: Zaktualizowana opcja konfiguracji {{name}}

source: Service
pl_pl: Usługa
pt_br: Serviço

source: Current value
pl_pl: Obecna wartość
pt_br: Valor atual

source: Editable
pl_pl: Edytowalny
pt_br: Editável

source: Updated options for module " {{name}}".
pl_pl: Zaktualizowane opcje dla modułu &quot; {{name}}&quot;.

source: Enable
pl_pl: Włączyć
pt_br: Habilitar

source: Disable
pl_pl: Wyłączyć
pt_br: Desabilitar

source: Reconnecting, please wait ...
pl_pl: Ponowne łączenie, proszę czekać
pt_br: Reconectando, aguarde...

source: Public Address
pl_pl: Adres publiczny
pt_br: Endereço Público

source: Open Sessions
pl_pl: Otwarte sesje
pt_br: Sessões Abertas

source: No In
pl_pl: Nie w
pt_br: Não Entrada

source: OSDs that were previously marked out will not be marked back in when they start
pl_pl: OSD-ki, które zostały oznaczone jako poza, nie będą oznaczone ponownie jako w gdy zostaną uruchomion
pt_br: Os OSDs que já foram marcados como saída não serão remarcados como entrada ao serem iniciados

source: No Out
pl_pl: Nie poza
pt_br: Não Saída

source: OSDs will not automatically be marked out after the configured interval
pl_pl: OSD-ki nie będą automatycznie oznaczone jako poza po konfiguracji interwału
pt_br: Os OSDs não serão automaticamente marcados como saída após o intervalo configurado

source: No Up
pl_pl: Nie powstały
pt_br: Não Ativo

source: OSDs are not allowed to start
pl_pl: OSD-ki nie mogą startować
pt_br: Os OSDs não podem ser iniciados

source: No Down
pl_pl: Nie upadły
pt_br: Não Inativo

source: OSD failure reports are being ignored, such that the monitors will not mark OSDs down
pl_pl: Raport z niepowodzenia OSD jest ignorowany, także monitory nie oznaczą OSD jako upadłego.
pt_br: Os relatórios de falha de OSD estão sendo ignorados, portanto, os monitores não marcarão os OSDs como inativos

source: Pause
pl_pl: Pauza
pt_br: Pausar

source: Pauses reads and writes
pl_pl: Pauzuje czytanie i zapisywanie
pt_br: Pausa leituras e gravações

source: No Scrub
pl_pl: Nie szoruj
pt_br: Sem Remoção

source: Scrubbing is disabled
pl_pl: Szorowanie jest wyłączone
pt_br: Remoção desabilitada

source: No Deep Scrub
pl_pl: Nie ma głębokiego szorowania
pt_br: Sem Remoção Profunda

source: Deep Scrubbing is disabled
pl_pl: Głębokie szorowanie jest wyłączone
pt_br: Remoção Profunda desabilitada

source: No Backfill
pl_pl: Brak zasypywania
pt_br: Sem Provisionamento

source: Backfilling of PGs is suspended
pl_pl: Zasypywanie PG jest zawieszone
pt_br: Provisionamento de PGs suspenso

source: No Recover
pl_pl: Nie przywrócono
pt_br: Sem Recuperação

source: Recovery of PGs is suspended
pl_pl: Przywrócenie PGy jest zawieszone
pt_br: Recuperação de PGs suspensa

source: Bitwise Sort
pl_pl: Sortuj bitowo
pt_br: Classificação Bit a Bit

source: Use bitwise sort
pl_pl: Użyj sortowania bitowego
pt_br: Usar classificação bit a bit

source: Purged Snapdirs
pl_pl: Usuń snap katalogi
pt_br: Snapdirs Purgados

source: OSDs have converted snapsets
pl_pl: OSD-ki zmieniły snapsety
pt_br: OSDs converteram snapsets

source: Recovery Deletes
pl_pl: Odzyskaj usunięte
pt_br: Exclusões de Recuperação

source: Deletes performed during recovery instead of peering
pl_pl: Podczas zdrowienia zastosowano usunięcie zamiast parowania
pt_br: Exclusões realizadas durante a recuperação, e não o emparelhamento

source: PG Log Hard Limit
pl_pl: Twardy limit logów PG
pt_br: Limite Físico do Registro de PG
