Repository: ceph/ceph
Catalog: src/pybind/mgr/dashboard/frontend/src/locale/messages.*.xlf
Languages: ja_jp, pl_pl, pt_br, zh_cn

source: Puts a hard limit on pg log length
pl_pl: Ustawia twardy limit na długość logów PG
pt_br: Atribui um limite físico ao tamanho do registro de PG

source: Updated OSD Flags
pl_pl: Zaktualizowane flagi OSD-ków
pt_br: Flags OSD Atualizadas

source: Deep Scrub
pl_pl: Szoruj głęboko
pt_br: Remoção Profunda

source: Mark Out
pl_pl: Zaznacz jako poza
pt_br: Marcar como Saída

source: out
pl_pl: poza
pt_br: saída

source: Mark In
pl_pl: Zaznacz jako w
pt_br: Marcar como Entrada

source: in
pl_pl: w
pt_br: entrada

source: Mark Down
pl_pl: zaznacz jako upadły
pt_br: Marcar como Inativo

source: down
pl_pl: upadły
pt_br: inativo

source: Mark Lost
pl_pl: Zaznacz jako stracony
pt_br: Marcar como Perdido

source: Mark
pl_pl: Zaznacz
pt_br: Marcar

source: OSD lost
pl_pl: Stracony OSD
pt_br: OSD perdido

source: marked lost
pl_pl: Zaznaczony jako stracony
pt_br: marcado como perdido

source: Purge
pl_pl: Czyść
pt_br: Purgar

source: OSD
pl_pl: OSD-ik

source: purged
pl_pl: Oczyszczony
pt_br: purgado

source: Destroy
pl_pl: Zniszcz
pt_br: Destruir

source: destroy
pl_pl: Zniszcz
pt_br: destruir

source: destroyed
pl_pl: Zniszczony
pt_br: destruído

source: PGs
pl_pl: PG-y

source: Read bytes
pl_pl: Czytanie bajtów
pt_br: Bytes de leitura

source: Writes bytes
pl_pl: Zapis bajtów
pt_br: Bytes de gravação

source: Read ops
pl_pl: Czytanie ops
pt_br: Op. de leitura

source: Write ops
pl_pl: Zapis ops
pt_br: Op. de gravação

source: Mark OSD {{markAction}}
pl_pl: Zaznacz OSD {{markAction}}

source: Mark {{markAction}}
pl_pl: Zaznacz {{markAction}}

source: Max Backfills
pl_pl: Max zasypywanie
pt_br: Máx. de Provisionamentos

source: Recovery Max Active
pl_pl: Max aktywność wyzdrowienia
pt_br: Máx. Recuperação Ativo

source: Recovery Max Single Start
pl_pl: Max pojedynczy start wyzdrowienia
pt_br: Máx. Recuperação Inicialização Única

source: Recovery Sleep
pl_pl: Uśpienie wyzdrowienia
pt_br: Suspensão de Recuperação

source: Updated OSD recovery speed priority " {{value}}"
pl_pl: Zaktualizowano prędkość wyzdrowienia OSD priorytet &quot; {{value}}&quot;

source: {{operation}} was initialized in the following OSD: {{id}}
pl_pl: {{operation}} został zainicjalizowany w następującym OSD: {{id}}

source: Job
pl_pl: Praca
pt_br: Tarefa

source: Severity
pl_pl: surowość
pt_br: Gravidade

source: Started
pl_pl: Wystartowany
pt_br: Iniciado

source: Used
pl_pl: Użyty
pt_br: Usado

source: Avail.
pl_pl: Dostępny
pt_br: Disp.

source: Clean
pl_pl: Czyść
pt_br: Limpar

source: Working
pl_pl: Działający
pt_br: Em funcionamento

source: Unknown
pl_pl: Nieznany
pt_br: Desconhecido

source: up
pl_pl: Podniesiony
pt_br: ativo

source: no filesystems
pl_pl: brak systemów plików
pt_br: sem sistemas de arquivos

source: active
pl_pl: aktywny
pt_br: ativo

source: standby
pl_pl: Rezerwa

source: n/a
pl_pl: niedostępny

source: active daemon
pl_pl: aktywny demon
pt_br: daemon ativo

source: quorum
pl_pl: kworum

source: The NFS Ganesha service is not configured.
pl_pl: Usługa NFS Ganesha nie jest skonfigurowana
pt_br: O serviço NFS Ganesha não está configurado.

source: CephFS User
pl_pl: Użytkownik CephFS
pt_br: Usuário do CephFS

source: CephFS Filesystem
pl_pl: system plików CephFS
pt_br: Sistema de Arquivos do CephFS

source: (inherited from global config)
pl_pl: (Odziedziczyło z globalnej konfiguracji)
pt_br: (herdado da configuração global)

source: inherited from global config
pl_pl: Odziedziczyło z globalnej konfiguracji
pt_br: herdado da configuração global

source: -- Select what kind of user id squashing is performed --
pl_pl: -- Wybierz, jakiego rodzaju identyfikacja użytkownika ma być przeprowadzana --
pt_br: -- Selecionar que tipo de squash de ID de usuário será executado --

source: There are no daemons available.
pl_pl: Brak dostępnym demonów
pt_br: Não há daemons disponíveis.

source: Export
pl_pl: Eksport

source: Cache Mode
pl_pl: Tryb pamięci podręcznej
pt_br: Modo de Cache

source: Min Evict Age
pl_pl: Min wiek eksmisji
pt_br: Tempo Mín. Expulsão

source: Min Flush Age
pl_pl: Min wiek wyrównania
pt_br: Tempo Mín. Descarregamento

source: Target Max Bytes
pl_pl: Max bajtów obiektu docelowego
pt_br: Máx. de Bytes de Destino

source: Target Max Objects
pl_pl: Max obiektów docelowych
pt_br: Máx. de Objetos de Destino

source: No applications added
pl_pl: Nie dodano żadnego zastosowania
pt_br: Nenhum aplicativo adicionado

source: Applications limit reached
pl_pl: Osiągnięto limit zastosowań
pt_br: Limite de aplicativos atingido

source: A pool can only have up to four applications definitions.
pl_pl: Pul może mieć maksymalnie 4 definicje aplikacji.
pt_br: Um pool apenas pode ter até quatro definições de aplicativos.

source: Allowed characters '_a-zA-Z0-9'
pl_pl: Dozwolone znaki '_a-zA-Z0-9'
pt_br: Caracteres permitidos: '_a-zA-Z0-9'

source: Maximum length is 128 characters
pl_pl: Maksymalna długość wynosi 128 znaków
pt_br: Tamanho máximo de 128 caracteres

source: Filter or add applications
pl_pl: Filtruj lub dodaj zastosowanie
pt_br: Filtrar ou adicionar aplicativos

source: Add application
pl_pl: Dodaj zastosowanie
pt_br: Adicionar aplicativo

source: erasure code profile
pl_pl: skasuj profil kodu
pt_br: perfil de código de eliminação

source: Replica Size
pl_pl: Rozmiar repliki
pt_br: Tamanho da Réplica

source: Last Change
pl_pl: Ostatnia zmiana
pt_br: Última Alteração

source: Erasure Coded Profile
pl_pl: Skasuj profil zakodowany
pt_br: Perfil Codificado para Eliminação

source: Crush Ruleset
pl_pl: Zbiór zasad Crush
pt_br: Conjunto de Regras do Crush

source: Write bytes
pl_pl: Zapis bajtów
pt_br: Bytes de gravação

source: Updated Object Gateway bucket " {{bid}}"
pl_pl: Zaktualizowano wiadro dostępu obiektowego &quot; {{bid}}&quot;

source: Created Object Gateway bucket " {{bid}}"
pl_pl: Stworzono wiadro dostępu obiektowego &quot; {{bid}}&quot;

source: bucket
pl_pl: wiadro
pt_br: compartimento

source: buckets
pl_pl: Wiadra
pt_br: compartimentos

source: Updated Object Gateway user " {{uid}}"
pl_pl: Zaktualizowano użytkownika dostępu obiektowego &quot; {{uid}}&quot;

source: Created Object Gateway user " {{uid}}"
pl_pl: Stworzono użytkownika dostępu obiektowego&quot; {{uid}}&quot;

source: user
pl_pl: użytkownik
pt_br: usuário

source: users
pl_pl: użytkownicy
pt_br: usuários

source: Scope
pl_pl: Zakres
pt_br: Escopo

source: Read
pl_pl: Czytaj
pt_br: Leitura

source: Created role ' {{role_name}}'
pl_pl: Utwórz rolę ' {{role_name}}'

source: Updated role ' {{role_name}}'
pl_pl: Zaktualizuj rolę ' {{role_name}}'

source: System Role
pl_pl: System roli
pt_br: Função do Sistema

source: Deleted role ' {{role_name}}'
pl_pl: Usuń rolę ' {{role_name}}'

source: Created user " {{username}}"
pl_pl: Stwórz użytkownika &quot; {{username}}&quot;

source: Update user
pl_pl: Zaktualizuj użytkownika
pt_br: Atualizar usuário

source: Continue
pl_pl: Kontynuuj
pt_br: Continuar

source: You were automatically logged out because your roles have been changed.
pl_pl: Zostałeś automatycznie wylogowany, ponieważ zostały zmienione twoje role.
pt_br: Você foi automaticamente desconectado porque suas funções foram alteradas.

source: Updated user " {{username}}"
pl_pl: Zaktualizowano użytkownika &quot; {{username}}&quot;

source: Deleted user " {{username}}"
pl_pl: Usunięto użytkownika &quot; {{username}}&quot;

source: Failed to delete user " {{username}}"
pl_pl: Nie udało się usunąć użytkownika &quot; {{username}}&quot;

source: You are currently logged in as " {{username}}".
pl_pl: Jesteś obecnie zalogowany jako&quot; {{username}}&quot;.

source: Each object is split in data-chunks parts, each stored on a different OSD.
pl_pl: Każdy obiekt jest podzielony na części fragmentów danych, każdy jest przechowywany na innym OSD.
pt_br: Cada objeto é dividido em partes de pacotes de dados, cada uma armazenada em um OSD diferente.

source: Compute coding chunks for each object and store them on different OSDs. The number of coding chunks is also the number of OSDs that can be down without losing data.
pl_pl: Oblicz porcje kodu dla każdego obiektu i przechowuj je na różnych OSD. Liczba fragmentów kodujących to również liczba OSD, które mogą zostać wyłączone bez utraty danych.
pt_br: Calcule os pacotes de codificação de cada objeto e armazene-os em diferentes OSDs. O número de pacotes de codificação é também o número de OSDs que podem ficar inativos sem perda de dados.

source: The jerasure plugin is the most generic and flexible plugin, it is also the default for Ceph erasure coded pools.
pl_pl: Wtyczka jerasure jest najbardziej uniwersalną i elastyczną wtyczką, jest to również domyślne ustawienie dla pui kodowanych przez Ceph.
pt_br: O plug-in jerasure é o mais genérico e flexível, além de ser o padrão para pools codificados para eliminação do Ceph.

source: The more flexible technique is reed_sol_van : it is enough to set k and m. The cauchy_good technique can be faster but you need to chose the packetsize carefully. All of reed_sol_r6_op, liberation, blaum_roth, liber8tion are RAID6 equivalents in the sense that they can only be configured with m=2.
pl_pl: Bardziej elastyczną techniką jest reed_sol_van: wystarczy ustawić k oraz m. Technika cauchy_good może być szybsza, ale musisz wybrać rozmiar pakietu ostrożnie. Wszystkie reed_sol_r6_op, liberation, blaum_roth, liber8tion są odpowiednikami RAID6 w tym sensie, że mogą być skonfigurowane tylko z m = 2.
pt_br: A técnica mais flexível é reed_sol_van: ela é suficiente para definir k e m. A técnica cauchy_good pode ser mais rápida, mas você precisa escolher o tamanho do pacote com cuidado. Todos os reed_sol_r6_op, liberation, blaum_roth e liber8tion são equivalentes ao RAID6 no sentido de que só podem ser configurados com m=2.

source: The encoding will be done on packets of bytes size at a time. Chosing the right packet size is difficult. The jerasure documentation contains extensive information on this topic.
pl_pl: Kodowanie będzie wykonywane na pakietach o rozmiarze bajtów naraz. Wybór odpowiedniego rozmiaru pakietu jest trudny. Dokumentacja jerasure zawiera obszerne informacje na ten temat.
pt_br: A codificação será feita em pacotes de tamanho de bytes um de cada vez. A escolha do tamanho do pacote certo é difícil. A documentação do jerasure contém informações completas sobre este tópico.

source: With the jerasure plugin, when an erasure coded object is stored on multiple OSDs, recovering from the loss of one OSD requires reading from all the others. For instance if jerasure is configured with k=8 and m=4, losing one OSD requires reading from the eleven others to repair. The lrc erasure code plugin creates local parity chunks to be able to recover using less OSDs. For instance if lrc is configured with k=8, m=4 and l=4, it will create an additional parity chunk for every four OSDs. When a single OSD is lost, it can be recovered with only four OSDs instead of eleven.
pl_pl: Z wtyczką jerasure, gdy obiekt zakodowany przy użyciu skasowania jest przechowywany na wielu OSD-kach, odzyskiwanie po utracie jednego OSD wymaga odczytu ze wszystkich pozostałych. Na przykład, jeśli konfiguracja skryptu ma wartość k = 8 ,m = 4 i l=4, utrata jednego OSD wymaga odczytu od jedenastu innych do naprawy. Wtyczka kodu wymazywania lrc tworzy fragmenty o parzystości lokalnej, aby móc je odzyskać mniej OSD. Na przykład, jeśli lrc jest skonfigurowane z k = 8, m = 4 i l = 4, zostanie utworzony dodatkowy fragment parzystości na każde cztery OSD. Gdy jeden OSD zostanie utracone, może to być odzyskane tylko z czterema OSD zamiast jedenastu.
pt_br: Com o plug-in jerasure, quando um objeto codificado para eliminação é armazenado em vários OSDs, a recuperação após a perda de um OSD requer a leitura de todos os outros. Por exemplo, se o jerasure for configurado com k=8 e m=4, a perda de um OSD exigirá a leitura dos outros onze para fazer o reparo. O plug-in de código de eliminação lrc cria pacotes locais de paridade para conseguir recuperar usando menos OSDs. Por exemplo, se o lrc for configurado com k=8, m=4 e l=4, ele criará um pacote de paridade adicional para cada quatro OSDs. Quando um único OSD é perdido, ele pode ser recuperado apenas com quatro OSDs, em vez de onze.

source: Group the coding and data chunks into sets of size locality. For instance, for k=4 and m=2, when locality=3 two groups of three are created. Each set can be recovered without reading chunks from another set.
pl_pl: Grupuj fragmenty kodu i danych w zestawy lokalizacji wielkości. Na przykład, dla k = 4 i m = 2, gdy lokalność = 3 tworzone są dwie grupy po trzy. Każdy zestaw może odzyskać bez czytania kawałków z innego zestawu.
pt_br: Agrupe os pacotes de codificação e dados em conjuntos de localidades com tamanho. Por exemplo, no caso de k=4 e m=2, quando locality=3, dois grupos de três são criados. Cada conjunto pode ser recuperado sem a leitura dos pacotes do outro conjunto.

source: The type of the crush bucket in which each set of chunks defined by l will be stored. For instance, if it is set to rack, each group of l chunks will be placed in a different rack. It is used to create a CRUSH rule step such as step choose rack. If it is not set, no such grouping is done.
pl_pl: Typ wiadra CRUSH, w którym zdefiniowano każdy zestaw porcji przez l zostaną zapisane. Na przykład, jeśli jest ustawiony na rack, każda grupa l porcji będzie umieszczona w innym raku. Służy do utworzenia kroku reguły CRUSH, takiego jak krok wyboru racka. Jeśli nie jest ustawiony, nie ma takiego grupowania.
pt_br: O tipo do compartimento de crush em que cada conjunto de pacotes definido por l será armazenado. Por exemplo, se isso for definido como rack, cada grupo de pacotes l será colocado em um rack diferente. Isso é usado para criar uma etapa da regra CRUSH, como a etapa de escolha do rack. Se isso não for definido, esse tipo de agrupamento não será feito.

source: The isa plugin encapsulates the ISA library. It only runs on Intel processors.
pl_pl: Wtyczka isa zawiera bibliotekę ISA. Działa tylko na procesorach Intel.
pt_br: O plug-in isa encapsula a biblioteca ISA. Ele apenas é executado em processadores Intel.

source: The ISA plugin comes in two Reed Solomon forms. If reed_sol_van is set, it is Vandermonde, if cauchy is set, it is Cauchy.
pl_pl: Wtyczka ISA jest dostępna w dwóch formach Reed Solomon. Jeśli ustawiono reed_sol_van, jest to Vandermonde, jeśli ustawiono cauchy, to jest to Cauchy.
pt_br: O plug-in ISA vem em dois formatos de Reed Solomon. Se reed_sol_van for definido, ele será Vandermonde, se cauchy for definido, ele será Cauchy.

source: The shec plugin encapsulates the multiple SHEC library. It allows ceph to recover data more efficiently than Reed Solomon codes.
pl_pl: Wtyczka shec zawiera wiele bibliotek SHEC. Pozwala ceph odzyskać dane bardziej efektywnie niż kody Reeda Solomona.
pt_br: O plug-in shec encapsula a biblioteca múltipla SHEC. Ele permite ao ceph recuperar dados com mais eficiência do que os códigos de Reed Solomon.

source: The number of parity chunks each of which includes each data chunk in its calculation range. The number is used as a durability estimator. For instance, if c=2, 2 OSDs can be down without losing data.
pl_pl: Liczba kawałków parzystości, z których każdy zawiera każdą porcję danych w swoim zakresie obliczeń. Liczba jest używana jako estymator trwałości. Na przykład, jeśli c = 2, 2 OSD można wyłączyć bez utraty danych.
pt_br: O número de pacotes de paridade, em que cada um inclui cada pacote de dados em sua faixa de cálculo. O número é usado como estimador de durabilidade. Por exemplo, se c=2, 2 OSDs podem ficar inativos sem perda de dados.

source: The name of the crush bucket used for the first step of the CRUSH rule. For instance step take default.
pl_pl: Nazwa wiadra crush jest użyte do pierwszego kroku reguły CRUSH. Na przykład krok jest domyślny.
pt_br: O nome do compartimento de crush usado para a primeira etapa da regra CRUSH. Por exemplo, a etapa assumir o padrão.

source: Ensure that no two chunks are in a bucket with the same failure domain. For instance, if the failure domain is host no two chunks will be stored on the same host. It is used to create a CRUSH rule step such as step chooseleaf host.
pl_pl: Upewnij się, że żadne dwie porcje nie znajdują się w wiadrze z tą samą awarią domeny. Na przykład, jeśli domena awarii jest hostem, nie zostaną na niej zapisane dwie porcje hosta. Służy do utworzenia kroku reguły CRUSH, takiego jak krok wyboru hosta.
pt_br: Verifique se não há dois pacotes em um compartimento com o mesmo domínio de falha. Por exemplo, se o domínio de falha for um host, não armazene dois pacotes no mesmo host. Isso é usado para criar uma etapa da regra CRUSH, como a etapa de escolha do host folha.

source: Restrict placement to devices of a specific class (e.g., ssd or hdd), using the crush device class names in the CRUSH map.
pl_pl: Ogranicz umieszczanie do urządzeń określonej klasy (np. ssd lub hdd), używając nazw klas urządzeń zgniatających na mapie CRUSH.
pt_br: Restrinja o posicionamento a dispositivos de uma classe específica (ex. ssd ou hdd), usando nomes de classe de dispositivo crush no mapa CRUSH.

source: Set the directory name from which the erasure code plugin is loaded.
pl_pl: Ustaw nazwę katalogu, z którego ładowana jest wtyczka kodu kasowania.
pt_br: Defina o nome do diretório do qual o plug-in de código de eliminação é carregado.

source: Allows all operations
pl_pl: Dozwolone są wszystkie operacje
pt_br: Permite todas as operações

source: Allows only operations that do not modify the server
pl_pl: Dozwolone są operacje, które nie modyfikują serweru
pt_br: Permite apenas as operações que não modificam o servidor

source: Does not allow read or write operations, but allows any other operation
pl_pl: Operacje odczytu i zapisu są zakazane, wszystkie inne dozwolone
pt_br: Não permite operações de leitura ou gravação, mas permite qualquer outra operação

source: Does not allow read, write, or any operation that modifies file attributes or directory content
pl_pl: Operacje odczytu i zapisu, oraz wszystkie operacje modyfikujące atrybuty albo katalogi są zakazane
pt_br: Não permite leitura, gravação ou qualquer operação que modifica os atributos do arquivo ou o conteúdo do diretório

source: Allows no access at all
pl_pl: Brak dostępu w ogóle
pt_br: Não permite nenhum tipo de acesso

source: -- Select the priority --
pl_pl: -- wybierz priorytet --
pt_br: -- Selecionar prioridade --

source: Low
pl_pl: Niski
pt_br: Baixa

source: High
pl_pl: Wysoki
pt_br: Alta

source: Last 5 minutes
pl_pl: Ostatnie 5 minut
pt_br: Últimos 5 minutos

source: Last 15 minutes
pl_pl: Ostatnie 15 minut
pt_br: Últimos 15 minutos

source: Last 30 minutes
pl_pl: Ostatnie 30 minut
pt_br: Últimos 30 minutos

source: Last 1 hour (Default)
pl_pl: Ostatnia 1 godzina (domyślnie)
pt_br: Última 1 hora (Padrão)

source: Last 3 hours
pl_pl: Ostatnie 3 godziny
pt_br: Últimas 3 horas

source: Last 6 hours
pl_pl: Ostatnie 6 godzin
pt_br: Últimas 6 horas

source: Last 12 hours
pl_pl: Ostatnie 12 godzin
pt_br: Últimas 12 horas

source: Last 24 hours
pl_pl: Ostatnie 24 godziny
pt_br: Últimas 24 horas

source: Yesterday
pl_pl: Wczoraj
pt_br: Ontem

source: Today
pl_pl: Dzisiaj
pt_br: Hoje

source: Today so far
pl_pl: Do tej pory dzisiaj
pt_br: Até agora hoje

source: Day before yesterday
pl_pl: Przedwczoraj
pt_br: Antes de ontem

source: Last 2 days
pl_pl: Ostatnie 2 dni
pt_br: Últimos 2 dias

source: This day last week
pl_pl: Tego dnia tydzień temu
pt_br: Este dia na semana passada

source: Previous week
pl_pl: Poprzedni tydzień
pt_br: Semana anterior

source: This week
pl_pl: Ten tydzień
pt_br: Esta semana

source: This week so far
pl_pl: Do tej pory w tym tygodniu
pt_br: Até agora nesta semana

source: Last 7 days
pl_pl: Ostatnie 7 dni
pt_br: Últimos 7 dias

source: Previous month
pl_pl: Poprzedniego miesiąca
pt_br: Mês anterior

source: This month
pl_pl: ten miesiąc
pt_br: Este mês

source: This month so far
pl_pl: Do tej pory w tym miesiącu
pt_br: Até agora neste mês

source: Last 30 days
pl_pl: Ostatnie 30 dni
pt_br: Últimos 30 dias

source: Last 90 days
pl_pl: Ostatnie 90 dni
pt_br: Últimos 90 dias

source: Last 6 months
pl_pl: Ostatnie 6 miesięcy
pt_br: Últimos 6 meses

source: Last 1 year
pl_pl: Ostatni 1 rok
pt_br: Último ano

source: Previous year
pl_pl: Poprzedniego roku
pt_br: Ano anterior

source: This year
pl_pl: Bieżącego roku
pt_br: Este ano

source: This year so far
pl_pl: Do tej pory bieżącego roku
pt_br: Até agora neste ano

source: Last 2 years
pl_pl: Ostatnie 2 lata
pt_br: Últimos 2 anos

source: Last 5 years
pl_pl: Ostatnie 5 lat
pt_br: Últimos 5 anos

source: Information
pl_pl: Informacja
pt_br: Informações

source: No items selected.
pl_pl: Nie wybrano żadnej pozycji
pt_br: Nenhum item selecionado.

source: Deselect item to select again
pl_pl: Odznacz pozycję, żeby wybrać ponownie
pt_br: Desmarcar item para selecionar novamente

source: Selection limit reached
pl_pl: Osiągnięto limit wyboru.
pt_br: Limite de seleção atingido

source: Filter tags
pl_pl: Filtr tagów.
pt_br: Tags de filtro

source: Add badge
pl_pl: Dodaj odznakę
pt_br: Adicionar selo

source: There are no items available.
pl_pl: Brak dostępnych pozycji.
pt_br: Não há itens disponíveis.

source: Yes
pl_pl: Tak
pt_br: Sim

source: No
pl_pl: Nie
pt_br: Não

source: Quality of Service
pl_pl: Jakość serwisu
pt_br: Qualidade do Serviço

source: BPS Limit
pl_pl: Limit BPS
pt_br: Limite de BPS

source: The desired limit of IO bytes per second.
pl_pl: Pożądany limit IO bajtów na sekundę.
pt_br: O limite de bytes por segundo de E/S desejado.

source: IOPS Limit
pl_pl: Limit IOPS
pt_br: Limite de IOPS

source: The desired limit of IO operations per second.
pl_pl: Pożądany limit operacji IO na sekundę.
pt_br: O limite de operações por segundo de E/S desejado.

source: Read BPS Limit
pl_pl: limit odczytu BPS
pt_br: Limite de BPS de Leitura

source: The desired limit of read bytes per second.
pl_pl: Pożądany limit odczytu bajtów na sekundę.
pt_br: O limite de bytes por segundo de leitura desejado.

source: Read IOPS Limit
pl_pl: limit odczytu IOPS
pt_br: Limite de IOPS de Leitura

source: The desired limit of read operations per second.
pl_pl: Pożądany limit operacji odczytu na sekundę.
pt_br: O limite de operações por segundo de leitura desejado.

source: Write BPS Limit
pl_pl: Limit zapisu BPS
pt_br: Limite de BPS de Gravação

source: The desired limit of write bytes per second.
pl_pl: Pożądany limit zapisu bajtów na sekundę.
pt_br: O limite de bytes por segundo de gravação desejado.

source: Write IOPS Limit
pl_pl: Limit zapisu IOPS
pt_br: Limite de IOPS de Gravação

source: The desired limit of write operations per second.
pl_pl: Pożądany limit operacji zapisu na sekundę.
pt_br: O limite de operações por segundo de gravação desejado.

source: BPS Burst
pl_pl: Wiązka BPS
pt_br: Intermitência de BPS

source: The desired burst limit of IO bytes.
pl_pl: Żądana granica serii IO bajtów.
pt_br: O limite de bytes de E/S de intermitência desejado.

source: IOPS Burst
pl_pl: Wiązka IOPS
pt_br: Intermitência de IOPS

source: The desired burst limit of IO operations.
pl_pl: Żądana granica serii operacji IO.
pt_br: O limite de operações de E/S de intermitência desejado.

source: Read BPS Burst
pl_pl: Odczyt wiązki BPS
pt_br: Intermitência de BPS de Leitura

source: The desired burst limit of read bytes.
pl_pl: Żądana granica serii odczytanych bajtów.
pt_br: O limite de bytes de leitura de intermitência desejado.

source: Read IOPS Burst
pl_pl: Odczyt wiązki IOPS
pt_br: Intermitência de IOPS de Leitura

source: The desired burst limit of read operations.
pl_pl: Żądana granica serii operacji odczytu.
pt_br: O limite de operações de leitura de intermitência desejado.

source: Write BPS Burst
pl_pl: Zapis wiązki BPS
pt_br: Intermitência de BPS de Gravação
