Repository: ceph/ceph
Catalog: src/pybind/mgr/dashboard/frontend/src/locale/messages.*.xlf
Languages: ja_jp, pl_pl, pt_br, zh_cn

source: Delete enabled
ja_jp: 削除が有効
zh_cn: 启用删除

source: Enables MFA (multi-factor authentication) Delete, which requires additional authentication for changing the bucket versioning state.
ja_jp: MFA(多要素認証)の削除を有効にします。これには、バケットのバージョニング状態を変更するための追加の認証が必要です。
zh_cn: 启用 MFA（多重身份验证）删除功能，这样更改存储桶版本控制状态时将需要进行额外的身份验证。

source: Token Serial Number
ja_jp: トークンのシリアル番号
zh_cn: 令牌序列号

source: Token PIN
ja_jp: トークンPIN
zh_cn: 令牌 PIN

source: Enables locking for the objects in the bucket. Locking can only be enabled while creating a bucket.
ja_jp: バケット内のオブジェクトのロックを有効にします。バケットの作成中のみロックを有効にすることができます。
zh_cn: 对存储桶中的对象启用锁定功能。只有在创建存储桶时才能启用锁定功能。

source: Compliance
ja_jp: コンプライアンス
zh_cn: 合规

source: Governance
ja_jp: ガバナンス
zh_cn: 治理

source: The number of days that you want to specify for the default retention period that will be applied to new objects placed in this bucket.
ja_jp: このバケットに配置された新しいオブジェクトに適用されるデフォルトの保持期間に指定する日数。
zh_cn: 您要指定的默认保留天数，将应用于此存储桶中存放的新对象。

source: The entered value must be a positive integer.
ja_jp: 入力する値は正の整数にする必要があります。
zh_cn: 输入的值必须为正整数。

source: Retention Days must be a positive integer.
ja_jp: 保持日は正の整数である必要があります。
zh_cn: 保留天数必须为正整数。

source: Security
ja_jp: セキュリティ
zh_cn: 安全

source: bucket
ja_jp: バケット
zh_cn: 存储桶

source: Updated Object Gateway bucket ' values.bid'.
ja_jp: オブジェクトゲートウェイバケット「 values.bid」を更新しました。
zh_cn: 已更新对象网关存储桶 " values.bid"。

source: Created Object Gateway bucket ' values.bid'
ja_jp: オブジェクトゲートウェイバケット「 values.bid」を作成しました
zh_cn: 已创建对象网关存储桶 " values.bid"

source: No Limit
ja_jp: 制限なし
zh_cn: 无限制

source: Owner
ja_jp: 所有者
zh_cn: 所有者

source: Used Capacity
ja_jp: 使用済み容量
zh_cn: 已用容量

source: Capacity Limit %
ja_jp: 容量制限%
zh_cn: 容量上限 %

source: Object Limit %
ja_jp: オブジェクト制限%
zh_cn: 对象上限 %

source: buckets
ja_jp: バケット数
zh_cn: 存储桶

source: Performance Counters
ja_jp: パフォーマンスカウンタ
pl_pl: Liczniki wydajności
pt_br: Contadores de Desempenho
zh_cn: 性能计数器

source: Sync Performance
ja_jp: 同期パフォーマンス
zh_cn: 同步性能

source: Port
ja_jp: ポート
zh_cn: 端口

source: Realm
ja_jp: レルム
zh_cn: 领域

source: Zone Group
ja_jp: ゾーングループ
zh_cn: 区域组

source: Zone
ja_jp: ゾーン
zh_cn: 区域

source: -- Select a type --
ja_jp: -- タイプを選択してください --
pl_pl: -- wybierz typ --
pt_br: -- Selecionar tipo --
zh_cn: -- 请选择类型 --

source: Permission
ja_jp: 許可
pl_pl: Pozwolenie
pt_br: Permissão
zh_cn: 权限

source: -- Select a permission --
ja_jp: -- 許可を選択してください --
pl_pl: -- Wybierz pozwolenie --
pt_br: -- Selecionar permissão --
zh_cn: -- 请选择权限 --

source: capability
ja_jp: 機能
zh_cn: 权限

source: Tenant
ja_jp: テナント
zh_cn: 租户

source: User ID
ja_jp: ユーザID
zh_cn: 用户 ID

source: Full name
ja_jp: 氏名
pl_pl: Pełne imię
pt_br: Nome completo
zh_cn: 全名

source: Email address
ja_jp: 電子メールアドレス
pl_pl: Adres email
pt_br: Endereço de e-mail
zh_cn: 邮箱

source: Suspended
ja_jp: 中断済み
pl_pl: Zawieszony
pt_br: Suspenso
zh_cn: 已暂停

source: System
ja_jp: システム
pt_br: Sistema
zh_cn: 系统

source: Maximum buckets
ja_jp: 最大バケット数
pl_pl: Maksimum wiader
pt_br: Máximo de compartimentos
zh_cn: 存储桶数目上限

source: Subusers
ja_jp: サブユーザ
pl_pl: pod-użytkownicy
pt_br: Subusuários
zh_cn: 子用户

source: Capabilities
ja_jp: 機能
pl_pl: Zdolności
pt_br: Recursos
zh_cn: 权限

source: MFAs(Id)
ja_jp: MFA (ID)
zh_cn: MFA (ID)

source: User quota
ja_jp: ユーザクォータ
pl_pl: Limit użytkownika
pt_br: Cota do usuário
zh_cn: 用户配额

source: Keys
ja_jp: キー
pl_pl: Klucze
pt_br: Chaves
zh_cn: 密钥

source: Show
ja_jp: 表示
pl_pl: Pokaż
pt_br: Mostrar
zh_cn: 显示

source: Username
ja_jp: ユーザ名
zh_cn: 用户名

source: Unlimited
ja_jp: 無制限
zh_cn: 无限制

source: The value is not valid.
ja_jp: この値は無効です。
pl_pl: Wartość nie jest poprawna.
pt_br: O valor não é válido.
zh_cn: 该值无效。

source: The chosen user ID is already in use.
ja_jp: 選択されたユーザIDはすでに使用されています。
pl_pl: Wybrane ID użytkownika jest już użyte.
pt_br: O ID de usuário escolhido já está em uso.
zh_cn: 所选用户 ID 已被使用。

source: Show Tenant
ja_jp: テナントの表示
zh_cn: 显示租户

source: The chosen user ID exists in this tenant.
ja_jp: 選択されたユーザIDがこのテナントに存在します。
zh_cn: 此租户中存在所选用户 ID。

source: This is not a valid email address.
ja_jp: これは有効な電子メールアドレスではありません。
pl_pl: Ten adres email nie jest poprawny.
pt_br: Este não é um endereço de e-mail válido.
zh_cn: 这是无效的邮箱地址。

source: The chosen email address is already in use.
ja_jp: 選択された電子メールアドレスはすでに使用されています。
pl_pl: Wybrany adres email jest już użyty.
pt_br: O endereço de e-mail escolhido já está em uso.
zh_cn: 此邮箱地址已被使用。

source: Max. buckets
ja_jp: 最大バケット数
pl_pl: Max. wiader
pt_br: Máx. de compartimentos
zh_cn: 存储桶数目上限

source: Disabled
ja_jp: 無効化済み
pl_pl: Wyłączony
pt_br: Desabilitado
zh_cn: 已禁用

source: Custom
ja_jp: カスタム
pl_pl: Zwyczaj
pt_br: Personalizado
zh_cn: 自定义

source: The entered value must be >= 1.
ja_jp: 1以上の値を入力する必要があります。
zh_cn: 输入的值必须大于或等于 1。

source: S3 key
ja_jp: S3キー
pl_pl: klucz S3
pt_br: Chave S3
zh_cn: S3 密钥

source: Auto-generate key
ja_jp: キーの自動生成
pl_pl: Auto-generowany klucz
pt_br: Gerar chave automaticamente
zh_cn: 自动生成密钥

source: Access key
ja_jp: アクセスキー
pl_pl: Klucz dostępu
pt_br: Chave de acesso
zh_cn: 访问密钥

source: Secret key
ja_jp: 秘密キー
pl_pl: Tajny klucz
pt_br: Chave secreta
zh_cn: 秘密密钥

source: There are no subusers.
ja_jp: サブユーザがいません。
pl_pl: Nie ma pod-użytkowników.
pt_br: Não há subusuários.
zh_cn: 没有子用户。

source: There are no keys.
ja_jp: キーがありません。
pl_pl: Nie ma kluczy.
pt_br: Não há chaves.
zh_cn: 没有密钥。

source: There are no capabilities.
ja_jp: 機能がありません。
pl_pl: Nie ma zdolności.
pt_br: Não há recursos.
zh_cn: 没有权限。

source: All capabilities are already added.
ja_jp: すべての機能はすでに追加されています。
zh_cn: 已添加所有权限。

source: Unlimited size
ja_jp: 無制限のサイズ
pl_pl: Nielimitowany rozmiar
pt_br: Tamanho ilimitado
zh_cn: 大小无限制

source: Max. size
ja_jp: 最大サイズ
pl_pl: Max. rozmiar
pt_br: Tamanho máx.
zh_cn: 大小上限

source: Unlimited objects
ja_jp: 無制限のオブジェクト数
pl_pl: Nielimitowane obiekty
pt_br: Objetos ilimitados
zh_cn: 对象数目无限制

source: Max. objects
ja_jp: 最大オブジェクト数
pl_pl: Max. obiektów
pt_br: Máx. de objetos
zh_cn: 对象数目上限

source: The entered value must be >= 0.
ja_jp: 0以上の値を入力する必要があります。
pl_pl: Podana wartość musi być >= 0
pt_br: O valor inserido deve ser >= 0.
zh_cn: 输入的值必须大于或等于 0。

source: user
ja_jp: ユーザ
zh_cn: 用户

source: subuser
ja_jp: サブユーザ
zh_cn: 子用户

source: S3 Key
ja_jp: S3キー
zh_cn: S3 密钥

source: Updated Object Gateway user ' uid'
ja_jp: オブジェクトゲートウェイユーザ「 uid」を更新しました
zh_cn: 已更新对象网关用户 " uid"

source: Created Object Gateway user ' uid'
ja_jp: オブジェクトゲートウェイユーザ「 uid」を作成しました
zh_cn: 已创建对象网关用户 " uid"

source: Tenant
ja_jp: テナント
zh_cn: 租户

source: Full name
ja_jp: 氏名
zh_cn: 全名

source: Email address
ja_jp: 電子メールアドレス
zh_cn: 邮箱

source: Suspended
ja_jp: 中断済み
zh_cn: 已暂停

source: Max. buckets
ja_jp: 最大バケット数
zh_cn: 存储桶数目上限

source: users
ja_jp: ユーザ数
zh_cn: 用户

source: -- Select a username --
ja_jp: -- ユーザ名を選択してください --
pl_pl: -- Wybierz nazwę użytkownika --
pt_br: -- Selecionar nome de usuário --
zh_cn: -- 请选择用户名 --

source: Subuser
ja_jp: サブユーザ
pl_pl: pod-użytkownik
pt_br: Subusuário
zh_cn: 子用户

source: The chosen subuser ID is already in use.
ja_jp: 選択されたサブユーザIDはすでに使用されています。
pl_pl: Wybrane ID pod-użytkownika jest już użyte.
pt_br: O ID de subusuário escolhido já está em uso.
zh_cn: 所选子用户 ID 已被使用。

source: read, write
ja_jp: 読み取り、書き込み
pl_pl: odczyt, zapis
pt_br: leitura, gravação
zh_cn: 读写

source: full
ja_jp: フル
pl_pl: pełny
pt_br: completo
zh_cn: 全部

source: Swift key
ja_jp: スウィフトキー
pl_pl: Szybki klucz
pt_br: Chave Swift
zh_cn: Swift 密钥

source: Auto-generate secret
ja_jp: 秘密の自動生成
pl_pl: Auto-generowany sekret
pt_br: Gerar segredo automaticamente
zh_cn: 自动生成密钥

source: Subuser
ja_jp: サブユーザ
zh_cn: 子用户

source: Swift Key
ja_jp: スウィフトキー
zh_cn: Swift 密钥

source: Users
ja_jp: ユーザ
pl_pl: Użytkownicy
pt_br: Usuários
zh_cn: 用户

source: Roles
ja_jp: 役割
pl_pl: Role
pt_br: Funções
zh_cn: 角色

source: Neither hostname nor OSD ID given
ja_jp: ホスト名もOSD IDも指定されていません
zh_cn: 未提供主机名和 OSD ID

source: Device ID
ja_jp: デバイスID
zh_cn: 设备ID

source: State of Health
ja_jp: ヘルスの状態
zh_cn: 健康状态

source: Good
ja_jp: 良い
zh_cn: 良好

source: Bad
ja_jp: 悪い
zh_cn: 不佳

source: Stale
ja_jp: 古い
zh_cn: 过时

source: Life Expectancy
ja_jp: 耐用年数
zh_cn: 预计寿命

source: Prediction Creation Date
ja_jp: 予測作成日
zh_cn: 预测创建日期

source: Device Name
ja_jp: デバイス名
zh_cn: 设备名称

source: Daemons
ja_jp: デーモン
zh_cn: 守护进程

source: Failed to retrieve SMART data.
ja_jp: SMARTデータを取得できませんでした。
zh_cn: 无法检索 SMART 数据。

source: The data received has the JSON format version 2.x and is currently incompatible with the dashboard.
ja_jp: 取得したデータには、JSONフォーマットバージョン2.xがあり、現在はダッシュボードと互換性がありません。
zh_cn: 收到的数据为 JSON 2.x 版本格式，目前与仪表盘不兼容。

source: No SMART data available.
ja_jp: 利用可能なSMARTデータがありません。
zh_cn: 没有可用的 SMART 数据。

source: SMART overall-health self-assessment test result
ja_jp: SMART全体的なヘルス自己評価テスト結果
zh_cn: SMART 总体健康状况自评测试结果

source: unknown
ja_jp: 不明
zh_cn: 未知

source: passed
ja_jp: 成功
zh_cn: 通过

source: failed
ja_jp: 失敗
zh_cn: 失败

source: Device Information
ja_jp: デバイス情報
zh_cn: 设备信息

source: No device information available for this device.
ja_jp: このデバイスで利用可能なデバイス情報がありません。
zh_cn: 未获取此设备的设备信息。

source: No SMART data available for this device.
ja_jp: このデバイスで利用可能なSMARTデータがありません。
zh_cn: 未获取此设备的 SMART 数据。

source: SMART data is loading.
ja_jp: SMARTデータをロードしています。
zh_cn: 正在加载 SMART 数据。

source: Smartctl has received an unknown argument (error code smartData.smartctl_error_code). You may be using an incompatible version of smartmontools. Version >= 7.0 of smartmontools is required to successfully retrieve data.
ja_jp: Smartctlが不明な引数を受け取りました(エラーコード smartData.smartctl_error_code)。互換性のないバージョンのsmartmontoolsを使用している可能性があります。データを正常に取得するには、バージョン7.0以上のsmartmontoolsが必要です。
zh_cn: Smartctl 收到未知参数（错误代码 smartData.smartctl_error_code）。您使用的可能是不兼容的 smartmontools 版本。要成功检索数据，需使用 7.0 或更高版本的 smartmontools。

source: An error with error code smartData.smartctl_error_code occurred.
ja_jp: エラーコード smartData.smartctl_error_codeのエラーが発生しました。
zh_cn: 发生错误，错误代码 smartData.smartctl_error_code。

source: Raw
ja_jp: 生
zh_cn: 裸容量

source: Threshold
ja_jp: しきい値
zh_cn: 阈值

source: When Failed
ja_jp: 失敗した場合
zh_cn: 失败时

source: Worst
ja_jp: 最低
zh_cn: 最差

source: Please set a new password.
ja_jp: 新しいパスワードを設定してください。
zh_cn: 请设置一个新密码。

source: You will be redirected to the login page afterwards.
ja_jp: その後、ログインページにリダイレクトされます。
zh_cn: 之后，您将被重定向到登录页面。

source: The old and new passwords must be different.
ja_jp: 新しいパスワードは古いパスワードと異なる必要があります。
zh_cn: 新旧密码必须不同。

source: Password confirmation doesn't match the new password.
ja_jp: 確認入力されたパスワードが新しいパスワードと一致しません。
zh_cn: 确认密码与新密码不一致。

source: Username is required
ja_jp: ユーザ名は必須です
pl_pl: Nazwa użytkownika jest wymagana
pt_br: Nome de usuário é obrigatório
zh_cn: 必须输入用户名

source: Password is required
ja_jp: パスワードは必須です
pl_pl: Hasło jest wymagane.
pt_br: Senha é obrigatória
zh_cn: 必须输入密码

source: Log in
ja_jp: ログイン
zh_cn: 登录

source: Scope
ja_jp: 範囲
zh_cn: 作用范围

source: Read
ja_jp: 読み取り
zh_cn: 读取

source: Create
ja_jp: 作成
zh_cn: 创建

source: Update
ja_jp: 更新
zh_cn: 更新

source: Delete
ja_jp: 削除
zh_cn: 删除

source: Description...
ja_jp: 説明...
pl_pl: Opis...
pt_br: Descrição...
zh_cn: 描述...

source: Permissions
ja_jp: 許可
pl_pl: Pozwolenia
pt_br: Permissões
zh_cn: 权限

source: role
ja_jp: 役割
zh_cn: 角色

source: All
ja_jp: すべて
zh_cn: 所有

source: Created role ' roleFormModel.name'
ja_jp: 役割「 roleFormModel.name」を作成しました
zh_cn: 已创建角色 " roleFormModel.name"

source: Updated role ' roleFormModel.name'
ja_jp: 役割「 roleFormModel.name」を更新しました
zh_cn: 已更新角色 " roleFormModel.name"

source: System Role
ja_jp: システム役割
zh_cn: 系统角色

source: Deleted role ' role'
ja_jp: 役割「 role」を削除しました
zh_cn: 已删除角色 " role"

source: New name
ja_jp: 新しい名前
zh_cn: 新名称

source: Clone Role
ja_jp: 役割の複製
zh_cn: 克隆角色

source: Cloned role ' values['newName']' from ' name'
ja_jp: 役割「 values['newName']」を「 name」から複製しました
zh_cn: 已从 " name" 克隆角色 " values['newName']"

source: The username already exists.
ja_jp: ユーザ名はすでに存在します。
zh_cn: 该用户名已存在。

source: Confirm password
ja_jp: パスワードの確認入力
pl_pl: Potwierdź hasło
pt_br: Confirmar senha
zh_cn: 确认密码

source: Password confirmation doesn't match the password.
ja_jp: 確認入力されたパスワードがパスワードと一致しません。
pl_pl: Potwierdzające hasło nie pokrywa się z hasłem.
pt_br: A confirmação de senha não corresponde à senha.
zh_cn: 确认密码与之前输入的密码不一致。

source: Password expiration date
ja_jp: パスワードの失効日
zh_cn: 密码超期日期

source: Password expiration date...
ja_jp: パスワードの失効日...
zh_cn: 密码超期日期...

source: Email
ja_jp: 電子メール
zh_cn: 邮箱

source: Invalid email.
ja_jp: 無効な電子メールです。
pl_pl: Niepoprawny email.
pt_br: E-mail inválido.
zh_cn: 邮箱无效。

source: User must change password at next logon
ja_jp: ユーザは次回のログオン時にパスワードを変更する必要があります
zh_cn: 用户下次登录时必须更改密码

source: You are about to remove "user read / update" permissions from your own user.
ja_jp: 自身のユーザから「user read / update」という許可を削除しようとしています。
pl_pl: Zamierzasz usunąć uprawnienia „odczytu / aktualizacji użytkownika” od własnego użytkownika.
pt_br: Você está prestes a remover as permissões de "leitura/atualização de usuário" do seu próprio usuário.
zh_cn: 您即将删除您自己的 "用户读取/更新" 权限。

source: If you continue, you will no longer be able to add or remove roles from any user.
ja_jp: 続行した場合は、どのユーザの役割も追加または削除できなくなります。
pl_pl: Jeśli kontynuujesz, nie będziesz mógł dodawać albo usuwać role od użytkowników.
pt_br: Se você continuar, não poderá mais adicionar ou remover funções de nenhum usuário.
zh_cn: 如果继续，您将再也无法为任何用户添加或删除角色。

source: There are no roles.
ja_jp: 役割はありません。
zh_cn: 没有角色。

source: Created user ' userFormModel.username'
ja_jp: ユーザ「 userFormModel.username」を作成しました
zh_cn: 已创建用户 " userFormModel.username"

source: Update user
ja_jp: ユーザの更新
zh_cn: 更新用户

source: You were automatically logged out because your roles have been changed.
ja_jp: このユーザの役割が変更されたため、このユーザは自動的にログアウトされました。
zh_cn: 您被自动登出，因为您的角色有了变动。

source: Updated user ' userFormModel.username'
ja_jp: ユーザ「 userFormModel.username」を更新しました
zh_cn: 已更新用户 " userFormModel.username"

source: Email
ja_jp: 電子メール
zh_cn: 邮箱

source: Roles
ja_jp: 役割
zh_cn: 角色

source: Deleted user ' username'
ja_jp: ユーザ「 username」を削除しました
zh_cn: 已删除用户 " username"

source: Failed to delete user ' username'
ja_jp: ユーザ「 username」を削除できませんでした
zh_cn: 无法删除用户 " username"

source: You are currently logged in as ' username'.
ja_jp: 現在「 username」としてログインしています。
zh_cn: 您当前以 " username" 身份登录。

source: Old password
ja_jp: 古いパスワード
zh_cn: 旧密码

source: New password
ja_jp: 新しいパスワード
zh_cn: 新密码

source: Confirm new password
ja_jp: 新しいパスワードの確認入力
zh_cn: 确认新密码

source: password
ja_jp: パスワード
zh_cn: 密码

source: Updated user password"
ja_jp: ユーザパスワードを更新しました
zh_cn: 已更新用户密码"

source: Selected Object Gateway:
ja_jp: オブジェクトゲートウェイを選択しました:
zh_cn: 所选对象网关：

source: Select Object Gateway
ja_jp: オブジェクトゲートウェイを選択
zh_cn: 选择对象网关

source: Page not Found
ja_jp: ページが見つかりません
zh_cn: 找不到页面

source: Sorry, we couldn’t find what you were looking for. The page you requested may have been changed or moved.
ja_jp: 検索していた内容が見つかりませんでした。 要求したページが変更または移動された可能性があります。
zh_cn: 抱歉，找不到您要查找的数据。您请求的页面可能已被更改或移动。

source: Go To Dashboard
ja_jp: ダッシュボードに移動
zh_cn: 转到仪表盘

source: Page Not Found
ja_jp: ページが見つかりません
zh_cn: 找不到页面

source: Sorry, we couldn’t find what you were looking for. The page you requested may have been changed or moved.
ja_jp: 検索していた内容が見つかりませんでした。 要求したページが変更または移動された可能性があります。
zh_cn: 抱歉，找不到您要查找的数据。 您请求的页面可能已被更改或移动。

source: Access Denied
ja_jp: アクセスが拒否されました
zh_cn: 访问拒绝

source: Sorry, you don’t have permission to view this page or resource.
ja_jp: このページまたはリソースを表示する権限がありません。
zh_cn: 抱歉，您无权限浏览页面或资源

source: User Denied
ja_jp: ユーザが拒否されました
zh_cn: 已拒绝用户

source: Sorry, the user does not exist in Ceph. You'll be logged out from the Identity Provider when you retry logging in.
ja_jp: このユーザはCephに存在しません。 ログインを再試行すると、Identity Providerからログアウトされます。
zh_cn: 抱歉，Ceph 中不存在该用户。 当您重新尝试登录时，将会从该身份提供者中登出。

source: Help
ja_jp: ヘルプ
zh_cn: 帮助

source: Security
ja_jp: セキュリティ
zh_cn: 安全

source: Trademarks
ja_jp: 商標
zh_cn: 商标

source: Dashboard Settings
ja_jp: ダッシュボード設定
pl_pl: Ustawienia Pulpitu
pt_br: Configurações do Painel de Controle
zh_cn: 仪表盘设置

source: User management
ja_jp: ユーザ管理
pl_pl: Zarządzanie użytkownikami
pt_br: Gerenciamento de usuários
zh_cn: 用户管理

source: Telemetry configuration
ja_jp: テレメトリ設定
zh_cn: 遥测配置

source: Help
ja_jp: ヘルプ
pl_pl: Pomoc
pt_br: Ajuda
zh_cn: 帮助

source: documentation
ja_jp: ドキュメント
zh_cn: 文档

source: About
ja_jp: バージョン情報
pl_pl: O
pt_br: Sobre
zh_cn: 关于

source: Logged in user
ja_jp: ログイン済みユーザ
pl_pl: Zalogowany użytkownik
pt_br: Usuário que efetuou login
zh_cn: 登录的用户

source: Signed in as {{ username }}
ja_jp: {{ username }} としてサインイン済み
zh_cn: 以 {{ username }} 身份登录

source: Change password
ja_jp: パスワードの変更
zh_cn: 更改密码

source: Sign out
ja_jp: サインアウト
pl_pl: Wyloguj
pt_br: Efetuar logout
zh_cn: 登出

source: Toggle navigation
ja_jp: ナビゲーションの切り替え
pl_pl: Rozwiń
pt_br: Alternar navegação
zh_cn: 切换导航

source: Dashboard
ja_jp: ダッシュボード
pl_pl: Pulpit
pt_br: Painel de controle
zh_cn: 仪表盘

source: CRUSH map
ja_jp: CRUSHマップ
pl_pl: CRUSH mapa
pt_br: Mapa CRUSH
zh_cn: CRUSH 索引

source: Manager Modules
ja_jp: マネージャモジュール
zh_cn: Manager 模块

source: Logs
ja_jp: ログ
pl_pl: Logi
pt_br: Registros
zh_cn: 日志

source: Block
ja_jp: ブロック
pl_pl: Dostęp blokowy
pt_br: Bloco
zh_cn: 块设备

source: Mirroring
ja_jp: ミラーリング
pl_pl: Kopia lustrzana
pt_br: Espelhamento
zh_cn: 镜像

source: File Systems
ja_jp: ファイルシステム
zh_cn: 文件系统

source: Buckets
ja_jp: バケット
pl_pl: Wiadra
pt_br: Compartimentos
zh_cn: 存储桶

source: Tasks and Notifications
ja_jp: タスクと通知
zh_cn: 任务和通知

source: The name of the node under which data should be placed.
ja_jp: データを配置する必要があるノードの名前。
zh_cn: 应用于存放数据的节点的名称。

source: The type of CRUSH nodes across which we should separate replicas.
ja_jp: レプリカを分離する必要のあるCRUSHノードのタイプ。
zh_cn: 我们应为其分隔副本的 CRUSH 节点类型。

source: The device class data should be placed on.
ja_jp: デバイスクラスデータを配置する必要があります。
zh_cn: 应用于存放数据的设备类型。

source: Each object is split in data-chunks parts, each stored on a different OSD.
ja_jp: 各オブジェクトは複数のデータチャンクパートに分割されており、それぞれのパートは異なるOSDに保管されています。
zh_cn: 各对象都被分割为数据块，分别存储于不同的 OSD。

source: Compute coding chunks for each object and store them on different OSDs. The number of coding chunks is also the number of OSDs that can be down without losing data.
ja_jp: 各オブジェクトのコーディングチャンクを計算して、これらのチャンクを別々のOSDに保管します。 コーディングチャンクの数は、データを失うことなくダウン状態になることができるOSDの数でもあります。
zh_cn: 计算各对象的编码块，并存储于不同的 OSD。 编码块的数量等同于在不丢数据的前提下允许同时停用的 OSD 数量。

source: The jerasure plugin is the most generic and flexible plugin, it is also the default for Ceph erasure coded pools.
ja_jp: jerasureプラグインは最も汎用的で柔軟性の高いプラグインです。 このプラグインは、Cephイレイジャコード化済みプール用のデフォルトでもあります。
zh_cn: jerasure 插件是最通用、最灵活的插件， 也是 Ceph 纠删码存储池的默认插件。

source: The more flexible technique is reed_sol_van : it is enough to set k and m. The cauchy_good technique can be faster but you need to chose the packetsize carefully. All of reed_sol_r6_op, liberation, blaum_roth, liber8tion are RAID6 equivalents in the sense that they can only be configured with m=2.
ja_jp: さらに柔軟性の高い技法はreed_sol_vanです。kとmを 設定するだけで十分です。 cauchy_good技法はより高速となり得ますが、パケットサイズを慎重に選択する必要があります。 reed_sol_r6_op、liberation、blaum_roth、liber8tionはすべて、 m=2を使用した設定のみが可能という意味でRAID6と同等です。
zh_cn: reed_sol_van 算法更灵活：它足以设置 k 和 m 值。 cauchy_good 算法更快，但您需要谨慎选择 packetsize 值。 reed_sol_r6_op、liberation、blaum_roth、 liber8tion 都是与 RAID6 等价的算法， 只能为它们配置 m=2。

source: The encoding will be done on packets of bytes size at a time. Choosing the right packet size is difficult. The jerasure documentation contains extensive information on this topic.
ja_jp: エンコードはバイトサイズのパケット群に対して同時に実行されます。 適切なパケットサイズを選択することは困難です。 jerasureのドキュメントにはこのトピックに関する詳細な情報が記載されています。
zh_cn: 一次将对多少字节的数据包执行编码。 选择合适的数据包大小很难。 Jerasure 文档中包含了有关此主题的详尽信息。

source: With the jerasure plugin, when an erasure coded object is stored on multiple OSDs, recovering from the loss of one OSD requires reading from all the others. For instance if jerasure is configured with k=8 and m=4, losing one OSD requires reading from the eleven others to repair. The lrc erasure code plugin creates local parity chunks to be able to recover using less OSDs. For instance if lrc is configured with k=8, m=4 and l=4, it will create an additional parity chunk for every four OSDs. When a single OSD is lost, it can be recovered with only four OSDs instead of eleven.
ja_jp: jerasureプラグインを使用すると、イレイジャコード化済みオブジェクトが複数のOSDに保管されている場合は、 1つのOSDの喪失から回復するには、他のすべてのOSDからの読み取りが必要になります。 たとえば、k=8およびm=4を使用してjerasureが設定されている場合は、1つのOSDが失われた場合、 修復のためには他の11個のOSDからの読み取りが必要になります。 lrcイレイジャコードプラグインは、これより少ないOSDを使用した回復を可能にするために、 ローカルパリティチャンクを作成します。たとえば、lrcがk=8、m=4、およびl=4を使用して設定されている場合は、 lrcは、4つのOSDごとに1つの追加パリティチャンクを作成します。1つのOSDが失われた場合は、 11個の代わりに4つのOSDのみを使用してそのOSDを回復できます。
zh_cn: 使用 jerasure 插件时，纠删码编码的对象存储在多个 OSD 上， 丢失一个 OSD，恢复时就需要读取所有其他的 OSD。 例如，如果 jerasure 的配置为 k=8 且 m=4，丢失一个 OSD 后需读取其他十一个 OSD 才能恢复。 lrc 纠删码插件创建的是局部奇偶校验块，这样只需较少的 OSD 即可恢复。 例如，如果 lrc 的配置为 k=8，m=4 且 l=4，它将为每四个 OSD 创建额外的奇偶校验块。 当一个 OSD 丢失时，它只需四个 OSD 即可恢复，而不需要十一个 OSD。

source: Group the coding and data chunks into sets of size locality. For instance, for k=4 and m=2, when locality=3 two groups of three are created. Each set can be recovered without reading chunks from another set.
ja_jp: コーディングチャンクとデータチャンクをサイズ地域の複数セットにグループ分けします。 たとえば、k=4およびm=2の場合に、［地域］=3の場合は、3つのチャンクからなるグループが2つ作成されます。 各セットは、別のセットからチャンクを読み取ることなく回復できます。
zh_cn: 将编码块和数据块分组为大小为 locality 的集合。 例如，当 k=4 且 m=2 时，如果设置 locality=3，将会分组为大小为三的两组。 这样每个组都能自行恢复，无需从另一组读数据块。

source: The type of the crush bucket in which each set of chunks defined by l will be stored. For instance, if it is set to rack, each group of l chunks will be placed in a different rack. It is used to create a CRUSH rule step such as step choose rack. If it is not set, no such grouping is done.
ja_jp: 1によって定義されたチャンクの各セットが保管されるCrushバケットのタイプ。 たとえば、このバケットタイプがラックに設定されている場合は、1のチャンクの各グループは異なるラックに配置されます。 このバケットタイプを使用して、「ラックの選択」ステップなどのCRUSHルールステップが作成されます。 このバケットタイプが設定されていない場合は、このようなグループ分けは行われません。
zh_cn: 由 l 定义的块集合将按哪种 crush 桶类型存储。 例如，如果设置为 rack，大小为 l 块的各组将被存入不同的机架。 此值用于创建类似 step choose rack 的 CRUSH 规则步骤。 如果未设置，就不会这样分组。

source: The isa plugin encapsulates the ISA library. It only runs on Intel processors.
ja_jp: isaプラグインはISAライブラリをカプセル化します。このプラグインはIntelプロセッサ上のみで動作します。
zh_cn: isa 插件封装了 ISA 库，只能在 Intel 处理器上运行。

source: The ISA plugin comes in two Reed Solomon forms. If reed_sol_van is set, it is Vandermonde, if cauchy is set, it is Cauchy.
ja_jp: ISAプラグインは2つのリードソロモン形式で提供されています。reed_sol_vanが設定されている場合は、Vandermondeであり、cauchyが設定されている場合は、Cauchyです。
zh_cn: ISA 插件包含两种 Reed Solomon 编码形式。 设置为 reed_sol_van 时表示使用 Vandermonde 算法，设置为 cauchy 时表示使用 Cauchy 算法。

source: The shec plugin encapsulates the multiple SHEC library. It allows ceph to recover data more efficiently than Reed Solomon codes.
ja_jp: shecプラグインは複数のSHECライブラリをカプセル化します。 このプラグインを使用すると、cephはリードソロモンコードより効率的にデータを回復できます。
zh_cn: Shec 插件封装了 multiple SHEC 库。 与 Reed Solomon 编码相比，它能使 Ceph 更高效地恢复数据。

source: The number of parity chunks each of which includes each data chunk in its calculation range. The number is used as a durability estimator. For instance, if c=2, 2 OSDs can be down without losing data.
ja_jp: それぞれが各データチャンクを各自の計算範囲内に含んでいるパリティチャンクの数。 この数は、耐久性推定子として使用されます。 たとえば、c=2の場合は、データを失うことなく2つのOSDがダウン状態になることができます。
zh_cn: 奇偶校验块数量，它们在各自的计算范围内包含了各数据块。 此数值用作持久性估值。例如，假设 c=2 在不丟失数据的情况下可停用 2 个 OSD。

source: CLAY (short for coupled-layer) codes are erasure codes designed to bring about significant savings in terms of network bandwidth and disk IO when a failed node/OSD/rack is being repaired.
ja_jp: CLAY (結合層の略)コードは、障害が発生したノード/OSD/ラックの修復時に、 ネットワーク帯域幅とディスクIOの面で大幅な節約を実現するように設計されたイレイジャコードです。
zh_cn: CLAY（耦合层缩写）代码是可用于 在修复故障节点/OSD/机架时显著节省 网络带宽和磁盘 IO 的纠删码。

source: Number of OSDs requested to send data during recovery of a single chunk. d needs to be chosen such that k+1 <= d <= k+m-1. The larger the d, the better the savings.
ja_jp: 単一チャンクの回復中にデータの送信を要求したOSDの数。dは、k+1 <= d <= k+m-1 となるように選択する必要があります。dが大きいほど、節約率が高くなります。
zh_cn: 恢复单个数据块期间请求发送数据的 ODS 数量。 选择的 d 需要大于等于 k+1 且小于等于 k+m-1。d 越大，节省的越多。
