Repository: ceph/ceph
Catalog: src/pybind/mgr/dashboard/frontend/src/locale/messages.*.xlf
Languages: ja_jp, pl_pl, pt_br, zh_cn

source: The desired burst limit of write bytes.
pl_pl: Żądana granica serii bajtów zapisu.
pt_br: O limite de bytes de gravação de intermitência desejado.

source: Write IOPS Burst
pl_pl: Zapis wiązki IOPS
pt_br: Intermitência de IOPS de Gravação

source: The desired burst limit of write operations.
pl_pl: Żądana granica serii operacji zapisu.
pt_br: O limite de operações de gravação de intermitência desejado.

source: Failed to {{failure}} {{metadata}}
pl_pl: Nie powiodło się {{failure}} {{metadata}}

source: Executing
pl_pl: Wykonywanie
pt_br: Executando

source: execute
pl_pl: Wykonaj
pt_br: executar

source: Executed
pl_pl: Wykonany
pt_br: Executado

source: unknown task
pl_pl: Nieznane zadanie
pt_br: tarefa desconhecida

source: Creating
pl_pl: Tworzenie
pt_br: Criando

source: create
pl_pl: Utwórz
pt_br: criar

source: Updating
pl_pl: Aktualizowanie
pt_br: Atualizando

source: update
pl_pl: Zaktualizuj
pt_br: atualizar

source: Updated
pl_pl: Zaktualizowany
pt_br: Atualizado

source: Deleting
pl_pl: Usuwanie
pt_br: Excluindo

source: delete
pl_pl: Usuń
pt_br: excluir

source: Deleted
pl_pl: Usunięty
pt_br: Excluído

source: RBD ' {{id}}'
pl_pl: urządzenie blokowe Rados ' {{id}}'

source: RBD snapshot ' {{id}}'
pl_pl: migawka RBD ' {{id}}'

source: mirror mode for pool ' {{id}}'
pl_pl: tryb lustrzany dla pula ' {{id}}'

source: mirror peer for pool ' {{id}}'
pl_pl: Lustrzane parowanie dla pula ' {{id}}'

source: Name is already used by {{pool_name}}.
pl_pl: Nazwa jest już użyta przez {{pool_name}}.

source: Name is already used by {{name}}.
pl_pl: Nazwa jest już używana przez {{name}}.

source: Name is already used by {{rbd_name}}.
pl_pl: Nazwa jest już używana przez {{rbd_name}}.

source: {{rbd_name}} contains snapshots.
pl_pl: {{rbd_name}} zawiera migawkę.

source: Cloning
pl_pl: Klonowanie
pt_br: Clonando

source: clone
pl_pl: Sklonuj
pt_br: clonar

source: Cloned
pl_pl: Sklonowano
pt_br: Clonado

source: Snapshot of {{rbd_name}} must be protected.
pl_pl: Migawka {{rbd_name}} musi być zabezpieczona.

source: Copying
pl_pl: Kopiowanie
pt_br: Copiando

source: copy
pl_pl: Kopiuj
pt_br: copiar

source: Copied
pl_pl: Skopiowano
pt_br: Copiado

source: Flattening
pl_pl: Spłaszczanie
pt_br: Nivelando

source: flatten
pl_pl: Spłaszcz
pt_br: nivelar

source: Flattened
pl_pl: Spłaszczony
pt_br: Nivelado

source: Name is already used by {{snap_name}}.
pl_pl: Nazwa już jest używana przez {{snap_name}}.

source: Cannot unprotect {{snap_name}} because it contains child images.
pl_pl: Nie można zdjąć zabezpieczenia {{snap_name}} , ponieważ zawiera pokrewne obrazy.

source: Cannot delete {{snap_name}} because it's protected.
pl_pl: Nie można usunąć {{snap_name}}, ponieważ jest zabezpieczony.

source: Rolling back
pl_pl: Wycofywanie
pt_br: Fazendo rollback

source: rollback
pl_pl: Wycofanie

source: Rolled back
pl_pl: Wycofaj
pt_br: Rollback feito

source: Moving
pl_pl: Przenoszenie
pt_br: Movendo

source: move
pl_pl: Przenieś
pt_br: mover

source: Moved
pl_pl: Przeniesiono
pt_br: Movido

source: image ' {{id}}' to trash
pl_pl: Obraz ' {{id}}' przenieś do kosza

source: Could not find image.
pl_pl: Nie znaleziono obrazu.
pt_br: Imagem não encontrada.

source: Restoring
pl_pl: Przywracanie
pt_br: Restaurando

source: restore
pl_pl: Przywróć
pt_br: restaurar

source: Restored
pl_pl: Przywrócony
pt_br: Restaurado

source: image ' {{id}}' into ' {{new_id}}'
pl_pl: Obraz ' {{id}}' w ' {{new_id}}'

source: Image name ' {{id}}' is already in use.
pl_pl: Nazwa obrazu ' {{id}}' jest już używana.

source: image ' {{id}}'
pl_pl: Obraz ' {{id}}'

source: Purging
pl_pl: oczyszczać
pt_br: Purgando

source: purge
pl_pl: oczyść
pt_br: purgar

source: Purged
pl_pl: Oczyszczony
pt_br: Purgado

source: all pools
pl_pl: Wszystkie pule
pt_br: todos os pools

source: images from {{message}}
pl_pl: Obraz z {{message}}

source: Cannot disable mirroring because it contains a peer.
pl_pl: Nie można wyłączyć lustrzenia ponieważ zawiera parowanie.
pt_br: Impossível desabilitar espelhamento porque ele contém um peer.

source: pool ' {{pool_name}}'
pl_pl: pul ' {{pool_name}}'

source: erasure code profile ' {{name}}'
pl_pl: skasuj profil kodu ' {{name}}'

source: target ' {{target_iqn}}'
pl_pl: docelowy ' {{target_iqn}}'

source: CephX ID
pt_br: ID do CephX

source: CephX ID...
pt_br: ID do CephX...

source: Histogram
pt_br: Histograma

source: Transport
pt_br: Transporte
